{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/ExpProject/workingfolder/ind_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}19 Jun 2019, 16:22:55
{txt}
{com}. 
. 
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SPF/individual/InfExpSPFPointIndQ",clear 
{txt}
{com}. 
. duplicates report year quarter ID 

{p 0 4}{txt}Duplicates in terms of {res} year quarter ID{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}         {res}8195             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. merge 1:1 year quarter ID using "${c -(}folder{c )-}/SPF/individual/InfExpSPFDstIndQ.dta"
{res}{txt}{p 0 7 2}
(note: variable
year was 
int, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
quarter was 
byte, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
ID was 
int, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           6,102
{txt}{col 9}from master{col 30}{res}           6,102{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}           2,093{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. rename _merge SPFDst_merge
{res}{txt}
{com}. table year if SPFDst_merge ==3

{txt}{hline 10}{c TT}{hline 11}
     YEAR {c |}      Freq.
{hline 10}{c +}{hline 11}
     2007 {c |}        {res}199
     {txt}2008 {c |}        {res}198
     {txt}2009 {c |}        {res}169
     {txt}2010 {c |}        {res}165
     {txt}2011 {c |}        {res}169
     {txt}2012 {c |}        {res}171
     {txt}2013 {c |}        {res}171
     {txt}2014 {c |}        {res}172
     {txt}2015 {c |}        {res}170
     {txt}2016 {c |}        {res}164
     {txt}2017 {c |}        {res}159
     {txt}2018 {c |}        {res}147
     {txt}2019 {c |}         {res}38
{txt}{hline 10}{c BT}{hline 11}

{com}. 
. *merge m:1 year month using "${c -(}mainfolder{c )-}/OtherData/InfM.dta",keep(match using master)
. *rename _merge inflation_merge 
. 
. merge m:1 year quarter using "${c -(}mainfolder{c )-}/OtherData/InfShocksClean.dta",keep(match using master)
{res}{txt}{p 0 7 2}
(note: variable
month was 
float, now double to accommodate using data's values)
{p_end}
(label _merge already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           3,112
{txt}{col 9}from master{col 30}{res}           3,112{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}           5,083{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge infshocks_merge
{res}{txt}
{com}. 
. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. 
. xtset ID dateQ
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dateQ, 1968q4 to 2019q1, but with gaps
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. sort ID year quarter 
{txt}
{com}. 
. drop if ID==ID[_n-1] & INDUSTRY != INDUSTRY[_n-1]
{txt}(23 observations deleted)

{com}. 
. 
. *******************************
. **  Summary Statistics of SPF **
. *******************************
. 
. tabstat ID,s(count) by(dateQ) column(statistics)

{txt}Summary for variables: ID
{col 6}by categories of: dateQ 

{ralign 9:dateQ} {...}
{c |}         N
{hline 10}{c +}{hline 10}
{ralign 9:1968q4} {...}
{c |}{...}
 {res}       87
{txt}{ralign 9:1969q1} {...}
{c |}{...}
 {res}       65
{txt}{ralign 9:1969q2} {...}
{c |}{...}
 {res}       59
{txt}{ralign 9:1969q3} {...}
{c |}{...}
 {res}      128
{txt}{ralign 9:1969q4} {...}
{c |}{...}
 {res}       57
{txt}{ralign 9:1970q1} {...}
{c |}{...}
 {res}       60
{txt}{ralign 9:1970q2} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:1970q3} {...}
{c |}{...}
 {res}       57
{txt}{ralign 9:1970q4} {...}
{c |}{...}
 {res}      131
{txt}{ralign 9:1971q1} {...}
{c |}{...}
 {res}       56
{txt}{ralign 9:1971q2} {...}
{c |}{...}
 {res}       59
{txt}{ralign 9:1971q3} {...}
{c |}{...}
 {res}      106
{txt}{ralign 9:1971q4} {...}
{c |}{...}
 {res}       76
{txt}{ralign 9:1972q1} {...}
{c |}{...}
 {res}       66
{txt}{ralign 9:1972q2} {...}
{c |}{...}
 {res}       71
{txt}{ralign 9:1972q3} {...}
{c |}{...}
 {res}       69
{txt}{ralign 9:1972q4} {...}
{c |}{...}
 {res}       63
{txt}{ralign 9:1973q1} {...}
{c |}{...}
 {res}       68
{txt}{ralign 9:1973q2} {...}
{c |}{...}
 {res}       64
{txt}{ralign 9:1973q3} {...}
{c |}{...}
 {res}       46
{txt}{ralign 9:1973q4} {...}
{c |}{...}
 {res}       59
{txt}{ralign 9:1974q1} {...}
{c |}{...}
 {res}       63
{txt}{ralign 9:1974q2} {...}
{c |}{...}
 {res}       49
{txt}{ralign 9:1974q3} {...}
{c |}{...}
 {res}       54
{txt}{ralign 9:1974q4} {...}
{c |}{...}
 {res}       54
{txt}{ralign 9:1975q1} {...}
{c |}{...}
 {res}       46
{txt}{ralign 9:1975q2} {...}
{c |}{...}
 {res}       47
{txt}{ralign 9:1975q3} {...}
{c |}{...}
 {res}       40
{txt}{ralign 9:1975q4} {...}
{c |}{...}
 {res}       48
{txt}{ralign 9:1976q1} {...}
{c |}{...}
 {res}       48
{txt}{ralign 9:1976q2} {...}
{c |}{...}
 {res}       49
{txt}{ralign 9:1976q3} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1976q4} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1977q1} {...}
{c |}{...}
 {res}       41
{txt}{ralign 9:1977q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:1977q3} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1977q4} {...}
{c |}{...}
 {res}       45
{txt}{ralign 9:1978q1} {...}
{c |}{...}
 {res}       26
{txt}{ralign 9:1978q2} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1978q3} {...}
{c |}{...}
 {res}       27
{txt}{ralign 9:1978q4} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:1979q1} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:1979q2} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:1979q3} {...}
{c |}{...}
 {res}       38
{txt}{ralign 9:1979q4} {...}
{c |}{...}
 {res}       33
{txt}{ralign 9:1980q1} {...}
{c |}{...}
 {res}       29
{txt}{ralign 9:1980q2} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:1980q3} {...}
{c |}{...}
 {res}       24
{txt}{ralign 9:1980q4} {...}
{c |}{...}
 {res}       32
{txt}{ralign 9:1981q1} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1981q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:1981q3} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1981q4} {...}
{c |}{...}
 {res}       46
{txt}{ralign 9:1982q1} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:1982q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:1982q3} {...}
{c |}{...}
 {res}       43
{txt}{ralign 9:1982q4} {...}
{c |}{...}
 {res}       38
{txt}{ralign 9:1983q1} {...}
{c |}{...}
 {res}       38
{txt}{ralign 9:1983q2} {...}
{c |}{...}
 {res}       40
{txt}{ralign 9:1983q3} {...}
{c |}{...}
 {res}       32
{txt}{ralign 9:1983q4} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1984q1} {...}
{c |}{...}
 {res}       31
{txt}{ralign 9:1984q2} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:1984q3} {...}
{c |}{...}
 {res}       27
{txt}{ralign 9:1984q4} {...}
{c |}{...}
 {res}       31
{txt}{ralign 9:1985q1} {...}
{c |}{...}
 {res}       24
{txt}{ralign 9:1985q2} {...}
{c |}{...}
 {res}       29
{txt}{ralign 9:1985q3} {...}
{c |}{...}
 {res}       31
{txt}{ralign 9:1985q4} {...}
{c |}{...}
 {res}       25
{txt}{ralign 9:1986q1} {...}
{c |}{...}
 {res}       26
{txt}{ralign 9:1986q2} {...}
{c |}{...}
 {res}       28
{txt}{ralign 9:1986q3} {...}
{c |}{...}
 {res}       24
{txt}{ralign 9:1986q4} {...}
{c |}{...}
 {res}       24
{txt}{ralign 9:1987q1} {...}
{c |}{...}
 {res}       22
{txt}{ralign 9:1987q2} {...}
{c |}{...}
 {res}       28
{txt}{ralign 9:1987q3} {...}
{c |}{...}
 {res}       22
{txt}{ralign 9:1987q4} {...}
{c |}{...}
 {res}       20
{txt}{ralign 9:1988q1} {...}
{c |}{...}
 {res}       18
{txt}{ralign 9:1988q2} {...}
{c |}{...}
 {res}       19
{txt}{ralign 9:1988q3} {...}
{c |}{...}
 {res}       18
{txt}{ralign 9:1988q4} {...}
{c |}{...}
 {res}       15
{txt}{ralign 9:1989q1} {...}
{c |}{...}
 {res}       17
{txt}{ralign 9:1989q2} {...}
{c |}{...}
 {res}       17
{txt}{ralign 9:1989q3} {...}
{c |}{...}
 {res}       15
{txt}{ralign 9:1989q4} {...}
{c |}{...}
 {res}       17
{txt}{ralign 9:1990q1} {...}
{c |}{...}
 {res}       14
{txt}{ralign 9:1990q3} {...}
{c |}{...}
 {res}       11
{txt}{ralign 9:1990q4} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:1991q1} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:1991q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:1991q3} {...}
{c |}{...}
 {res}       33
{txt}{ralign 9:1991q4} {...}
{c |}{...}
 {res}       39
{txt}{ralign 9:1992q1} {...}
{c |}{...}
 {res}       40
{txt}{ralign 9:1992q2} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1992q3} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1992q4} {...}
{c |}{...}
 {res}       40
{txt}{ralign 9:1993q1} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:1993q2} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1993q3} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:1993q4} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:1994q1} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:1994q2} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:1994q3} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:1994q4} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:1995q1} {...}
{c |}{...}
 {res}       29
{txt}{ralign 9:1995q2} {...}
{c |}{...}
 {res}       52
{txt}{ralign 9:1995q3} {...}
{c |}{...}
 {res}       52
{txt}{ralign 9:1995q4} {...}
{c |}{...}
 {res}       47
{txt}{ralign 9:1996q1} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1996q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:1996q3} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:1996q4} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1997q1} {...}
{c |}{...}
 {res}       38
{txt}{ralign 9:1997q2} {...}
{c |}{...}
 {res}       39
{txt}{ralign 9:1997q3} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1997q4} {...}
{c |}{...}
 {res}       38
{txt}{ralign 9:1998q1} {...}
{c |}{...}
 {res}       32
{txt}{ralign 9:1998q2} {...}
{c |}{...}
 {res}       29
{txt}{ralign 9:1998q3} {...}
{c |}{...}
 {res}       32
{txt}{ralign 9:1998q4} {...}
{c |}{...}
 {res}       33
{txt}{ralign 9:1999q1} {...}
{c |}{...}
 {res}       33
{txt}{ralign 9:1999q2} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1999q3} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1999q4} {...}
{c |}{...}
 {res}       43
{txt}{ralign 9:2000q1} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:2000q2} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:2000q3} {...}
{c |}{...}
 {res}       32
{txt}{ralign 9:2000q4} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:2001q1} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:2001q2} {...}
{c |}{...}
 {res}       33
{txt}{ralign 9:2001q3} {...}
{c |}{...}
 {res}       33
{txt}{ralign 9:2001q4} {...}
{c |}{...}
 {res}       29
{txt}{ralign 9:2002q1} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:2002q2} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:2002q3} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:2002q4} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:2003q1} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:2003q2} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:2003q3} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:2003q4} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:2004q1} {...}
{c |}{...}
 {res}       31
{txt}{ralign 9:2004q2} {...}
{c |}{...}
 {res}       32
{txt}{ralign 9:2004q3} {...}
{c |}{...}
 {res}       29
{txt}{ralign 9:2004q4} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:2005q1} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:2005q2} {...}
{c |}{...}
 {res}       46
{txt}{ralign 9:2005q3} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:2005q4} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:2006q1} {...}
{c |}{...}
 {res}       53
{txt}{ralign 9:2006q2} {...}
{c |}{...}
 {res}       53
{txt}{ralign 9:2006q3} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:2006q4} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:2007q1} {...}
{c |}{...}
 {res}       49
{txt}{ralign 9:2007q2} {...}
{c |}{...}
 {res}       52
{txt}{ralign 9:2007q3} {...}
{c |}{...}
 {res}       49
{txt}{ralign 9:2007q4} {...}
{c |}{...}
 {res}       48
{txt}{ralign 9:2008q1} {...}
{c |}{...}
 {res}       50
{txt}{ralign 9:2008q2} {...}
{c |}{...}
 {res}       50
{txt}{ralign 9:2008q3} {...}
{c |}{...}
 {res}       47
{txt}{ralign 9:2008q4} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:2009q1} {...}
{c |}{...}
 {res}       43
{txt}{ralign 9:2009q2} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:2009q3} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:2009q4} {...}
{c |}{...}
 {res}       41
{txt}{ralign 9:2010q1} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2010q2} {...}
{c |}{...}
 {res}       44
{txt}{ralign 9:2010q3} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:2010q4} {...}
{c |}{...}
 {res}       43
{txt}{ralign 9:2011q1} {...}
{c |}{...}
 {res}       43
{txt}{ralign 9:2011q2} {...}
{c |}{...}
 {res}       44
{txt}{ralign 9:2011q3} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:2011q4} {...}
{c |}{...}
 {res}       45
{txt}{ralign 9:2012q1} {...}
{c |}{...}
 {res}       45
{txt}{ralign 9:2012q2} {...}
{c |}{...}
 {res}       39
{txt}{ralign 9:2012q3} {...}
{c |}{...}
 {res}       48
{txt}{ralign 9:2012q4} {...}
{c |}{...}
 {res}       39
{txt}{ralign 9:2013q1} {...}
{c |}{...}
 {res}       46
{txt}{ralign 9:2013q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2013q3} {...}
{c |}{...}
 {res}       41
{txt}{ralign 9:2013q4} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2014q1} {...}
{c |}{...}
 {res}       45
{txt}{ralign 9:2014q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2014q3} {...}
{c |}{...}
 {res}       43
{txt}{ralign 9:2014q4} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2015q1} {...}
{c |}{...}
 {res}       39
{txt}{ralign 9:2015q2} {...}
{c |}{...}
 {res}       44
{txt}{ralign 9:2015q3} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2015q4} {...}
{c |}{...}
 {res}       45
{txt}{ralign 9:2016q1} {...}
{c |}{...}
 {res}       40
{txt}{ralign 9:2016q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2016q3} {...}
{c |}{...}
 {res}       40
{txt}{ralign 9:2016q4} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2017q1} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2017q2} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:2017q3} {...}
{c |}{...}
 {res}       39
{txt}{ralign 9:2017q4} {...}
{c |}{...}
 {res}       41
{txt}{ralign 9:2018q1} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:2018q2} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:2018q3} {...}
{c |}{...}
 {res}       38
{txt}{ralign 9:2018q4} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:2019q1} {...}
{c |}{...}
 {res}       37
{txt}{hline 10}{c +}{hline 10}
{ralign 9:Total} {...}
{c |}{...}
 {res}     8171
{txt}{hline 10}{c BT}{hline 10}

{com}. 
. 
. ******************************
. *** Computing some measures **
. ******************************
. 
. gen SPFCPI_FE = CPI1y - Inf1yf_CPIAU
{txt}(3575 missing values generated)

{com}. label var SPFCPI_FE "1-yr-ahead forecast error(SPF CPI)"
{txt}
{com}. gen SPFCCPI_FE = CORECPI1y - Inf1yf_CPICore
{txt}(6464 missing values generated)

{com}. label var SPFCPI_FE "1-yr-ahead forecast error(SPF core CPI)"
{txt}
{com}. gen SPFPCE_FE = PCE1y - Inf1yf_PCE
{txt}(6590 missing values generated)

{com}. label var SPFPCE_FE "1-yr-ahead forecast error(SPF PCE)"
{txt}
{com}. 
. 
. *****************************************
. ****  Renaming so that more consistent **
. *****************************************
. 
. 
. rename CPI1y SPFCPI_Mean
{res}{txt}
{com}. rename PCE1y SPFPCE_Mean
{res}{txt}
{com}. rename COREPCE1y SPFCPCE_Mean
{res}{txt}
{com}. rename CORECPI1y SPFCCPI_Mean
{res}{txt}
{com}. 
. rename PRCPCEVar1 SPFPCE_Var
{res}{txt}
{com}. rename PRCCPIVar1 SPFCPI_Var
{res}{txt}
{com}. 
. rename SPFCPI_FE SPFCPI_FE
{res}{txt}  (all {it:newnames}=={it:oldnames})

{com}. rename SPFPCE_FE SPFPCE_FE
{res}{txt}  (all {it:newnames}=={it:oldnames})

{com}. 
. *******************************
. **  Generate Variables       **
. *******************************
. 
. gen InfExp_Mean = .
{txt}(8172 missing values generated)

{com}. gen InfExp_Var = .
{txt}(8172 missing values generated)

{com}. gen InfExp_FE = .
{txt}(8172 missing values generated)

{com}. *gen InfExp_Disg = . 
. 
. 
. gen InfExp_Mean_ch = .
{txt}(8172 missing values generated)

{com}. gen InfExp_Var_ch = .
{txt}(8172 missing values generated)

{com}. gen InfExp_FE_ch = .
{txt}(8172 missing values generated)

{com}. *gen InfExp_Disg_ch = . 
. 
. ************************************************
. ** Auto Regression of the Individual Moments  **
. ************************************************
. 
. eststo clear
{txt}
{com}. 
. foreach mom in FE Var{c -(}
{txt}  2{com}.    foreach var in SPFCPI SPFPCE{c -(}
{txt}  3{com}.     replace InfExp_`mom' = `var'_`mom'
{txt}  4{com}.         xtset ID dateQ
{txt}  5{com}.     replace InfExp_`mom'_ch = InfExp_`mom'-l1.InfExp_`mom'
{txt}  6{com}.         eststo `var'_`mom'lvl: reg InfExp_`mom' l(3/5).InfExp_`mom', vce(cluster dateQ)
{txt}  7{com}.     eststo `var'_`mom'diff: reg InfExp_`mom'_ch l(3/5).InfExp_`mom'_ch, vce(cluster dateQ)
{txt}  8{com}.   {c )-}
{txt}  9{com}. {c )-}
{txt}(4597 real changes made)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dateQ, 1968q4 to 2019q1, but with gaps
{txt}{col 17}delta:  {res}1 quarter
{txt}(3594 real changes made)

Linear regression                                      Number of obs ={res}    2313
                                                       {txt}F(  3,   127) ={res}    3.60
                                                       {txt}Prob > F      = {res} 0.0155
                                                       {txt}R-squared     = {res} 0.0835
                                                       {txt}Root MSE      = {res} 1.2727

{txt}{ralign 78:(Std. Err. adjusted for {res:128} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .3546832{col 26}{space 2} .1656102{col 37}{space 1}    2.14{col 46}{space 3}0.034{col 54}{space 4} .0269706{col 67}{space 3} .6823958
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.4036376{col 26}{space 2} .1549736{col 37}{space 1}   -2.60{col 46}{space 3}0.010{col 54}{space 4}-.7103025{col 67}{space 3}-.0969728
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}  .202835{col 26}{space 2} .0842229{col 37}{space 1}    2.41{col 46}{space 3}0.017{col 54}{space 4}  .036173{col 67}{space 3}  .369497
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1509911{col 26}{space 2} .1331756{col 37}{space 1}    1.13{col 46}{space 3}0.259{col 54}{space 4}-.1125393{col 67}{space 3} .4145215
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    1755
                                                       {txt}F(  3,   124) ={res}    2.53
                                                       {txt}Prob > F      = {res} 0.0600
                                                       {txt}R-squared     = {res} 0.2036
                                                       {txt}Root MSE      = {res} .98588

{txt}{ralign 78:(Std. Err. adjusted for {res:125} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_FE_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_FE_ch {c |}
{space 9}L3. {c |}{col 14}{res}{space 2}-.0388062{col 26}{space 2} .0345641{col 37}{space 1}   -1.12{col 46}{space 3}0.264{col 54}{space 4}-.1072183{col 67}{space 3} .0296058
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.4683816{col 26}{space 2} .1923061{col 37}{space 1}   -2.44{col 46}{space 3}0.016{col 54}{space 4}-.8490091{col 67}{space 3} -.087754
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0332009{col 26}{space 2} .0609446{col 37}{space 1}    0.54{col 46}{space 3}0.587{col 54}{space 4}-.0874256{col 67}{space 3} .1538273
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0090625{col 26}{space 2} .0888138{col 37}{space 1}   -0.10{col 46}{space 3}0.919{col 54}{space 4}-.1848499{col 67}{space 3}  .166725
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(4605 real changes made, 3023 to missing)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dateQ, 1968q4 to 2019q1, but with gaps
{txt}{col 17}delta:  {res}1 quarter
{txt}(3602 real changes made, 2307 to missing)

Linear regression                                      Number of obs ={res}     850
                                                       {txt}F(  3,    39) ={res}    2.08
                                                       {txt}Prob > F      = {res} 0.1185
                                                       {txt}R-squared     = {res} 0.1171
                                                       {txt}Root MSE      = {res} 1.0041

{txt}{ralign 78:(Std. Err. adjusted for {res:40} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .4459356{col 26}{space 2} .2114824{col 37}{space 1}    2.11{col 46}{space 3}0.041{col 54}{space 4} .0181721{col 67}{space 3}  .873699
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.4915115{col 26}{space 2} .2334791{col 37}{space 1}   -2.11{col 46}{space 3}0.042{col 54}{space 4}-.9637675{col 67}{space 3}-.0192554
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .2259024{col 26}{space 2} .1267345{col 37}{space 1}    1.78{col 46}{space 3}0.082{col 54}{space 4}-.0304424{col 67}{space 3} .4822471
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2632334{col 26}{space 2} .1570483{col 37}{space 1}    1.68{col 46}{space 3}0.102{col 54}{space 4}-.0544267{col 67}{space 3} .5808935
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     678
                                                       {txt}F(  3,    38) ={res}    1.56
                                                       {txt}Prob > F      = {res} 0.2148
                                                       {txt}R-squared     = {res} 0.2316
                                                       {txt}Root MSE      = {res} .70596

{txt}{ralign 78:(Std. Err. adjusted for {res:39} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_FE_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_FE_ch {c |}
{space 9}L3. {c |}{col 14}{res}{space 2}-.0895218{col 26}{space 2} .0480642{col 37}{space 1}   -1.86{col 46}{space 3}0.070{col 54}{space 4}-.1868227{col 67}{space 3} .0077791
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.4100794{col 26}{space 2} .2652435{col 37}{space 1}   -1.55{col 46}{space 3}0.130{col 54}{space 4}-.9470368{col 67}{space 3}  .126878
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0021416{col 26}{space 2}  .051741{col 37}{space 1}    0.04{col 46}{space 3}0.967{col 54}{space 4}-.1026026{col 67}{space 3} .1068858
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0690228{col 26}{space 2} .0802358{col 37}{space 1}   -0.86{col 46}{space 3}0.395{col 54}{space 4}-.2314516{col 67}{space 3}  .093406
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(1604 real changes made)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dateQ, 1968q4 to 2019q1, but with gaps
{txt}{col 17}delta:  {res}1 quarter
{txt}(1236 real changes made)

Linear regression                                      Number of obs ={res}     724
                                                       {txt}F(  3,    43) ={res}    0.26
                                                       {txt}Prob > F      = {res} 0.8549
                                                       {txt}R-squared     = {res} 0.0008
                                                       {txt}Root MSE      = {res}  15780

{txt}{ralign 78:(Std. Err. adjusted for {res:44} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  InfExp_Var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}InfExp_Var {c |}
{space 9}L3. {c |}{col 14}{res}{space 2}-10.75728{col 26}{space 2} 13.84827{col 37}{space 1}   -0.78{col 46}{space 3}0.442{col 54}{space 4}-38.68497{col 67}{space 3} 17.17041
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} 19.60226{col 26}{space 2} 22.35555{col 37}{space 1}    0.88{col 46}{space 3}0.385{col 54}{space 4}  -25.482{col 67}{space 3} 64.68653
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-15.28533{col 26}{space 2} 19.14477{col 37}{space 1}   -0.80{col 46}{space 3}0.429{col 54}{space 4}-53.89444{col 67}{space 3} 23.32377
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-597.3013{col 26}{space 2} 598.1321{col 37}{space 1}   -1.00{col 46}{space 3}0.324{col 54}{space 4} -1803.55{col 67}{space 3}  608.947
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     520
                                                       {txt}F(  3,    42) ={res}    1.47
                                                       {txt}Prob > F      = {res} 0.2363
                                                       {txt}R-squared     = {res} 0.0000
                                                       {txt}Root MSE      = {res}  .1847

{txt}{ralign 79:(Std. Err. adjusted for {res:43} clusters in dateQ)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}InfExp_Var_ch{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_ch {c |}
{space 10}L3. {c |}{col 15}{res}{space 2} .0000155{col 27}{space 2} .0000184{col 38}{space 1}    0.85{col 47}{space 3}0.402{col 55}{space 4}-.0000215{col 68}{space 3} .0000526
{txt}{space 10}L4. {c |}{col 15}{res}{space 2} 5.17e-06{col 27}{space 2} 6.47e-06{col 38}{space 1}    0.80{col 47}{space 3}0.429{col 55}{space 4}-7.89e-06{col 68}{space 3} .0000182
{txt}{space 10}L5. {c |}{col 15}{res}{space 2}-.0000217{col 27}{space 2} .0000208{col 38}{space 1}   -1.04{col 47}{space 3}0.303{col 55}{space 4}-.0000637{col 68}{space 3} .0000203
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}-.0032544{col 27}{space 2}  .008313{col 38}{space 1}   -0.39{col 47}{space 3}0.697{col 55}{space 4}-.0200307{col 68}{space 3}  .013522
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(1356 real changes made, 263 to missing)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dateQ, 1968q4 to 2019q1, but with gaps
{txt}{col 17}delta:  {res}1 quarter
{txt}(1102 real changes made, 258 to missing)

Linear regression                                      Number of obs ={res}     604
                                                       {txt}F(  3,    43) ={res}    4.17
                                                       {txt}Prob > F      = {res} 0.0111
                                                       {txt}R-squared     = {res} 0.0002
                                                       {txt}Root MSE      = {res} 55.121

{txt}{ralign 78:(Std. Err. adjusted for {res:44} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  InfExp_Var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}InfExp_Var {c |}
{space 9}L3. {c |}{col 14}{res}{space 2}-.0000192{col 26}{space 2} .0000124{col 37}{space 1}   -1.54{col 46}{space 3}0.130{col 54}{space 4}-.0000442{col 67}{space 3} 5.88e-06
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} 2.853177{col 26}{space 2}  2.20432{col 37}{space 1}    1.29{col 46}{space 3}0.202{col 54}{space 4}-1.592258{col 67}{space 3} 7.298611
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}   1.4856{col 26}{space 2} 1.469839{col 37}{space 1}    1.01{col 46}{space 3}0.318{col 54}{space 4}-1.478613{col 67}{space 3} 4.449814
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-2.552768{col 26}{space 2} 2.589636{col 37}{space 1}   -0.99{col 46}{space 3}0.330{col 54}{space 4}-7.775267{col 67}{space 3}  2.66973
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     406
                                                       {txt}F(  3,    42) ={res}    1.78
                                                       {txt}Prob > F      = {res} 0.1666
                                                       {txt}R-squared     = {res} 0.0921
                                                       {txt}Root MSE      = {res} .15326

{txt}{ralign 79:(Std. Err. adjusted for {res:43} clusters in dateQ)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}InfExp_Var_ch{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_ch {c |}
{space 10}L3. {c |}{col 15}{res}{space 2}  .000014{col 27}{space 2} 7.33e-06{col 38}{space 1}    1.91{col 47}{space 3}0.063{col 55}{space 4}-7.84e-07{col 68}{space 3} .0000288
{txt}{space 10}L4. {c |}{col 15}{res}{space 2} .1664586{col 27}{space 2} .3221009{col 38}{space 1}    0.52{col 47}{space 3}0.608{col 55}{space 4}-.4835673{col 68}{space 3} .8164845
{txt}{space 10}L5. {c |}{col 15}{res}{space 2}-.2622411{col 27}{space 2} .1679965{col 38}{space 1}   -1.56{col 47}{space 3}0.126{col 55}{space 4}-.6012719{col 68}{space 3} .0767896
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .0068932{col 27}{space 2} .0062073{col 38}{space 1}    1.11{col 47}{space 3}0.273{col 55}{space 4}-.0056335{col 68}{space 3}   .01942
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. esttab using "${c -(}sum_table_folder{c )-}/ind/autoregSPFIndQ.csv", mtitles se  r2 replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/ind/autoregSPFIndQ.csv"'})

{com}. eststo clear
{txt}
{com}. 
. ddd
{err}unrecognized command:  ddd
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. clear

. 