{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/ExpProject/workingfolder/ind_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}24 Jun 2019, 12:28:19
{txt}
{com}. 
. 
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SPF/individual/InfExpSPFPointIndQ",clear 
{txt}
{com}. 
. duplicates report year quarter ID 

{p 0 4}{txt}Duplicates in terms of {res} year quarter ID{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}         {res}8195             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. merge 1:1 year quarter ID using "${c -(}folder{c )-}/SPF/individual/InfExpSPFDstIndQ.dta"
{res}{txt}{p 0 7 2}
(note: variable
year was 
int, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
quarter was 
byte, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
ID was 
int, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           6,102
{txt}{col 9}from master{col 30}{res}           6,102{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}           2,093{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. rename _merge SPFDst_merge
{res}{txt}
{com}. table year if SPFDst_merge ==3

{txt}{hline 10}{c TT}{hline 11}
     YEAR {c |}      Freq.
{hline 10}{c +}{hline 11}
     2007 {c |}        {res}199
     {txt}2008 {c |}        {res}198
     {txt}2009 {c |}        {res}169
     {txt}2010 {c |}        {res}165
     {txt}2011 {c |}        {res}169
     {txt}2012 {c |}        {res}171
     {txt}2013 {c |}        {res}171
     {txt}2014 {c |}        {res}172
     {txt}2015 {c |}        {res}170
     {txt}2016 {c |}        {res}164
     {txt}2017 {c |}        {res}159
     {txt}2018 {c |}        {res}147
     {txt}2019 {c |}         {res}38
{txt}{hline 10}{c BT}{hline 11}

{com}. 
. merge m:1 year quarter using "${c -(}mainfolder{c )-}/OtherData/InfShocksClean.dta",keep(match using master)
{res}{txt}{p 0 7 2}
(note: variable
month was 
float, now double to accommodate using data's values)
{p_end}
(label _merge already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           3,112
{txt}{col 9}from master{col 30}{res}           3,112{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}           5,083{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge infshocks_merge
{res}{txt}
{com}. 
. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. 
. xtset ID dateQ
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dateQ, 1968q4 to 2019q1, but with gaps
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. sort ID year quarter 
{txt}
{com}. 
. drop if ID==ID[_n-1] & INDUSTRY != INDUSTRY[_n-1]
{txt}(23 observations deleted)

{com}. 
. 
. *******************************
. **  Summary Statistics of SPF **
. *******************************
. 
. tabstat ID,s(count) by(dateQ) column(statistics)

{txt}Summary for variables: ID
{col 6}by categories of: dateQ 

{ralign 9:dateQ} {...}
{c |}         N
{hline 10}{c +}{hline 10}
{ralign 9:1968q4} {...}
{c |}{...}
 {res}       87
{txt}{ralign 9:1969q1} {...}
{c |}{...}
 {res}       65
{txt}{ralign 9:1969q2} {...}
{c |}{...}
 {res}       59
{txt}{ralign 9:1969q3} {...}
{c |}{...}
 {res}      128
{txt}{ralign 9:1969q4} {...}
{c |}{...}
 {res}       57
{txt}{ralign 9:1970q1} {...}
{c |}{...}
 {res}       60
{txt}{ralign 9:1970q2} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:1970q3} {...}
{c |}{...}
 {res}       57
{txt}{ralign 9:1970q4} {...}
{c |}{...}
 {res}      131
{txt}{ralign 9:1971q1} {...}
{c |}{...}
 {res}       56
{txt}{ralign 9:1971q2} {...}
{c |}{...}
 {res}       59
{txt}{ralign 9:1971q3} {...}
{c |}{...}
 {res}      106
{txt}{ralign 9:1971q4} {...}
{c |}{...}
 {res}       76
{txt}{ralign 9:1972q1} {...}
{c |}{...}
 {res}       66
{txt}{ralign 9:1972q2} {...}
{c |}{...}
 {res}       71
{txt}{ralign 9:1972q3} {...}
{c |}{...}
 {res}       69
{txt}{ralign 9:1972q4} {...}
{c |}{...}
 {res}       63
{txt}{ralign 9:1973q1} {...}
{c |}{...}
 {res}       68
{txt}{ralign 9:1973q2} {...}
{c |}{...}
 {res}       64
{txt}{ralign 9:1973q3} {...}
{c |}{...}
 {res}       46
{txt}{ralign 9:1973q4} {...}
{c |}{...}
 {res}       59
{txt}{ralign 9:1974q1} {...}
{c |}{...}
 {res}       63
{txt}{ralign 9:1974q2} {...}
{c |}{...}
 {res}       49
{txt}{ralign 9:1974q3} {...}
{c |}{...}
 {res}       54
{txt}{ralign 9:1974q4} {...}
{c |}{...}
 {res}       54
{txt}{ralign 9:1975q1} {...}
{c |}{...}
 {res}       46
{txt}{ralign 9:1975q2} {...}
{c |}{...}
 {res}       47
{txt}{ralign 9:1975q3} {...}
{c |}{...}
 {res}       40
{txt}{ralign 9:1975q4} {...}
{c |}{...}
 {res}       48
{txt}{ralign 9:1976q1} {...}
{c |}{...}
 {res}       48
{txt}{ralign 9:1976q2} {...}
{c |}{...}
 {res}       49
{txt}{ralign 9:1976q3} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1976q4} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1977q1} {...}
{c |}{...}
 {res}       41
{txt}{ralign 9:1977q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:1977q3} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1977q4} {...}
{c |}{...}
 {res}       45
{txt}{ralign 9:1978q1} {...}
{c |}{...}
 {res}       26
{txt}{ralign 9:1978q2} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1978q3} {...}
{c |}{...}
 {res}       27
{txt}{ralign 9:1978q4} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:1979q1} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:1979q2} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:1979q3} {...}
{c |}{...}
 {res}       38
{txt}{ralign 9:1979q4} {...}
{c |}{...}
 {res}       33
{txt}{ralign 9:1980q1} {...}
{c |}{...}
 {res}       29
{txt}{ralign 9:1980q2} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:1980q3} {...}
{c |}{...}
 {res}       24
{txt}{ralign 9:1980q4} {...}
{c |}{...}
 {res}       32
{txt}{ralign 9:1981q1} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1981q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:1981q3} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1981q4} {...}
{c |}{...}
 {res}       46
{txt}{ralign 9:1982q1} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:1982q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:1982q3} {...}
{c |}{...}
 {res}       43
{txt}{ralign 9:1982q4} {...}
{c |}{...}
 {res}       38
{txt}{ralign 9:1983q1} {...}
{c |}{...}
 {res}       38
{txt}{ralign 9:1983q2} {...}
{c |}{...}
 {res}       40
{txt}{ralign 9:1983q3} {...}
{c |}{...}
 {res}       32
{txt}{ralign 9:1983q4} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1984q1} {...}
{c |}{...}
 {res}       31
{txt}{ralign 9:1984q2} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:1984q3} {...}
{c |}{...}
 {res}       27
{txt}{ralign 9:1984q4} {...}
{c |}{...}
 {res}       31
{txt}{ralign 9:1985q1} {...}
{c |}{...}
 {res}       24
{txt}{ralign 9:1985q2} {...}
{c |}{...}
 {res}       29
{txt}{ralign 9:1985q3} {...}
{c |}{...}
 {res}       31
{txt}{ralign 9:1985q4} {...}
{c |}{...}
 {res}       25
{txt}{ralign 9:1986q1} {...}
{c |}{...}
 {res}       26
{txt}{ralign 9:1986q2} {...}
{c |}{...}
 {res}       28
{txt}{ralign 9:1986q3} {...}
{c |}{...}
 {res}       24
{txt}{ralign 9:1986q4} {...}
{c |}{...}
 {res}       24
{txt}{ralign 9:1987q1} {...}
{c |}{...}
 {res}       22
{txt}{ralign 9:1987q2} {...}
{c |}{...}
 {res}       28
{txt}{ralign 9:1987q3} {...}
{c |}{...}
 {res}       22
{txt}{ralign 9:1987q4} {...}
{c |}{...}
 {res}       20
{txt}{ralign 9:1988q1} {...}
{c |}{...}
 {res}       18
{txt}{ralign 9:1988q2} {...}
{c |}{...}
 {res}       19
{txt}{ralign 9:1988q3} {...}
{c |}{...}
 {res}       18
{txt}{ralign 9:1988q4} {...}
{c |}{...}
 {res}       15
{txt}{ralign 9:1989q1} {...}
{c |}{...}
 {res}       17
{txt}{ralign 9:1989q2} {...}
{c |}{...}
 {res}       17
{txt}{ralign 9:1989q3} {...}
{c |}{...}
 {res}       15
{txt}{ralign 9:1989q4} {...}
{c |}{...}
 {res}       17
{txt}{ralign 9:1990q1} {...}
{c |}{...}
 {res}       14
{txt}{ralign 9:1990q3} {...}
{c |}{...}
 {res}       11
{txt}{ralign 9:1990q4} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:1991q1} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:1991q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:1991q3} {...}
{c |}{...}
 {res}       33
{txt}{ralign 9:1991q4} {...}
{c |}{...}
 {res}       39
{txt}{ralign 9:1992q1} {...}
{c |}{...}
 {res}       40
{txt}{ralign 9:1992q2} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1992q3} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1992q4} {...}
{c |}{...}
 {res}       40
{txt}{ralign 9:1993q1} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:1993q2} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1993q3} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:1993q4} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:1994q1} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:1994q2} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:1994q3} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:1994q4} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:1995q1} {...}
{c |}{...}
 {res}       29
{txt}{ralign 9:1995q2} {...}
{c |}{...}
 {res}       52
{txt}{ralign 9:1995q3} {...}
{c |}{...}
 {res}       52
{txt}{ralign 9:1995q4} {...}
{c |}{...}
 {res}       47
{txt}{ralign 9:1996q1} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1996q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:1996q3} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:1996q4} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1997q1} {...}
{c |}{...}
 {res}       38
{txt}{ralign 9:1997q2} {...}
{c |}{...}
 {res}       39
{txt}{ralign 9:1997q3} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1997q4} {...}
{c |}{...}
 {res}       38
{txt}{ralign 9:1998q1} {...}
{c |}{...}
 {res}       32
{txt}{ralign 9:1998q2} {...}
{c |}{...}
 {res}       29
{txt}{ralign 9:1998q3} {...}
{c |}{...}
 {res}       32
{txt}{ralign 9:1998q4} {...}
{c |}{...}
 {res}       33
{txt}{ralign 9:1999q1} {...}
{c |}{...}
 {res}       33
{txt}{ralign 9:1999q2} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1999q3} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1999q4} {...}
{c |}{...}
 {res}       43
{txt}{ralign 9:2000q1} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:2000q2} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:2000q3} {...}
{c |}{...}
 {res}       32
{txt}{ralign 9:2000q4} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:2001q1} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:2001q2} {...}
{c |}{...}
 {res}       33
{txt}{ralign 9:2001q3} {...}
{c |}{...}
 {res}       33
{txt}{ralign 9:2001q4} {...}
{c |}{...}
 {res}       29
{txt}{ralign 9:2002q1} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:2002q2} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:2002q3} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:2002q4} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:2003q1} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:2003q2} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:2003q3} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:2003q4} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:2004q1} {...}
{c |}{...}
 {res}       31
{txt}{ralign 9:2004q2} {...}
{c |}{...}
 {res}       32
{txt}{ralign 9:2004q3} {...}
{c |}{...}
 {res}       29
{txt}{ralign 9:2004q4} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:2005q1} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:2005q2} {...}
{c |}{...}
 {res}       46
{txt}{ralign 9:2005q3} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:2005q4} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:2006q1} {...}
{c |}{...}
 {res}       53
{txt}{ralign 9:2006q2} {...}
{c |}{...}
 {res}       53
{txt}{ralign 9:2006q3} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:2006q4} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:2007q1} {...}
{c |}{...}
 {res}       49
{txt}{ralign 9:2007q2} {...}
{c |}{...}
 {res}       52
{txt}{ralign 9:2007q3} {...}
{c |}{...}
 {res}       49
{txt}{ralign 9:2007q4} {...}
{c |}{...}
 {res}       48
{txt}{ralign 9:2008q1} {...}
{c |}{...}
 {res}       50
{txt}{ralign 9:2008q2} {...}
{c |}{...}
 {res}       50
{txt}{ralign 9:2008q3} {...}
{c |}{...}
 {res}       47
{txt}{ralign 9:2008q4} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:2009q1} {...}
{c |}{...}
 {res}       43
{txt}{ralign 9:2009q2} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:2009q3} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:2009q4} {...}
{c |}{...}
 {res}       41
{txt}{ralign 9:2010q1} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2010q2} {...}
{c |}{...}
 {res}       44
{txt}{ralign 9:2010q3} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:2010q4} {...}
{c |}{...}
 {res}       43
{txt}{ralign 9:2011q1} {...}
{c |}{...}
 {res}       43
{txt}{ralign 9:2011q2} {...}
{c |}{...}
 {res}       44
{txt}{ralign 9:2011q3} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:2011q4} {...}
{c |}{...}
 {res}       45
{txt}{ralign 9:2012q1} {...}
{c |}{...}
 {res}       45
{txt}{ralign 9:2012q2} {...}
{c |}{...}
 {res}       39
{txt}{ralign 9:2012q3} {...}
{c |}{...}
 {res}       48
{txt}{ralign 9:2012q4} {...}
{c |}{...}
 {res}       39
{txt}{ralign 9:2013q1} {...}
{c |}{...}
 {res}       46
{txt}{ralign 9:2013q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2013q3} {...}
{c |}{...}
 {res}       41
{txt}{ralign 9:2013q4} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2014q1} {...}
{c |}{...}
 {res}       45
{txt}{ralign 9:2014q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2014q3} {...}
{c |}{...}
 {res}       43
{txt}{ralign 9:2014q4} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2015q1} {...}
{c |}{...}
 {res}       39
{txt}{ralign 9:2015q2} {...}
{c |}{...}
 {res}       44
{txt}{ralign 9:2015q3} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2015q4} {...}
{c |}{...}
 {res}       45
{txt}{ralign 9:2016q1} {...}
{c |}{...}
 {res}       40
{txt}{ralign 9:2016q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2016q3} {...}
{c |}{...}
 {res}       40
{txt}{ralign 9:2016q4} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2017q1} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2017q2} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:2017q3} {...}
{c |}{...}
 {res}       39
{txt}{ralign 9:2017q4} {...}
{c |}{...}
 {res}       41
{txt}{ralign 9:2018q1} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:2018q2} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:2018q3} {...}
{c |}{...}
 {res}       38
{txt}{ralign 9:2018q4} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:2019q1} {...}
{c |}{...}
 {res}       37
{txt}{hline 10}{c +}{hline 10}
{ralign 9:Total} {...}
{c |}{...}
 {res}     8171
{txt}{hline 10}{c BT}{hline 10}

{com}. 
. 
. ******************************
. *** Computing some measures **
. ******************************
. 
. gen SPFCPI_FE = CPI1y - Inf1y_CPIAU
{txt}(3475 missing values generated)

{com}. label var SPFCPI_FE "1-yr-ahead forecast error(SPF CPI)"
{txt}
{com}. gen SPFCCPI_FE = CORECPI1y - Inf1y_CPICore
{txt}(6367 missing values generated)

{com}. label var SPFCPI_FE "1-yr-ahead forecast error(SPF core CPI)"
{txt}
{com}. gen SPFPCE_FE = PCE1y - Inf1y_PCE
{txt}(6493 missing values generated)

{com}. label var SPFPCE_FE "1-yr-ahead forecast error(SPF PCE)"
{txt}
{com}. 
. 
. gen SPFCPI_FE0 = CPI1y - Inf1y_CPIAU
{txt}(3475 missing values generated)

{com}. label var SPFCPI_FE0 "1-yr nowcasting error(SPF CPI)"
{txt}
{com}. gen SPFCCPI_FE0 = CORECPI1y - Inf1y_CPICore
{txt}(6367 missing values generated)

{com}. label var SPFCPI_FE0 "1-yr nowcasting error(SPF core CPI)"
{txt}
{com}. gen SPFPCE_FE0 = PCE1y - Inf1y_PCE
{txt}(6493 missing values generated)

{com}. label var SPFPCE_FE "1-yr nowcasting error (SPF PCE)"
{txt}
{com}. 
. 
. *****************************************
. ****  Renaming so that more consistent **
. *****************************************
. 
. 
. rename CPI1y SPFCPI_Mean
{res}{txt}
{com}. rename PCE1y SPFPCE_Mean
{res}{txt}
{com}. rename COREPCE1y SPFCPCE_Mean
{res}{txt}
{com}. rename CORECPI1y SPFCCPI_Mean
{res}{txt}
{com}. 
. rename PRCCPIMean0 SPFCPI_Mean0
{res}{txt}
{com}. rename PRCPCEMean0 SPFPCE_Mean0
{res}{txt}
{com}. 
. rename PRCPCEVar1 SPFPCE_Var
{res}{txt}
{com}. rename PRCCPIVar1 SPFCPI_Var
{res}{txt}
{com}. rename PRCPCEVar0 SPFPCE_Var0
{res}{txt}
{com}. rename PRCCPIVar0 SPFCPI_Var0
{res}{txt}
{com}. 
. rename SPFCPI_FE SPFCPI_FE
{res}{txt}  (all {it:newnames}=={it:oldnames})

{com}. rename SPFPCE_FE SPFPCE_FE
{res}{txt}  (all {it:newnames}=={it:oldnames})

{com}. 
. *******************************
. **  Generate Variables       **
. *******************************
. 
. gen InfExp_Mean = .
{txt}(8172 missing values generated)

{com}. gen InfExp_Var = .
{txt}(8172 missing values generated)

{com}. gen InfExp_FE = .
{txt}(8172 missing values generated)

{com}. *gen InfExp_Disg = . 
. 
. 
. gen InfExp_Mean_ch = .
{txt}(8172 missing values generated)

{com}. gen InfExp_Var_ch = .
{txt}(8172 missing values generated)

{com}. gen InfExp_FE_ch = .
{txt}(8172 missing values generated)

{com}. *gen InfExp_Disg_ch = . 
. 
. gen InfExp_Mean0 = .
{txt}(8172 missing values generated)

{com}. gen InfExp_Var0 = .
{txt}(8172 missing values generated)

{com}. 
. ************************************************
. ** Auto Regression of the Individual Moments  **
. ************************************************
. 
. eststo clear
{txt}
{com}. 
. foreach mom in Mean FE Var{c -(}
{txt}  2{com}.    foreach var in SPFCPI SPFPCE{c -(}
{txt}  3{com}.     replace InfExp_`mom' = `var'_`mom'
{txt}  4{com}.         xtset ID dateQ
{txt}  5{com}.     replace InfExp_`mom'_ch = InfExp_`mom'-l1.InfExp_`mom'
{txt}  6{com}. 
.         eststo `var'_`mom'lvl: reg InfExp_`mom' l(3/5).InfExp_`mom', vce(cluster dateQ)
{txt}  7{com}.     eststo `var'_`mom'diff: reg InfExp_`mom'_ch l(3/5).InfExp_`mom'_ch, vce(cluster dateQ)
{txt}  8{com}.   {c )-}
{txt}  9{com}. {c )-}
{txt}(5056 real changes made)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dateQ, 1968q4 to 2019q1, but with gaps
{txt}{col 17}delta:  {res}1 quarter
{txt}(3897 real changes made)

Linear regression                                      Number of obs ={res}    2501
                                                       {txt}F(  3,   141) ={res}  294.01
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.6480
                                                       {txt}Root MSE      = {res}   .584

{txt}{ralign 78:(Std. Err. adjusted for {res:142} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} InfExp_Mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Mean {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .4519905{col 26}{space 2} .0387915{col 37}{space 1}   11.65{col 46}{space 3}0.000{col 54}{space 4} .3753024{col 67}{space 3} .5286786
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}  .096043{col 26}{space 2} .0602878{col 37}{space 1}    1.59{col 46}{space 3}0.113{col 54}{space 4}-.0231419{col 67}{space 3} .2152278
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .2120063{col 26}{space 2} .0460068{col 37}{space 1}    4.61{col 46}{space 3}0.000{col 54}{space 4}  .121054{col 67}{space 3} .3029586
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .5614722{col 26}{space 2} .0710101{col 37}{space 1}    7.91{col 46}{space 3}0.000{col 54}{space 4} .4210902{col 67}{space 3} .7018543
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    1898
                                                       {txt}F(  3,   138) ={res}    0.30
                                                       {txt}Prob > F      = {res} 0.8239
                                                       {txt}R-squared     = {res} 0.0017
                                                       {txt}Root MSE      = {res} .50753

{txt}{ralign 80:(Std. Err. adjusted for {res:139} clusters in dateQ)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}InfExp_Mean_ch{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Mean_ch {c |}
{space 11}L3. {c |}{col 16}{res}{space 2} -.013545{col 28}{space 2} .0377731{col 39}{space 1}   -0.36{col 48}{space 3}0.720{col 56}{space 4} -.088234{col 69}{space 3} .0611439
{txt}{space 11}L4. {c |}{col 16}{res}{space 2}-.0308508{col 28}{space 2}  .047938{col 39}{space 1}   -0.64{col 48}{space 3}0.521{col 56}{space 4}-.1256388{col 69}{space 3} .0639371
{txt}{space 11}L5. {c |}{col 16}{res}{space 2} .0143002{col 28}{space 2} .0318034{col 39}{space 1}    0.45{col 48}{space 3}0.654{col 56}{space 4}-.0485849{col 69}{space 3} .0771852
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2} -.023912{col 28}{space 2} .0178672{col 39}{space 1}   -1.34{col 48}{space 3}0.183{col 56}{space 4}-.0592408{col 69}{space 3} .0114168
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(5049 real changes made, 3352 to missing)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dateQ, 1968q4 to 2019q1, but with gaps
{txt}{col 17}delta:  {res}1 quarter
{txt}(3881 real changes made, 2504 to missing)

Linear regression                                      Number of obs ={res}     939
                                                       {txt}F(  3,    43) ={res}   32.45
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.3460
                                                       {txt}Root MSE      = {res} .46661

{txt}{ralign 78:(Std. Err. adjusted for {res:44} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} InfExp_Mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Mean {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .3854789{col 26}{space 2} .0705583{col 37}{space 1}    5.46{col 46}{space 3}0.000{col 54}{space 4} .2431845{col 67}{space 3} .5277732
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .1210385{col 26}{space 2} .0525281{col 37}{space 1}    2.30{col 46}{space 3}0.026{col 54}{space 4} .0151054{col 67}{space 3} .2269715
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .1043465{col 26}{space 2} .0477848{col 37}{space 1}    2.18{col 46}{space 3}0.034{col 54}{space 4} .0079792{col 67}{space 3} .2007137
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .6967154{col 26}{space 2} .1019343{col 37}{space 1}    6.83{col 46}{space 3}0.000{col 54}{space 4} .4911454{col 67}{space 3} .9022855
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     751
                                                       {txt}F(  3,    42) ={res}    2.47
                                                       {txt}Prob > F      = {res} 0.0750
                                                       {txt}R-squared     = {res} 0.0110
                                                       {txt}Root MSE      = {res} .41284

{txt}{ralign 80:(Std. Err. adjusted for {res:43} clusters in dateQ)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}InfExp_Mean_ch{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Mean_ch {c |}
{space 11}L3. {c |}{col 16}{res}{space 2}-.0172092{col 28}{space 2} .0528981{col 39}{space 1}   -0.33{col 48}{space 3}0.747{col 56}{space 4}-.1239619{col 69}{space 3} .0895435
{txt}{space 11}L4. {c |}{col 16}{res}{space 2}-.0239648{col 28}{space 2} .0541233{col 39}{space 1}   -0.44{col 48}{space 3}0.660{col 56}{space 4}-.1331901{col 69}{space 3} .0852605
{txt}{space 11}L5. {c |}{col 16}{res}{space 2}-.1085013{col 28}{space 2} .0408564{col 39}{space 1}   -2.66{col 48}{space 3}0.011{col 56}{space 4}-.1909529{col 69}{space 3}-.0260497
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2}-.0197322{col 28}{space 2} .0243047{col 39}{space 1}   -0.81{col 48}{space 3}0.421{col 56}{space 4} -.068781{col 69}{space 3} .0293166
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(4697 real changes made)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dateQ, 1968q4 to 2019q1, but with gaps
{txt}{col 17}delta:  {res}1 quarter
{txt}(3676 real changes made)

Linear regression                                      Number of obs ={res}    2377
                                                       {txt}F(  3,   130) ={res}    4.60
                                                       {txt}Prob > F      = {res} 0.0043
                                                       {txt}R-squared     = {res} 0.1163
                                                       {txt}Root MSE      = {res}  1.104

{txt}{ralign 78:(Std. Err. adjusted for {res:131} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .4174231{col 26}{space 2}  .137421{col 37}{space 1}    3.04{col 46}{space 3}0.003{col 54}{space 4} .1455522{col 67}{space 3}  .689294
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.3037186{col 26}{space 2} .1182731{col 37}{space 1}   -2.57{col 46}{space 3}0.011{col 54}{space 4}-.5377078{col 67}{space 3}-.0697294
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .1380812{col 26}{space 2} .0812628{col 37}{space 1}    1.70{col 46}{space 3}0.092{col 54}{space 4}-.0226876{col 67}{space 3}   .29885
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1211277{col 26}{space 2} .1058514{col 37}{space 1}    1.14{col 46}{space 3}0.255{col 54}{space 4}-.0882866{col 67}{space 3}  .330542
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    1811
                                                       {txt}F(  3,   127) ={res}    3.03
                                                       {txt}Prob > F      = {res} 0.0319
                                                       {txt}R-squared     = {res} 0.1604
                                                       {txt}Root MSE      = {res} .88003

{txt}{ralign 78:(Std. Err. adjusted for {res:128} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_FE_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_FE_ch {c |}
{space 9}L3. {c |}{col 14}{res}{space 2}   .02618{col 26}{space 2}   .05543{col 37}{space 1}    0.47{col 46}{space 3}0.638{col 54}{space 4} -.083506{col 67}{space 3} .1358659
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.3774225{col 26}{space 2} .1605733{col 37}{space 1}   -2.35{col 46}{space 3}0.020{col 54}{space 4}-.6951681{col 67}{space 3}-.0596768
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}  .030165{col 26}{space 2} .0745361{col 37}{space 1}    0.40{col 46}{space 3}0.686{col 54}{space 4}-.1173286{col 67}{space 3} .1776585
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0147453{col 26}{space 2} .0759671{col 37}{space 1}    0.19{col 46}{space 3}0.846{col 54}{space 4}-.1355799{col 67}{space 3} .1650705
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(4706 real changes made, 3027 to missing)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dateQ, 1968q4 to 2019q1, but with gaps
{txt}{col 17}delta:  {res}1 quarter
{txt}(3685 real changes made, 2308 to missing)

Linear regression                                      Number of obs ={res}     914
                                                       {txt}F(  3,    42) ={res}    2.01
                                                       {txt}Prob > F      = {res} 0.1270
                                                       {txt}R-squared     = {res} 0.0840
                                                       {txt}Root MSE      = {res} .98575

{txt}{ralign 78:(Std. Err. adjusted for {res:43} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .3994771{col 26}{space 2} .1878559{col 37}{space 1}    2.13{col 46}{space 3}0.039{col 54}{space 4} .0203686{col 67}{space 3} .7785857
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.3735824{col 26}{space 2} .1754272{col 37}{space 1}   -2.13{col 46}{space 3}0.039{col 54}{space 4}-.7276088{col 67}{space 3} -.019556
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .1758436{col 26}{space 2} .1416104{col 37}{space 1}    1.24{col 46}{space 3}0.221{col 54}{space 4}-.1099377{col 67}{space 3} .4616249
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2623532{col 26}{space 2} .1519329{col 37}{space 1}    1.73{col 46}{space 3}0.092{col 54}{space 4}-.0442599{col 67}{space 3} .5689662
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     734
                                                       {txt}F(  3,    41) ={res}    1.35
                                                       {txt}Prob > F      = {res} 0.2725
                                                       {txt}R-squared     = {res} 0.1441
                                                       {txt}Root MSE      = {res} .70454

{txt}{ralign 78:(Std. Err. adjusted for {res:42} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_FE_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_FE_ch {c |}
{space 9}L3. {c |}{col 14}{res}{space 2}-.0722702{col 26}{space 2} .0505269{col 37}{space 1}   -1.43{col 46}{space 3}0.160{col 54}{space 4}-.1743113{col 67}{space 3} .0297709
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.3759278{col 26}{space 2} .2103633{col 37}{space 1}   -1.79{col 46}{space 3}0.081{col 54}{space 4}-.8007652{col 67}{space 3} .0489096
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0121895{col 26}{space 2}  .073111{col 37}{space 1}   -0.17{col 46}{space 3}0.868{col 54}{space 4}-.1598402{col 67}{space 3} .1354613
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0459795{col 26}{space 2}  .083941{col 37}{space 1}    0.55{col 46}{space 3}0.587{col 54}{space 4}-.1235428{col 67}{space 3} .2155018
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(1604 real changes made)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dateQ, 1968q4 to 2019q1, but with gaps
{txt}{col 17}delta:  {res}1 quarter
{txt}(1236 real changes made)

Linear regression                                      Number of obs ={res}     724
                                                       {txt}F(  3,    43) ={res}    0.26
                                                       {txt}Prob > F      = {res} 0.8549
                                                       {txt}R-squared     = {res} 0.0008
                                                       {txt}Root MSE      = {res}  15780

{txt}{ralign 78:(Std. Err. adjusted for {res:44} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  InfExp_Var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}InfExp_Var {c |}
{space 9}L3. {c |}{col 14}{res}{space 2}-10.75728{col 26}{space 2} 13.84827{col 37}{space 1}   -0.78{col 46}{space 3}0.442{col 54}{space 4}-38.68497{col 67}{space 3} 17.17041
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} 19.60226{col 26}{space 2} 22.35555{col 37}{space 1}    0.88{col 46}{space 3}0.385{col 54}{space 4}  -25.482{col 67}{space 3} 64.68653
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-15.28533{col 26}{space 2} 19.14477{col 37}{space 1}   -0.80{col 46}{space 3}0.429{col 54}{space 4}-53.89444{col 67}{space 3} 23.32377
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-597.3013{col 26}{space 2} 598.1321{col 37}{space 1}   -1.00{col 46}{space 3}0.324{col 54}{space 4} -1803.55{col 67}{space 3}  608.947
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     520
                                                       {txt}F(  3,    42) ={res}    1.47
                                                       {txt}Prob > F      = {res} 0.2363
                                                       {txt}R-squared     = {res} 0.0000
                                                       {txt}Root MSE      = {res}  .1847

{txt}{ralign 79:(Std. Err. adjusted for {res:43} clusters in dateQ)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}InfExp_Var_ch{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_ch {c |}
{space 10}L3. {c |}{col 15}{res}{space 2} .0000155{col 27}{space 2} .0000184{col 38}{space 1}    0.85{col 47}{space 3}0.402{col 55}{space 4}-.0000215{col 68}{space 3} .0000526
{txt}{space 10}L4. {c |}{col 15}{res}{space 2} 5.17e-06{col 27}{space 2} 6.47e-06{col 38}{space 1}    0.80{col 47}{space 3}0.429{col 55}{space 4}-7.89e-06{col 68}{space 3} .0000182
{txt}{space 10}L5. {c |}{col 15}{res}{space 2}-.0000217{col 27}{space 2} .0000208{col 38}{space 1}   -1.04{col 47}{space 3}0.303{col 55}{space 4}-.0000637{col 68}{space 3} .0000203
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}-.0032544{col 27}{space 2}  .008313{col 38}{space 1}   -0.39{col 47}{space 3}0.697{col 55}{space 4}-.0200307{col 68}{space 3}  .013522
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(1356 real changes made, 263 to missing)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dateQ, 1968q4 to 2019q1, but with gaps
{txt}{col 17}delta:  {res}1 quarter
{txt}(1102 real changes made, 258 to missing)

Linear regression                                      Number of obs ={res}     604
                                                       {txt}F(  3,    43) ={res}    4.17
                                                       {txt}Prob > F      = {res} 0.0111
                                                       {txt}R-squared     = {res} 0.0002
                                                       {txt}Root MSE      = {res} 55.121

{txt}{ralign 78:(Std. Err. adjusted for {res:44} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  InfExp_Var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}InfExp_Var {c |}
{space 9}L3. {c |}{col 14}{res}{space 2}-.0000192{col 26}{space 2} .0000124{col 37}{space 1}   -1.54{col 46}{space 3}0.130{col 54}{space 4}-.0000442{col 67}{space 3} 5.88e-06
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} 2.853177{col 26}{space 2}  2.20432{col 37}{space 1}    1.29{col 46}{space 3}0.202{col 54}{space 4}-1.592258{col 67}{space 3} 7.298611
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}   1.4856{col 26}{space 2} 1.469839{col 37}{space 1}    1.01{col 46}{space 3}0.318{col 54}{space 4}-1.478613{col 67}{space 3} 4.449814
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-2.552768{col 26}{space 2} 2.589636{col 37}{space 1}   -0.99{col 46}{space 3}0.330{col 54}{space 4}-7.775267{col 67}{space 3}  2.66973
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     406
                                                       {txt}F(  3,    42) ={res}    1.78
                                                       {txt}Prob > F      = {res} 0.1666
                                                       {txt}R-squared     = {res} 0.0921
                                                       {txt}Root MSE      = {res} .15326

{txt}{ralign 79:(Std. Err. adjusted for {res:43} clusters in dateQ)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}InfExp_Var_ch{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_ch {c |}
{space 10}L3. {c |}{col 15}{res}{space 2}  .000014{col 27}{space 2} 7.33e-06{col 38}{space 1}    1.91{col 47}{space 3}0.063{col 55}{space 4}-7.84e-07{col 68}{space 3} .0000288
{txt}{space 10}L4. {c |}{col 15}{res}{space 2} .1664586{col 27}{space 2} .3221009{col 38}{space 1}    0.52{col 47}{space 3}0.608{col 55}{space 4}-.4835673{col 68}{space 3} .8164845
{txt}{space 10}L5. {c |}{col 15}{res}{space 2}-.2622411{col 27}{space 2} .1679965{col 38}{space 1}   -1.56{col 47}{space 3}0.126{col 55}{space 4}-.6012719{col 68}{space 3} .0767896
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .0068932{col 27}{space 2} .0062073{col 38}{space 1}    1.11{col 47}{space 3}0.273{col 55}{space 4}-.0056335{col 68}{space 3}   .01942
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. esttab using "${c -(}sum_table_folder{c )-}/ind/autoregSPFIndQ.csv", mtitles se  r2 replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/ind/autoregSPFIndQ.csv"'})

{com}. eststo clear
{txt}
{com}. 
. 
. 
. *******************************
. *** Unbiasedness Test        **
. *******************************
. eststo clear
{txt}
{com}. 
. foreach mom in FE{c -(}
{txt}  2{com}.    foreach var in SPFCPI SPFPCE{c -(}
{txt}  3{com}.       ttest `var'_`mom'=0
{txt}  4{com}. {c )-}
{txt}  5{com}. {c )-}

{txt}One-sample t test
{hline 9}{c TT}{hline 68}
Variable{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. Err.{col 47}Std. Dev.{col 59}[95% Conf. Interval]
{hline 9}{c +}{hline 68}
SPFCPI~E {c |}{res}{col 12}   4697{col 22} .1216707{col 34} .0171015{col 46} 1.172043{col 58} .0881438{col 70} .1551976
{txt}{hline 9}{c BT}{hline 68}
    mean = mean({res}SPFCPI_FE{txt})                                        t = {res}  7.1146
{txt}Ho: mean = {res}0                                     {txt}degrees of freedom = {res}    4696

    {txt}Ha: mean < {res}0                 {txt}Ha: mean != {res}0                 {txt}Ha: mean > {res}0
 {txt}Pr(T < t) = {res}1.0000         {txt}Pr(|T| > |t|) = {res}0.0000          {txt}Pr(T > t) = {res}0.0000

{txt}One-sample t test
{hline 9}{c TT}{hline 68}
Variable{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. Err.{col 47}Std. Dev.{col 59}[95% Conf. Interval]
{hline 9}{c +}{hline 68}
SPFPCE~E {c |}{res}{col 12}   1679{col 22} .2107691{col 34} .0260663{col 46} 1.068084{col 58} .1596431{col 70}  .261895
{txt}{hline 9}{c BT}{hline 68}
    mean = mean({res}SPFPCE_FE{txt})                                        t = {res}  8.0859
{txt}Ho: mean = {res}0                                     {txt}degrees of freedom = {res}    1678

    {txt}Ha: mean < {res}0                 {txt}Ha: mean != {res}0                 {txt}Ha: mean > {res}0
 {txt}Pr(T < t) = {res}1.0000         {txt}Pr(|T| > |t|) = {res}0.0000          {txt}Pr(T > t) = {res}0.0000
{txt}
{com}. 
. gen const=1
{txt}
{com}. 
. foreach mom in FE{c -(}
{txt}  2{com}.    foreach var in SPFCPI SPFPCE{c -(}
{txt}  3{com}.       eststo `var'_`mom'_bias: reg `var'_`mom' const
{txt}  4{com}. {c )-}
{txt}  5{com}. {c )-}
{txt}note: const omitted because of collinearity

      Source {c |}       SS       df       MS              Number of obs ={res}    4697
{txt}{hline 13}{char +}{hline 30}           F(  0,  4696) ={res}    0.00
    {txt}   Model {char |} {res}          0     0           .           {txt}Prob > F      = {res}      .
    {txt}Residual {char |} {res} 6450.82257  4696  1.37368453           {txt}R-squared     = {res} 0.0000
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0000
    {txt}   Total {char |} {res} 6450.82257  4696  1.37368453           {txt}Root MSE      = {res}  1.172

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   SPFCPI_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}const {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}_cons {c |}{col 14}{res}{space 2} .1216707{col 26}{space 2} .0171015{col 37}{space 1}    7.11{col 46}{space 3}0.000{col 54}{space 4} .0881438{col 67}{space 3} .1551976
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}note: const omitted because of collinearity

      Source {c |}       SS       df       MS              Number of obs ={res}    1679
{txt}{hline 13}{char +}{hline 30}           F(  0,  1678) ={res}    0.00
    {txt}   Model {char |} {res}          0     0           .           {txt}Prob > F      = {res}      .
    {txt}Residual {char |} {res} 1914.26649  1678  1.14080244           {txt}R-squared     = {res} 0.0000
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0000
    {txt}   Total {char |} {res} 1914.26649  1678  1.14080244           {txt}Root MSE      = {res} 1.0681

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   SPFPCE_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}const {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}_cons {c |}{col 14}{res}{space 2} .2107691{col 26}{space 2} .0260663{col 37}{space 1}    8.09{col 46}{space 3}0.000{col 54}{space 4} .1596431{col 67}{space 3}  .261895
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/ind/SPFIndBias.csv", drop(_cons) mtitles se r2 replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/ind/SPFIndBias.csv"'})

{com}. 
. 
. **********************************************
. *** Revision Efficiency Test Using FE       **
. **********************************************
. 
. eststo clear
{txt}
{com}. 
. foreach mom in FE{c -(}
{txt}  2{com}.    foreach var in SPFCPI SPFPCE{c -(}
{txt}  3{com}.    replace InfExp_Mean = `var'_Mean
{txt}  4{com}.    replace InfExp_`mom' = `var'_`mom'
{txt}  5{com}.    eststo `var'_`mom'_bias: reg InfExp_`mom',robust 
{txt}  6{com}.    eststo `var'_`mom'_lag4: reg  InfExp_`mom' l(4).InfExp_Mean, robust
{txt}  7{com}.    eststo `var'_`mom'_arlag4: reg InfExp_`mom' l(4).InfExp_`mom',robust
{txt}  8{com}.    eststo `var'_`mom'_arlag13: reg  InfExp_`mom' l(1/3).InfExp_`mom', robust
{txt}  9{com}. 
.  {c )-}
{txt} 10{com}. {c )-}
{txt}(5049 real changes made, 9 to missing)
(4706 real changes made, 9 to missing)

Linear regression                                      Number of obs ={res}    4697
                                                       {txt}F(  0,  4696) ={res}    0.00
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.0000
                                                       {txt}Root MSE      = {res}  1.172

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .1216707{col 26}{space 2} .0171015{col 37}{space 1}    7.11{col 46}{space 3}0.000{col 54}{space 4} .0881438{col 67}{space 3} .1551976
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    3429
                                                       {txt}F(  1,  3427) ={res}  229.77
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0721
                                                       {txt}Root MSE      = {res} 1.1244

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Mean {c |}
{space 9}L4. {c |}{col 14}{res}{space 2} .3074714{col 26}{space 2} .0202843{col 37}{space 1}   15.16{col 46}{space 3}0.000{col 54}{space 4} .2677009{col 67}{space 3} .3472419
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} -.654955{col 26}{space 2} .0601705{col 37}{space 1}  -10.88{col 46}{space 3}0.000{col 54}{space 4}-.7729286{col 67}{space 3}-.5369813
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    3356
                                                       {txt}F(  1,  3354) ={res}   13.66
                                                       {txt}Prob > F      = {res} 0.0002
                                                       {txt}R-squared     = {res} 0.0059
                                                       {txt}Root MSE      = {res} 1.1621

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L4. {c |}{col 14}{res}{space 2}  .075573{col 26}{space 2} .0204453{col 37}{space 1}    3.70{col 46}{space 3}0.000{col 54}{space 4} .0354864{col 67}{space 3} .1156596
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1450244{col 26}{space 2} .0209541{col 37}{space 1}    6.92{col 46}{space 3}0.000{col 54}{space 4} .1039403{col 67}{space 3} .1861086
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    2536
                                                       {txt}F(  3,  2532) ={res}  253.81
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4386
                                                       {txt}Root MSE      = {res} .87987

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .6572426{col 26}{space 2} .0253254{col 37}{space 1}   25.95{col 46}{space 3}0.000{col 54}{space 4} .6075821{col 67}{space 3} .7069032
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0281502{col 26}{space 2} .0274721{col 37}{space 1}    1.02{col 46}{space 3}0.306{col 54}{space 4}  -.02572{col 67}{space 3} .0820203
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0244041{col 26}{space 2} .0247193{col 37}{space 1}   -0.99{col 46}{space 3}0.324{col 54}{space 4}-.0728762{col 67}{space 3}  .024068
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0625918{col 26}{space 2} .0186827{col 37}{space 1}    3.35{col 46}{space 3}0.001{col 54}{space 4} .0259568{col 67}{space 3} .0992267
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(5049 real changes made, 3352 to missing)
(4706 real changes made, 3027 to missing)

Linear regression                                      Number of obs ={res}    1679
                                                       {txt}F(  0,  1678) ={res}    0.00
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.0000
                                                       {txt}Root MSE      = {res} 1.0681

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .2107691{col 26}{space 2} .0260663{col 37}{space 1}    8.09{col 46}{space 3}0.000{col 54}{space 4} .1596431{col 67}{space 3}  .261895
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    1208
                                                       {txt}F(  1,  1206) ={res}   90.85
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.1185
                                                       {txt}Root MSE      = {res} 1.0012

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Mean {c |}
{space 9}L4. {c |}{col 14}{res}{space 2} .5857937{col 26}{space 2} .0614598{col 37}{space 1}    9.53{col 46}{space 3}0.000{col 54}{space 4} .4652137{col 67}{space 3} .7063738
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.7773054{col 26}{space 2} .1160541{col 37}{space 1}   -6.70{col 46}{space 3}0.000{col 54}{space 4}-1.004996{col 67}{space 3}-.5496151
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    1208
                                                       {txt}F(  1,  1206) ={res}    2.10
                                                       {txt}Prob > F      = {res} 0.1475
                                                       {txt}R-squared     = {res} 0.0026
                                                       {txt}Root MSE      = {res} 1.0649

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L4. {c |}{col 14}{res}{space 2} .0503489{col 26}{space 2} .0347391{col 37}{space 1}    1.45{col 46}{space 3}0.148{col 54}{space 4} -.017807{col 67}{space 3} .1185047
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2753429{col 26}{space 2} .0354253{col 37}{space 1}    7.77{col 46}{space 3}0.000{col 54}{space 4} .2058409{col 67}{space 3} .3448448
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    1004
                                                       {txt}F(  3,  1000) ={res}  213.91
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.5522
                                                       {txt}Root MSE      = {res} .70488

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .8342042{col 26}{space 2} .0372759{col 37}{space 1}   22.38{col 46}{space 3}0.000{col 54}{space 4} .7610563{col 67}{space 3} .9073521
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0858135{col 26}{space 2} .0482513{col 37}{space 1}   -1.78{col 46}{space 3}0.076{col 54}{space 4} -.180499{col 67}{space 3} .0088719
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0555186{col 26}{space 2} .0379728{col 37}{space 1}   -1.46{col 46}{space 3}0.144{col 54}{space 4}-.1300342{col 67}{space 3}  .018997
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1134369{col 26}{space 2} .0262168{col 37}{space 1}    4.33{col 46}{space 3}0.000{col 54}{space 4} .0619907{col 67}{space 3} .1648832
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. esttab using "${c -(}sum_table_folder{c )-}/ind/FEEfficiencySPFIndQ.csv", mtitles se(%8.3f) scalars(N r2) replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/ind/FEEfficiencySPFIndQ.csv"'})

{com}. 
. dd
{err}unrecognized command:  dd
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. clear

. 