{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/ExpProject/workingfolder/indSCE_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 Jul 2019, 16:50:00
{txt}
{com}. 
. 
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SCE/InfExpSCEProbIndM",clear 
{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}        {res}68887             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. rename userid ID 
{res}{txt}
{com}. 
. merge m:1 year month using "${c -(}mainfolder{c )-}/OtherData/InfShocksMClean.dta",keep(match using master)
{res}{txt}{p 0 7 2}
(note: variable
year was 
int, now float to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
month was 
byte, now float to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             828
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}             828{txt}  (_merge==2)

{col 5}matched{col 30}{res}          68,887{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge infshocks_merge
{res}{txt}
{com}. 
. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. 
. xtset ID date
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2014m1 to 2018m5, but with gaps
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. sort ID year month 
{txt}
{com}. 
. 
. *******************************
. **  Summary Statistics of SCE **
. *******************************
. 
. *tabstat ID,s(count) by(date) column(statistics)
. 
. ******************************
. *** Computing some measures **
. ******************************
. 
. gen SCE_FE = Q9_mean - Inf1y_CPIAU
{txt}(8863 missing values generated)

{com}. label var SCE_FE "1-yr-ahead forecast error(SCE)"
{txt}
{com}. 
. *****************************************
. ****  Renaming so that more consistent **
. *****************************************
. 
. rename Q9_mean SCE_Mean
{res}{txt}
{com}. rename Q9_var SCE_Var
{res}{txt}
{com}. 
. rename Q9c_mean SCE_Mean1
{res}{txt}
{com}. rename Q9c_var SCE_Var1
{res}{txt}
{com}. 
. *******************************
. **  Generate Variables       **
. *******************************
. 
. gen InfExp_Mean = .
{txt}(69715 missing values generated)

{com}. gen InfExp_Var = .
{txt}(69715 missing values generated)

{com}. gen InfExp_FE = .
{txt}(69715 missing values generated)

{com}. *gen InfExp_Disg = . 
. 
. 
. gen InfExp_Mean_ch = .
{txt}(69715 missing values generated)

{com}. gen InfExp_Var_ch = .
{txt}(69715 missing values generated)

{com}. gen InfExp_FE_ch = .
{txt}(69715 missing values generated)

{com}. *gen InfExp_Disg_ch = . 
. 
. gen InfExp_Mean0 = .
{txt}(69715 missing values generated)

{com}. gen InfExp_Var0 = .
{txt}(69715 missing values generated)

{com}. 
. 
. gen InfExp_Mean_rv = .
{txt}(69715 missing values generated)

{com}. gen InfExp_Var_rv = .
{txt}(69715 missing values generated)

{com}. 
. ************************************************
. ** Auto Regression of the Individual Moments  **
. ************************************************
. 
. eststo clear
{txt}
{com}. 
. foreach mom in Mean FE Var{c -(}
{txt}  2{com}.    foreach var in SCE{c -(}
{txt}  3{com}.     replace InfExp_`mom' = `var'_`mom'
{txt}  4{com}.         xtset ID date
{txt}  5{com}.     replace InfExp_`mom'_ch = InfExp_`mom'-l1.InfExp_`mom'
{txt}  6{com}. 
.         eststo `var'_`mom'lvl: reg InfExp_`mom' l(3/5).InfExp_`mom', vce(cluster date)
{txt}  7{com}.     eststo `var'_`mom'diff: reg InfExp_`mom'_ch l(3/5).InfExp_`mom'_ch, vce(cluster date)
{txt}  8{com}.   {c )-}
{txt}  9{com}. {c )-}
{txt}(60852 real changes made)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2014m1 to 2018m5, but with gaps
{txt}{col 17}delta:  {res}1 month
{txt}(45671 real changes made)

Linear regression                                      Number of obs ={res}   20900
                                                       {txt}F(  3,    47) ={res} 2219.12
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4273
                                                       {txt}Root MSE      = {res} 1.6061

{txt}{ralign 78:(Std. Err. adjusted for {res:48} clusters in date)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} InfExp_Mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Mean {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .3701313{col 26}{space 2} .0112163{col 37}{space 1}   33.00{col 46}{space 3}0.000{col 54}{space 4} .3475671{col 67}{space 3} .3926956
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .2215058{col 26}{space 2} .0107518{col 37}{space 1}   20.60{col 46}{space 3}0.000{col 54}{space 4} .1998758{col 67}{space 3} .2431357
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .1444161{col 26}{space 2} .0101612{col 37}{space 1}   14.21{col 46}{space 3}0.000{col 54}{space 4} .1239743{col 67}{space 3} .1648578
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .7637024{col 26}{space 2} .0337736{col 37}{space 1}   22.61{col 46}{space 3}0.000{col 54}{space 4} .6957588{col 67}{space 3} .8316461
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}   15038
                                                       {txt}F(  3,    46) ={res}    0.22
                                                       {txt}Prob > F      = {res} 0.8816
                                                       {txt}R-squared     = {res} 0.0001
                                                       {txt}Root MSE      = {res} 1.6188

{txt}{ralign 80:(Std. Err. adjusted for {res:47} clusters in date)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}InfExp_Mean_ch{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Mean_ch {c |}
{space 11}L3. {c |}{col 16}{res}{space 2}-.0009612{col 28}{space 2} .0093504{col 39}{space 1}   -0.10{col 48}{space 3}0.919{col 56}{space 4}-.0197826{col 69}{space 3} .0178602
{txt}{space 11}L4. {c |}{col 16}{res}{space 2} .0061175{col 28}{space 2} .0126311{col 39}{space 1}    0.48{col 48}{space 3}0.630{col 56}{space 4}-.0193075{col 69}{space 3} .0315426
{txt}{space 11}L5. {c |}{col 16}{res}{space 2}-.0035627{col 28}{space 2}  .012003{col 39}{space 1}   -0.30{col 48}{space 3}0.768{col 56}{space 4}-.0277235{col 69}{space 3} .0205981
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2}-.0060514{col 28}{space 2} .0191232{col 39}{space 1}   -0.32{col 48}{space 3}0.753{col 56}{space 4}-.0445443{col 69}{space 3} .0324416
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(60852 real changes made)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2014m1 to 2018m5, but with gaps
{txt}{col 17}delta:  {res}1 month
{txt}(45671 real changes made)

Linear regression                                      Number of obs ={res}   20900
                                                       {txt}F(  3,    47) ={res} 1077.45
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4521
                                                       {txt}Root MSE      = {res}  1.689

{txt}{ralign 78:(Std. Err. adjusted for {res:48} clusters in date)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .3958602{col 26}{space 2} .0133971{col 37}{space 1}   29.55{col 46}{space 3}0.000{col 54}{space 4} .3689088{col 67}{space 3} .4228116
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .2230562{col 26}{space 2} .0112183{col 37}{space 1}   19.88{col 46}{space 3}0.000{col 54}{space 4}  .200488{col 67}{space 3} .2456245
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .1370436{col 26}{space 2} .0102556{col 37}{space 1}   13.36{col 46}{space 3}0.000{col 54}{space 4} .1164121{col 67}{space 3} .1576752
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3275076{col 26}{space 2} .0765611{col 37}{space 1}    4.28{col 46}{space 3}0.000{col 54}{space 4} .1734865{col 67}{space 3} .4815288
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}   15038
                                                       {txt}F(  3,    46) ={res}    0.23
                                                       {txt}Prob > F      = {res} 0.8741
                                                       {txt}R-squared     = {res} 0.0001
                                                       {txt}Root MSE      = {res} 1.6346

{txt}{ralign 78:(Std. Err. adjusted for {res:47} clusters in date)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_FE_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_FE_ch {c |}
{space 9}L3. {c |}{col 14}{res}{space 2}-.0047722{col 26}{space 2} .0098199{col 37}{space 1}   -0.49{col 46}{space 3}0.629{col 54}{space 4}-.0245387{col 67}{space 3} .0149943
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0057087{col 26}{space 2} .0121169{col 37}{space 1}    0.47{col 46}{space 3}0.640{col 54}{space 4}-.0186813{col 67}{space 3} .0300988
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0017234{col 26}{space 2} .0113269{col 37}{space 1}   -0.15{col 46}{space 3}0.880{col 54}{space 4}-.0245233{col 67}{space 3} .0210765
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0210511{col 26}{space 2} .0376739{col 37}{space 1}   -0.56{col 46}{space 3}0.579{col 54}{space 4}-.0968848{col 67}{space 3} .0547826
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(62284 real changes made)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2014m1 to 2018m5, but with gaps
{txt}{col 17}delta:  {res}1 month
{txt}(46977 real changes made)

Linear regression                                      Number of obs ={res}   21552
                                                       {txt}F(  3,    47) ={res} 1563.14
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.5250
                                                       {txt}Root MSE      = {res} 9.6754

{txt}{ralign 78:(Std. Err. adjusted for {res:48} clusters in date)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  InfExp_Var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}InfExp_Var {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .3704013{col 26}{space 2} .0148611{col 37}{space 1}   24.92{col 46}{space 3}0.000{col 54}{space 4} .3405046{col 67}{space 3} .4002981
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .2492604{col 26}{space 2} .0128831{col 37}{space 1}   19.35{col 46}{space 3}0.000{col 54}{space 4} .2233428{col 67}{space 3} .2751779
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}  .144922{col 26}{space 2} .0111137{col 37}{space 1}   13.04{col 46}{space 3}0.000{col 54}{space 4} .1225641{col 67}{space 3} .1672798
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .7773746{col 26}{space 2} .0777456{col 37}{space 1}   10.00{col 46}{space 3}0.000{col 54}{space 4} .6209706{col 67}{space 3} .9337786
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}   15357
                                                       {txt}F(  3,    46) ={res}    0.35
                                                       {txt}Prob > F      = {res} 0.7909
                                                       {txt}R-squared     = {res} 0.0003
                                                       {txt}Root MSE      = {res} 9.7427

{txt}{ralign 79:(Std. Err. adjusted for {res:47} clusters in date)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}InfExp_Var_ch{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_ch {c |}
{space 10}L3. {c |}{col 15}{res}{space 2} .0046888{col 27}{space 2} .0190674{col 38}{space 1}    0.25{col 47}{space 3}0.807{col 55}{space 4}-.0336919{col 68}{space 3} .0430696
{txt}{space 10}L4. {c |}{col 15}{res}{space 2} .0090318{col 27}{space 2} .0189609{col 38}{space 1}    0.48{col 47}{space 3}0.636{col 55}{space 4}-.0291344{col 68}{space 3} .0471981
{txt}{space 10}L5. {c |}{col 15}{res}{space 2} .0143406{col 27}{space 2} .0140474{col 38}{space 1}    1.02{col 47}{space 3}0.313{col 55}{space 4}-.0139352{col 68}{space 3} .0426165
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}-.1834709{col 27}{space 2} .0892104{col 38}{space 1}   -2.06{col 47}{space 3}0.045{col 55}{space 4}-.3630422{col 68}{space 3}-.0038997
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. esttab using "${c -(}sum_table_folder{c )-}/ind/autoregSCEIndM.csv", mtitles se  r2 replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/ind/autoregSCEIndM.csv"'})

{com}. eststo clear
{txt}
{com}. 
. *******************************
. *** Unbiasedness Test        **
. *******************************
. eststo clear
{txt}
{com}. 
. foreach mom in FE{c -(}
{txt}  2{com}.    foreach var in SCE{c -(}
{txt}  3{com}.       ttest `var'_`mom'=0
{txt}  4{com}. {c )-}
{txt}  5{com}. {c )-}

{txt}One-sample t test
{hline 9}{c TT}{hline 68}
Variable{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. Err.{col 47}Std. Dev.{col 59}[95% Conf. Interval]
{hline 9}{c +}{hline 68}
  SCE_FE {c |}{res}{col 12}  60852{col 22} 1.827947{col 34} .0105508{col 46} 2.602704{col 58} 1.807267{col 70} 1.848627
{txt}{hline 9}{c BT}{hline 68}
    mean = mean({res}SCE_FE{txt})                                           t = {res}173.2512
{txt}Ho: mean = {res}0                                     {txt}degrees of freedom = {res}   60851

    {txt}Ha: mean < {res}0                 {txt}Ha: mean != {res}0                 {txt}Ha: mean > {res}0
 {txt}Pr(T < t) = {res}1.0000         {txt}Pr(|T| > |t|) = {res}0.0000          {txt}Pr(T > t) = {res}0.0000
{txt}
{com}. 
. **********************************************
. *** Revision Efficiency Test Using FE       **
. **********************************************
. 
. eststo clear
{txt}
{com}. 
. foreach mom in FE{c -(}
{txt}  2{com}.    foreach var in SCE{c -(}
{txt}  3{com}.    replace InfExp_Mean = `var'_Mean
{txt}  4{com}.    replace InfExp_`mom' = `var'_`mom'
{txt}  5{com}.    eststo `var'_`mom'_bias: reg InfExp_`mom',robust 
{txt}  6{com}.    eststo `var'_`mom'_lag1: reg  InfExp_`mom' l(1/3).InfExp_Mean, robust
{txt}  7{com}.    eststo `var'_`mom'_lag4: reg  InfExp_`mom' l(4/7).InfExp_Mean, robust
{txt}  8{com}.    eststo `var'_`mom'_lag8: reg  InfExp_`mom' l(8/11).InfExp_Mean, robust
{txt}  9{com}.    eststo `var'_`mom'_arlag1: reg InfExp_`mom' l(1/3).InfExp_`mom',robust
{txt} 10{com}.    eststo `var'_`mom'_arlag4: reg InfExp_`mom' l(4/7).InfExp_`mom',robust
{txt} 11{com}.    eststo `var'_`mom'_arlag8: reg  InfExp_`mom' l(8/11).InfExp_`mom', robust
{txt} 12{com}. 
.  {c )-}
{txt} 13{com}. {c )-}
{txt}(0 real changes made)
(0 real changes made)

Linear regression                                      Number of obs ={res}   60852
                                                       {txt}F(  0, 60851) ={res}    0.00
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.0000
                                                       {txt}Root MSE      = {res} 2.6027

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.827947{col 26}{space 2} .0105508{col 37}{space 1}  173.25{col 46}{space 3}0.000{col 54}{space 4} 1.807267{col 67}{space 3} 1.848627
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}   28729
                                                       {txt}F(  3, 28725) ={res} 5094.53
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4424
                                                       {txt}Root MSE      = {res} 1.7144

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Mean {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .3815067{col 26}{space 2} .0090647{col 37}{space 1}   42.09{col 46}{space 3}0.000{col 54}{space 4} .3637394{col 67}{space 3} .3992739
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .2414785{col 26}{space 2} .0087912{col 37}{space 1}   27.47{col 46}{space 3}0.000{col 54}{space 4} .2242472{col 67}{space 3} .2587097
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1869406{col 26}{space 2} .0079101{col 37}{space 1}   23.63{col 46}{space 3}0.000{col 54}{space 4} .1714364{col 67}{space 3} .2024448
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.8413737{col 26}{space 2} .0190601{col 37}{space 1}  -44.14{col 46}{space 3}0.000{col 54}{space 4}-.8787325{col 67}{space 3} -.804015
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}   12862
                                                       {txt}F(  4, 12857) ={res} 1270.21
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.3812
                                                       {txt}Root MSE      = {res} 1.7621

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Mean {c |}
{space 9}L4. {c |}{col 14}{res}{space 2}  .342977{col 26}{space 2} .0137869{col 37}{space 1}   24.88{col 46}{space 3}0.000{col 54}{space 4} .3159525{col 67}{space 3} .3700015
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .2100082{col 26}{space 2} .0139406{col 37}{space 1}   15.06{col 46}{space 3}0.000{col 54}{space 4} .1826826{col 67}{space 3} .2373338
{txt}{space 9}L6. {c |}{col 14}{res}{space 2}  .139379{col 26}{space 2} .0128506{col 37}{space 1}   10.85{col 46}{space 3}0.000{col 54}{space 4} .1141899{col 67}{space 3} .1645682
{txt}{space 9}L7. {c |}{col 14}{res}{space 2} .0767908{col 26}{space 2}  .010682{col 37}{space 1}    7.19{col 46}{space 3}0.000{col 54}{space 4} .0558525{col 67}{space 3} .0977291
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.6892524{col 26}{space 2} .0308966{col 37}{space 1}  -22.31{col 46}{space 3}0.000{col 54}{space 4}-.7498144{col 67}{space 3}-.6286904
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    2082
                                                       {txt}F(  4,  2077) ={res}  158.82
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.2966
                                                       {txt}Root MSE      = {res} 1.8479

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Mean {c |}
{space 9}L8. {c |}{col 14}{res}{space 2} .3577539{col 26}{space 2}  .035275{col 37}{space 1}   10.14{col 46}{space 3}0.000{col 54}{space 4} .2885759{col 67}{space 3}  .426932
{txt}{space 9}L9. {c |}{col 14}{res}{space 2} .1696684{col 26}{space 2} .0338808{col 37}{space 1}    5.01{col 46}{space 3}0.000{col 54}{space 4} .1032245{col 67}{space 3} .2361123
{txt}{space 8}L10. {c |}{col 14}{res}{space 2}  .124326{col 26}{space 2} .0288689{col 37}{space 1}    4.31{col 46}{space 3}0.000{col 54}{space 4} .0677111{col 67}{space 3} .1809409
{txt}{space 8}L11. {c |}{col 14}{res}{space 2} .0378036{col 26}{space 2} .0227979{col 37}{space 1}    1.66{col 46}{space 3}0.097{col 54}{space 4}-.0069056{col 67}{space 3} .0825128
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.4758047{col 26}{space 2} .0811825{col 37}{space 1}   -5.86{col 46}{space 3}0.000{col 54}{space 4}-.6350124{col 67}{space 3}-.3165971
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}   28729
                                                       {txt}F(  3, 28725) ={res} 7762.22
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.5513
                                                       {txt}Root MSE      = {res}  1.538

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .4223151{col 26}{space 2} .0083744{col 37}{space 1}   50.43{col 46}{space 3}0.000{col 54}{space 4} .4059009{col 67}{space 3} .4387293
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .2427505{col 26}{space 2} .0081545{col 37}{space 1}   29.77{col 46}{space 3}0.000{col 54}{space 4} .2267674{col 67}{space 3} .2587337
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1704119{col 26}{space 2} .0072401{col 37}{space 1}   23.54{col 46}{space 3}0.000{col 54}{space 4} .1562209{col 67}{space 3}  .184603
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2152206{col 26}{space 2} .0102095{col 37}{space 1}   21.08{col 46}{space 3}0.000{col 54}{space 4} .1952095{col 67}{space 3} .2352318
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}   12862
                                                       {txt}F(  4, 12857) ={res} 1641.60
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4432
                                                       {txt}Root MSE      = {res} 1.6715

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L4. {c |}{col 14}{res}{space 2} .3821567{col 26}{space 2} .0126374{col 37}{space 1}   30.24{col 46}{space 3}0.000{col 54}{space 4} .3573854{col 67}{space 3} .4069279
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .2070949{col 26}{space 2} .0130794{col 37}{space 1}   15.83{col 46}{space 3}0.000{col 54}{space 4} .1814574{col 67}{space 3} .2327324
{txt}{space 9}L6. {c |}{col 14}{res}{space 2}  .118266{col 26}{space 2} .0119542{col 37}{space 1}    9.89{col 46}{space 3}0.000{col 54}{space 4}  .094834{col 67}{space 3} .1416979
{txt}{space 9}L7. {c |}{col 14}{res}{space 2} .0509152{col 26}{space 2} .0099015{col 37}{space 1}    5.14{col 46}{space 3}0.000{col 54}{space 4} .0315068{col 67}{space 3} .0703235
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3279735{col 26}{space 2} .0179642{col 37}{space 1}   18.26{col 46}{space 3}0.000{col 54}{space 4}  .292761{col 67}{space 3}  .363186
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    2082
                                                       {txt}F(  4,  2077) ={res}  160.32
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.2843
                                                       {txt}Root MSE      = {res} 1.8639

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L8. {c |}{col 14}{res}{space 2} .3661491{col 26}{space 2} .0339201{col 37}{space 1}   10.79{col 46}{space 3}0.000{col 54}{space 4} .2996282{col 67}{space 3} .4326701
{txt}{space 9}L9. {c |}{col 14}{res}{space 2} .1402774{col 26}{space 2} .0334257{col 37}{space 1}    4.20{col 46}{space 3}0.000{col 54}{space 4} .0747261{col 67}{space 3} .2058287
{txt}{space 8}L10. {c |}{col 14}{res}{space 2} .0945333{col 26}{space 2} .0283079{col 37}{space 1}    3.34{col 46}{space 3}0.001{col 54}{space 4} .0390185{col 67}{space 3} .1500481
{txt}{space 8}L11. {c |}{col 14}{res}{space 2} .0136305{col 26}{space 2} .0226722{col 37}{space 1}    0.60{col 46}{space 3}0.548{col 54}{space 4}-.0308322{col 67}{space 3} .0580931
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  .493153{col 26}{space 2} .0534421{col 37}{space 1}    9.23{col 46}{space 3}0.000{col 54}{space 4} .3883472{col 67}{space 3} .5979587
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. esttab using "${c -(}sum_table_folder{c )-}/ind/FEEfficiencySCEIndM.csv", mtitles se(%8.3f) scalars(N r2) replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/ind/FEEfficiencySCEIndM.csv"'})

{com}. 
. 
. *******************************************************
. ***  Weak test on changes of forecst and uncertainty **
. *******************************************************
. 
. ** Generate central tendency measures
. 
. foreach var in SCE{c -(}
{txt}  2{com}. foreach mom in Mean{c -(}
{txt}  3{com}.    egen `var'_`mom'_ct50 = pctile(`var'_`mom'),p(50) by(date)
{txt}  4{com}.    label var `var'_`mom'_ct50 "Median 1-year-ahead inflation."
{txt}  5{com}. {c )-}
{txt}  6{com}. {c )-}
{txt}(828 missing values generated)

{com}. 
. eststo clear
{txt}
{com}. 
. foreach var in SCE{c -(}
{txt}  2{com}.   foreach mom in Mean{c -(}
{txt}  3{com}.      replace InfExp_`mom'_ch =  `var'_`mom' - l1.`var'_`mom'
{txt}  4{com}.          eststo `var'`mom'diff0: reg InfExp_`mom'_ch, vce(cluster date)
{txt}  5{com}.      eststo `var'`mom'diff1: reg InfExp_`mom'_ch l1.InfExp_`mom'_ch, vce(cluster date)
{txt}  6{com}.          capture eststo `var'`mom'diff2: reg  InfExp_`mom'_ch l(1/3).InfExp_`mom'_ch, vce(cluster date)
{txt}  7{com}.          capture eststo `var'`mom'diff3: reg  InfExp_`mom'_ch l(1/6).InfExp_`mom'_ch, vce(cluster date)
{txt}  8{com}.  {c )-}
{txt}  9{com}. {c )-}
{txt}(0 real changes made)

Linear regression                                      Number of obs ={res}   45671
                                                       {txt}F(  0,    51) ={res}    0.00
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.0000
                                                       {txt}Root MSE      = {res} 2.0811

{txt}{ralign 78:(Std. Err. adjusted for {res:52} clusters in date)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_Mea~h{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0492659{col 26}{space 2} .0149048{col 37}{space 1}   -3.31{col 46}{space 3}0.002{col 54}{space 4}-.0791886{col 67}{space 3}-.0193433
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}   36006
                                                       {txt}F(  1,    50) ={res} 2831.85
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.1964
                                                       {txt}Root MSE      = {res}  1.704

{txt}{ralign 80:(Std. Err. adjusted for {res:51} clusters in date)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}InfExp_Mean_ch{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Mean_ch {c |}
{space 11}L1. {c |}{col 16}{res}{space 2}-.4144727{col 28}{space 2} .0077886{col 39}{space 1}  -53.22{col 48}{space 3}0.000{col 56}{space 4}-.4301166{col 69}{space 3}-.3988287
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2}-.0356049{col 28}{space 2} .0147776{col 39}{space 1}   -2.41{col 48}{space 3}0.020{col 56}{space 4}-.0652867{col 69}{space 3}-.0059232
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. foreach var in SCE{c -(}
{txt}  2{com}.   foreach mom in Var{c -(}
{txt}  3{com}.      replace InfExp_`mom'_ch =  `var'_`mom' - l1.`var'_`mom'
{txt}  4{com}.          eststo `var'`mom'diff0: reg InfExp_`mom'_ch, vce(cluster date) 
{txt}  5{com}.      eststo `var'`mom'diff1: reg InfExp_`mom'_ch l1.InfExp_`mom'_ch, vce(cluster date) 
{txt}  6{com}.          eststo `var'`mom'diff2: reg  InfExp_`mom'_ch l(1/3).InfExp_`mom'_ch, vce(cluster date) 
{txt}  7{com}.          capture eststo `var'`mom'diff3: reg  InfExp_`mom'_ch l(1/6).InfExp_`mom'_ch, vce(cluster date)
{txt}  8{com}.  {c )-}
{txt}  9{com}. {c )-}
{txt}(0 real changes made)

Linear regression                                      Number of obs ={res}   46977
                                                       {txt}F(  0,    51) ={res}    0.00
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.0000
                                                       {txt}Root MSE      = {res} 13.007

{txt}{ralign 78:(Std. Err. adjusted for {res:52} clusters in date)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_Var~h{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2}-.7025748{col 26}{space 2}  .077895{col 37}{space 1}   -9.02{col 46}{space 3}0.000{col 54}{space 4}-.8589556{col 67}{space 3} -.546194
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}   36995
                                                       {txt}F(  1,    50) ={res} 1207.75
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.1816
                                                       {txt}Root MSE      = {res} 10.679

{txt}{ralign 79:(Std. Err. adjusted for {res:51} clusters in date)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}InfExp_Var_ch{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_ch {c |}
{space 10}L1. {c |}{col 15}{res}{space 2}-.3905161{col 27}{space 2}  .011237{col 38}{space 1}  -34.75{col 47}{space 3}0.000{col 55}{space 4}-.4130863{col 68}{space 3}-.3679459
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}-.7124628{col 27}{space 2} .0578911{col 38}{space 1}  -12.31{col 47}{space 3}0.000{col 55}{space 4}-.8287404{col 68}{space 3}-.5961851
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}   23411
                                                       {txt}F(  3,    48) ={res}  628.19
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.2772
                                                       {txt}Root MSE      = {res}  8.945

{txt}{ralign 79:(Std. Err. adjusted for {res:49} clusters in date)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}InfExp_Var_ch{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_ch {c |}
{space 10}L1. {c |}{col 15}{res}{space 2}-.5757271{col 27}{space 2} .0144385{col 38}{space 1}  -39.87{col 47}{space 3}0.000{col 55}{space 4}-.6047576{col 68}{space 3}-.5466966
{txt}{space 10}L2. {c |}{col 15}{res}{space 2}-.3051429{col 27}{space 2} .0133962{col 38}{space 1}  -22.78{col 47}{space 3}0.000{col 55}{space 4}-.3320778{col 68}{space 3}-.2782081
{txt}{space 10}L3. {c |}{col 15}{res}{space 2}-.1265776{col 27}{space 2} .0089319{col 38}{space 1}  -14.17{col 47}{space 3}0.000{col 55}{space 4}-.1445365{col 68}{space 3}-.1086187
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}-.6412758{col 27}{space 2} .0541104{col 38}{space 1}  -11.85{col 47}{space 3}0.000{col 55}{space 4}-.7500721{col 68}{space 3}-.5324795
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/ind/ChEfficiencySCEIndQ.csv", mtitles b(%8.3f) se(%8.3f) scalars(N r2) sfmt(%8.3f %8.3f %8.3f) replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/ind/ChEfficiencySCEIndQ.csv"'})

{com}. 
. 
. 
. ** Almost works for SCE 
. 
. ***************************************************
. *** Revision Efficiency Test Using Mean Revision **
. ***************************************************
. 
. 
. ***********************************************************
. ** Create some deviation measures from population median **
. ***********************************************************
. eststo clear
{txt}
{com}. 
. 
. foreach mom in Mean{c -(}
{txt}  2{com}.   foreach var in SCE{c -(}
{txt}  3{com}.   gen `var'_dv = `var'_Mean-`var'_Mean_ct50
{txt}  4{com}.   label var `var'_dv "Deviation from median forecast"
{txt}  5{com}.   {c )-}
{txt}  6{com}. {c )-}
{txt}(8863 missing values generated)

{com}. 
. eststo clear
{txt}
{com}. 
. foreach var in SCE{c -(}
{txt}  2{com}.   foreach mom in Mean{c -(}
{txt}  3{com}.      replace InfExp_`mom'_rv =  `var'_`mom' - l10.`var'_`mom'1
{txt}  4{com}.          eststo `var'`mom'rvlv0: reg InfExp_`mom'_rv, vce(cluster date)
{txt}  5{com}.      eststo `var'`mom'rvlv1: reg InfExp_`mom'_rv l1.InfExp_`mom'_rv `var'_`mom'_ct50, vce(cluster date)
{txt}  6{com}.          *eststo `var'`mom'rvlv2: reg  InfExp_`mom'_rv l(1/2).InfExp_`mom'_rv `var'_`mom'_ct50, vce(cluster date)
.          *eststo `var'`mom'rvlv3: reg  InfExp_`mom'_rv l(1/3).InfExp_`mom'_rv `var'_`mom'_ct50, vce(cluster date)
.  {c )-}
{txt}  7{com}. {c )-}
{txt}(5970 real changes made)

Linear regression                                      Number of obs ={res}    5970
                                                       {txt}F(  0,    42) ={res}    0.00
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.0000
                                                       {txt}Root MSE      = {res} 2.8516

{txt}{ralign 78:(Std. Err. adjusted for {res:43} clusters in date)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_Mea~v{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2}-.4908221{col 26}{space 2} .0442573{col 37}{space 1}  -11.09{col 46}{space 3}0.000{col 54}{space 4} -.580137{col 67}{space 3}-.4015073
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    2299
                                                       {txt}F(  2,    41) ={res}   88.31
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0999
                                                       {txt}Root MSE      = {res} 2.4091

{txt}{ralign 80:(Std. Err. adjusted for {res:42} clusters in date)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}InfExp_Mean_rv{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Mean_rv {c |}
{space 11}L1. {c |}{col 16}{res}{space 2} .2838225{col 28}{space 2} .0221135{col 39}{space 1}   12.83{col 48}{space 3}0.000{col 56}{space 4} .2391634{col 69}{space 3} .3284816
{txt}{space 14} {c |}
{space 1}SCE_Mean_ct50 {c |}{col 16}{res}{space 2} .3562941{col 28}{space 2} .3465961{col 39}{space 1}    1.03{col 48}{space 3}0.310{col 56}{space 4}-.3436709{col 69}{space 3} 1.056259
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-1.095992{col 28}{space 2} .9653619{col 39}{space 1}   -1.14{col 48}{space 3}0.263{col 56}{space 4} -3.04558{col 69}{space 3} .8535962
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. foreach var in SCE{c -(}
{txt}  2{com}.   foreach mom in Var{c -(}
{txt}  3{com}.      replace InfExp_`mom'_rv =  `var'_`mom' - l10.`var'_`mom'1
{txt}  4{com}.          eststo `var'`mom'rvlv0: reg InfExp_`mom'_rv, vce(cluster date) 
{txt}  5{com}.      eststo `var'`mom'rvlv1: reg InfExp_`mom'_rv l1.InfExp_`mom'_rv, vce(cluster date) 
{txt}  6{com}.          *eststo `var'`mom'rvlv2: reg  InfExp_`mom'_rv l(1/2).InfExp_`mom'_rv, vce(cluster date) 
.          *eststo `var'`mom'rvlv3: reg  InfExp_`mom'_rv l(1/3).InfExp_`mom'_rv, vce(cluster date)
.  {c )-}
{txt}  7{com}. {c )-}
{txt}(6227 real changes made)

Linear regression                                      Number of obs ={res}    6227
                                                       {txt}F(  0,    42) ={res}    0.00
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.0000
                                                       {txt}Root MSE      = {res} 18.218

{txt}{ralign 78:(Std. Err. adjusted for {res:43} clusters in date)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_Var~v{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2}-5.580945{col 26}{space 2} .2117653{col 37}{space 1}  -26.35{col 46}{space 3}0.000{col 54}{space 4}-6.008305{col 67}{space 3}-5.153585
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    2388
                                                       {txt}F(  1,    41) ={res}  101.61
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.1005
                                                       {txt}Root MSE      = {res} 15.384

{txt}{ralign 79:(Std. Err. adjusted for {res:42} clusters in date)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}InfExp_Var_rv{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_rv {c |}
{space 10}L1. {c |}{col 15}{res}{space 2} .2884511{col 27}{space 2} .0286161{col 38}{space 1}   10.08{col 47}{space 3}0.000{col 55}{space 4} .2306598{col 68}{space 3} .3462425
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}-1.942685{col 27}{space 2} .2601721{col 38}{space 1}   -7.47{col 47}{space 3}0.000{col 55}{space 4}-2.468114{col 68}{space 3}-1.417257
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/ind/RVEfficiencySCEIndQ.csv", mtitles b(%8.3f) se(%8.3f) scalars(N r2) sfmt(%8.3f %8.3f %8.3f) replace
{res}{txt}(note: file /Users/Myworld/Dropbox/ExpProject/workingfolder/tables/ind/RVEfficiencySCEIndQ.csv not found)
(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/ind/RVEfficiencySCEIndQ.csv"'})

{com}. ddd
{err}unrecognized command:  ddd
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. clear

. 