{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/ExpProject/workingfolder/indSPF_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}25 Jun 2019, 12:43:27
{txt}
{com}. 
. 
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SPF/individual/InfExpSPFPointIndQ",clear 
{txt}
{com}. 
. duplicates report year quarter ID 

{p 0 4}{txt}Duplicates in terms of {res} year quarter ID{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}         {res}8195             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. merge 1:1 year quarter ID using "${c -(}folder{c )-}/SPF/individual/InfExpSPFDstIndQClean.dta"
{res}{txt}{p 0 7 2}
(note: variable
year was 
int, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
quarter was 
byte, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
ID was 
int, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           6,102
{txt}{col 9}from master{col 30}{res}           6,102{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}           2,093{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. rename _merge SPFDst_merge
{res}{txt}
{com}. table year if SPFDst_merge ==3

{txt}{hline 10}{c TT}{hline 11}
     YEAR {c |}      Freq.
{hline 10}{c +}{hline 11}
     2007 {c |}        {res}199
     {txt}2008 {c |}        {res}198
     {txt}2009 {c |}        {res}169
     {txt}2010 {c |}        {res}165
     {txt}2011 {c |}        {res}169
     {txt}2012 {c |}        {res}171
     {txt}2013 {c |}        {res}171
     {txt}2014 {c |}        {res}172
     {txt}2015 {c |}        {res}170
     {txt}2016 {c |}        {res}164
     {txt}2017 {c |}        {res}159
     {txt}2018 {c |}        {res}147
     {txt}2019 {c |}         {res}38
{txt}{hline 10}{c BT}{hline 11}

{com}. 
. merge m:1 year quarter using "${c -(}mainfolder{c )-}/OtherData/InfShocksQClean.dta",keep(match using master)
{res}{txt}{p 0 7 2}
(note: variable
month was 
float, now double to accommodate using data's values)
{p_end}
(label _merge already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           3,112
{txt}{col 9}from master{col 30}{res}           3,112{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}           5,083{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge infshocks_merge
{res}{txt}
{com}. 
. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. 
. xtset ID dateQ
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dateQ, 1968q4 to 2019q1, but with gaps
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. sort ID year quarter 
{txt}
{com}. 
. drop if ID==ID[_n-1] & INDUSTRY != INDUSTRY[_n-1]
{txt}(23 observations deleted)

{com}. 
. 
. *******************************
. **  Summary Statistics of SPF **
. *******************************
. 
. tabstat ID,s(count) by(dateQ) column(statistics)

{txt}Summary for variables: ID
{col 6}by categories of: dateQ 

{ralign 9:dateQ} {...}
{c |}         N
{hline 10}{c +}{hline 10}
{ralign 9:1968q4} {...}
{c |}{...}
 {res}       87
{txt}{ralign 9:1969q1} {...}
{c |}{...}
 {res}       65
{txt}{ralign 9:1969q2} {...}
{c |}{...}
 {res}       59
{txt}{ralign 9:1969q3} {...}
{c |}{...}
 {res}      128
{txt}{ralign 9:1969q4} {...}
{c |}{...}
 {res}       57
{txt}{ralign 9:1970q1} {...}
{c |}{...}
 {res}       60
{txt}{ralign 9:1970q2} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:1970q3} {...}
{c |}{...}
 {res}       57
{txt}{ralign 9:1970q4} {...}
{c |}{...}
 {res}      131
{txt}{ralign 9:1971q1} {...}
{c |}{...}
 {res}       56
{txt}{ralign 9:1971q2} {...}
{c |}{...}
 {res}       59
{txt}{ralign 9:1971q3} {...}
{c |}{...}
 {res}      106
{txt}{ralign 9:1971q4} {...}
{c |}{...}
 {res}       76
{txt}{ralign 9:1972q1} {...}
{c |}{...}
 {res}       66
{txt}{ralign 9:1972q2} {...}
{c |}{...}
 {res}       71
{txt}{ralign 9:1972q3} {...}
{c |}{...}
 {res}       69
{txt}{ralign 9:1972q4} {...}
{c |}{...}
 {res}       63
{txt}{ralign 9:1973q1} {...}
{c |}{...}
 {res}       68
{txt}{ralign 9:1973q2} {...}
{c |}{...}
 {res}       64
{txt}{ralign 9:1973q3} {...}
{c |}{...}
 {res}       46
{txt}{ralign 9:1973q4} {...}
{c |}{...}
 {res}       59
{txt}{ralign 9:1974q1} {...}
{c |}{...}
 {res}       63
{txt}{ralign 9:1974q2} {...}
{c |}{...}
 {res}       49
{txt}{ralign 9:1974q3} {...}
{c |}{...}
 {res}       54
{txt}{ralign 9:1974q4} {...}
{c |}{...}
 {res}       54
{txt}{ralign 9:1975q1} {...}
{c |}{...}
 {res}       46
{txt}{ralign 9:1975q2} {...}
{c |}{...}
 {res}       47
{txt}{ralign 9:1975q3} {...}
{c |}{...}
 {res}       40
{txt}{ralign 9:1975q4} {...}
{c |}{...}
 {res}       48
{txt}{ralign 9:1976q1} {...}
{c |}{...}
 {res}       48
{txt}{ralign 9:1976q2} {...}
{c |}{...}
 {res}       49
{txt}{ralign 9:1976q3} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1976q4} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1977q1} {...}
{c |}{...}
 {res}       41
{txt}{ralign 9:1977q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:1977q3} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1977q4} {...}
{c |}{...}
 {res}       45
{txt}{ralign 9:1978q1} {...}
{c |}{...}
 {res}       26
{txt}{ralign 9:1978q2} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1978q3} {...}
{c |}{...}
 {res}       27
{txt}{ralign 9:1978q4} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:1979q1} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:1979q2} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:1979q3} {...}
{c |}{...}
 {res}       38
{txt}{ralign 9:1979q4} {...}
{c |}{...}
 {res}       33
{txt}{ralign 9:1980q1} {...}
{c |}{...}
 {res}       29
{txt}{ralign 9:1980q2} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:1980q3} {...}
{c |}{...}
 {res}       24
{txt}{ralign 9:1980q4} {...}
{c |}{...}
 {res}       32
{txt}{ralign 9:1981q1} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1981q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:1981q3} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1981q4} {...}
{c |}{...}
 {res}       46
{txt}{ralign 9:1982q1} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:1982q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:1982q3} {...}
{c |}{...}
 {res}       43
{txt}{ralign 9:1982q4} {...}
{c |}{...}
 {res}       38
{txt}{ralign 9:1983q1} {...}
{c |}{...}
 {res}       38
{txt}{ralign 9:1983q2} {...}
{c |}{...}
 {res}       40
{txt}{ralign 9:1983q3} {...}
{c |}{...}
 {res}       32
{txt}{ralign 9:1983q4} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1984q1} {...}
{c |}{...}
 {res}       31
{txt}{ralign 9:1984q2} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:1984q3} {...}
{c |}{...}
 {res}       27
{txt}{ralign 9:1984q4} {...}
{c |}{...}
 {res}       31
{txt}{ralign 9:1985q1} {...}
{c |}{...}
 {res}       24
{txt}{ralign 9:1985q2} {...}
{c |}{...}
 {res}       29
{txt}{ralign 9:1985q3} {...}
{c |}{...}
 {res}       31
{txt}{ralign 9:1985q4} {...}
{c |}{...}
 {res}       25
{txt}{ralign 9:1986q1} {...}
{c |}{...}
 {res}       26
{txt}{ralign 9:1986q2} {...}
{c |}{...}
 {res}       28
{txt}{ralign 9:1986q3} {...}
{c |}{...}
 {res}       24
{txt}{ralign 9:1986q4} {...}
{c |}{...}
 {res}       24
{txt}{ralign 9:1987q1} {...}
{c |}{...}
 {res}       22
{txt}{ralign 9:1987q2} {...}
{c |}{...}
 {res}       28
{txt}{ralign 9:1987q3} {...}
{c |}{...}
 {res}       22
{txt}{ralign 9:1987q4} {...}
{c |}{...}
 {res}       20
{txt}{ralign 9:1988q1} {...}
{c |}{...}
 {res}       18
{txt}{ralign 9:1988q2} {...}
{c |}{...}
 {res}       19
{txt}{ralign 9:1988q3} {...}
{c |}{...}
 {res}       18
{txt}{ralign 9:1988q4} {...}
{c |}{...}
 {res}       15
{txt}{ralign 9:1989q1} {...}
{c |}{...}
 {res}       17
{txt}{ralign 9:1989q2} {...}
{c |}{...}
 {res}       17
{txt}{ralign 9:1989q3} {...}
{c |}{...}
 {res}       15
{txt}{ralign 9:1989q4} {...}
{c |}{...}
 {res}       17
{txt}{ralign 9:1990q1} {...}
{c |}{...}
 {res}       14
{txt}{ralign 9:1990q3} {...}
{c |}{...}
 {res}       11
{txt}{ralign 9:1990q4} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:1991q1} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:1991q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:1991q3} {...}
{c |}{...}
 {res}       33
{txt}{ralign 9:1991q4} {...}
{c |}{...}
 {res}       39
{txt}{ralign 9:1992q1} {...}
{c |}{...}
 {res}       40
{txt}{ralign 9:1992q2} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1992q3} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1992q4} {...}
{c |}{...}
 {res}       40
{txt}{ralign 9:1993q1} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:1993q2} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1993q3} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:1993q4} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:1994q1} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:1994q2} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:1994q3} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:1994q4} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:1995q1} {...}
{c |}{...}
 {res}       29
{txt}{ralign 9:1995q2} {...}
{c |}{...}
 {res}       52
{txt}{ralign 9:1995q3} {...}
{c |}{...}
 {res}       52
{txt}{ralign 9:1995q4} {...}
{c |}{...}
 {res}       47
{txt}{ralign 9:1996q1} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1996q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:1996q3} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:1996q4} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1997q1} {...}
{c |}{...}
 {res}       38
{txt}{ralign 9:1997q2} {...}
{c |}{...}
 {res}       39
{txt}{ralign 9:1997q3} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1997q4} {...}
{c |}{...}
 {res}       38
{txt}{ralign 9:1998q1} {...}
{c |}{...}
 {res}       32
{txt}{ralign 9:1998q2} {...}
{c |}{...}
 {res}       29
{txt}{ralign 9:1998q3} {...}
{c |}{...}
 {res}       32
{txt}{ralign 9:1998q4} {...}
{c |}{...}
 {res}       33
{txt}{ralign 9:1999q1} {...}
{c |}{...}
 {res}       33
{txt}{ralign 9:1999q2} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:1999q3} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:1999q4} {...}
{c |}{...}
 {res}       43
{txt}{ralign 9:2000q1} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:2000q2} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:2000q3} {...}
{c |}{...}
 {res}       32
{txt}{ralign 9:2000q4} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:2001q1} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:2001q2} {...}
{c |}{...}
 {res}       33
{txt}{ralign 9:2001q3} {...}
{c |}{...}
 {res}       33
{txt}{ralign 9:2001q4} {...}
{c |}{...}
 {res}       29
{txt}{ralign 9:2002q1} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:2002q2} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:2002q3} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:2002q4} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:2003q1} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:2003q2} {...}
{c |}{...}
 {res}       35
{txt}{ralign 9:2003q3} {...}
{c |}{...}
 {res}       30
{txt}{ralign 9:2003q4} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:2004q1} {...}
{c |}{...}
 {res}       31
{txt}{ralign 9:2004q2} {...}
{c |}{...}
 {res}       32
{txt}{ralign 9:2004q3} {...}
{c |}{...}
 {res}       29
{txt}{ralign 9:2004q4} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:2005q1} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:2005q2} {...}
{c |}{...}
 {res}       46
{txt}{ralign 9:2005q3} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:2005q4} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:2006q1} {...}
{c |}{...}
 {res}       53
{txt}{ralign 9:2006q2} {...}
{c |}{...}
 {res}       53
{txt}{ralign 9:2006q3} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:2006q4} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:2007q1} {...}
{c |}{...}
 {res}       49
{txt}{ralign 9:2007q2} {...}
{c |}{...}
 {res}       52
{txt}{ralign 9:2007q3} {...}
{c |}{...}
 {res}       49
{txt}{ralign 9:2007q4} {...}
{c |}{...}
 {res}       48
{txt}{ralign 9:2008q1} {...}
{c |}{...}
 {res}       50
{txt}{ralign 9:2008q2} {...}
{c |}{...}
 {res}       50
{txt}{ralign 9:2008q3} {...}
{c |}{...}
 {res}       47
{txt}{ralign 9:2008q4} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:2009q1} {...}
{c |}{...}
 {res}       43
{txt}{ralign 9:2009q2} {...}
{c |}{...}
 {res}       51
{txt}{ralign 9:2009q3} {...}
{c |}{...}
 {res}       34
{txt}{ralign 9:2009q4} {...}
{c |}{...}
 {res}       41
{txt}{ralign 9:2010q1} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2010q2} {...}
{c |}{...}
 {res}       44
{txt}{ralign 9:2010q3} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:2010q4} {...}
{c |}{...}
 {res}       43
{txt}{ralign 9:2011q1} {...}
{c |}{...}
 {res}       43
{txt}{ralign 9:2011q2} {...}
{c |}{...}
 {res}       44
{txt}{ralign 9:2011q3} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:2011q4} {...}
{c |}{...}
 {res}       45
{txt}{ralign 9:2012q1} {...}
{c |}{...}
 {res}       45
{txt}{ralign 9:2012q2} {...}
{c |}{...}
 {res}       39
{txt}{ralign 9:2012q3} {...}
{c |}{...}
 {res}       48
{txt}{ralign 9:2012q4} {...}
{c |}{...}
 {res}       39
{txt}{ralign 9:2013q1} {...}
{c |}{...}
 {res}       46
{txt}{ralign 9:2013q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2013q3} {...}
{c |}{...}
 {res}       41
{txt}{ralign 9:2013q4} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2014q1} {...}
{c |}{...}
 {res}       45
{txt}{ralign 9:2014q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2014q3} {...}
{c |}{...}
 {res}       43
{txt}{ralign 9:2014q4} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2015q1} {...}
{c |}{...}
 {res}       39
{txt}{ralign 9:2015q2} {...}
{c |}{...}
 {res}       44
{txt}{ralign 9:2015q3} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2015q4} {...}
{c |}{...}
 {res}       45
{txt}{ralign 9:2016q1} {...}
{c |}{...}
 {res}       40
{txt}{ralign 9:2016q2} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2016q3} {...}
{c |}{...}
 {res}       40
{txt}{ralign 9:2016q4} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2017q1} {...}
{c |}{...}
 {res}       42
{txt}{ralign 9:2017q2} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:2017q3} {...}
{c |}{...}
 {res}       39
{txt}{ralign 9:2017q4} {...}
{c |}{...}
 {res}       41
{txt}{ralign 9:2018q1} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:2018q2} {...}
{c |}{...}
 {res}       36
{txt}{ralign 9:2018q3} {...}
{c |}{...}
 {res}       38
{txt}{ralign 9:2018q4} {...}
{c |}{...}
 {res}       37
{txt}{ralign 9:2019q1} {...}
{c |}{...}
 {res}       37
{txt}{hline 10}{c +}{hline 10}
{ralign 9:Total} {...}
{c |}{...}
 {res}     8171
{txt}{hline 10}{c BT}{hline 10}

{com}. 
. ******************************
. *** Computing some measures **
. ******************************
. 
. gen SPFCPI_FE = CPI1y - Inf1y_CPIAU
{txt}(3475 missing values generated)

{com}. label var SPFCPI_FE "1-yr-ahead forecast error(SPF CPI)"
{txt}
{com}. gen SPFCCPI_FE = CORECPI1y - Inf1y_CPICore
{txt}(6367 missing values generated)

{com}. label var SPFCPI_FE "1-yr-ahead forecast error(SPF core CPI)"
{txt}
{com}. gen SPFPCE_FE = PCE1y - Inf1y_PCE
{txt}(6493 missing values generated)

{com}. label var SPFPCE_FE "1-yr-ahead forecast error(SPF PCE)"
{txt}
{com}. 
. 
. gen SPFCPI_FE0 = CPI1y - Inf1y_CPIAU
{txt}(3475 missing values generated)

{com}. label var SPFCPI_FE0 "1-yr nowcasting error(SPF CPI)"
{txt}
{com}. gen SPFCCPI_FE0 = CORECPI1y - Inf1y_CPICore
{txt}(6367 missing values generated)

{com}. label var SPFCPI_FE0 "1-yr nowcasting error(SPF core CPI)"
{txt}
{com}. gen SPFPCE_FE0 = PCE1y - Inf1y_PCE
{txt}(6493 missing values generated)

{com}. label var SPFPCE_FE "1-yr nowcasting error (SPF PCE)"
{txt}
{com}. 
. 
. *****************************************
. ****  Renaming so that more consistent **
. *****************************************
. 
. 
. rename CPI1y SPFCPI_Mean
{res}{txt}
{com}. rename PCE1y SPFPCE_Mean
{res}{txt}
{com}. rename COREPCE1y SPFCPCE_Mean
{res}{txt}
{com}. rename CORECPI1y SPFCCPI_Mean
{res}{txt}
{com}. 
. rename PRCCPIMean0 SPFCPI_Mean0
{res}{txt}
{com}. rename PRCPCEMean0 SPFPCE_Mean0
{res}{txt}
{com}. 
. rename PRCPCEVar1 SPFPCE_Var
{res}{txt}
{com}. rename PRCCPIVar1 SPFCPI_Var
{res}{txt}
{com}. rename PRCPCEVar0 SPFPCE_Var0
{res}{txt}
{com}. rename PRCCPIVar0 SPFCPI_Var0
{res}{txt}
{com}. 
. rename SPFCPI_FE SPFCPI_FE
{res}{txt}  (all {it:newnames}=={it:oldnames})

{com}. rename SPFPCE_FE SPFPCE_FE
{res}{txt}  (all {it:newnames}=={it:oldnames})

{com}. 
. 
. rename CPI_ct50 SPFCPI_ct50
{res}{txt}
{com}. rename PCE_ct50 SPFPCE_ct50
{res}{txt}
{com}. 
. *******************************
. **  Generate Variables       **
. *******************************
. 
. gen InfExp_Mean = .
{txt}(8172 missing values generated)

{com}. gen InfExp_Var = .
{txt}(8172 missing values generated)

{com}. gen InfExp_FE = .
{txt}(8172 missing values generated)

{com}. *gen InfExp_Disg = . 
. 
. gen InfExp_Mean_ch = .
{txt}(8172 missing values generated)

{com}. gen InfExp_Var_ch = .
{txt}(8172 missing values generated)

{com}. gen InfExp_FE_ch = .
{txt}(8172 missing values generated)

{com}. *gen InfExp_Disg_ch = . 
. 
. gen InfExp_Mean0 = .
{txt}(8172 missing values generated)

{com}. gen InfExp_Var0 = .
{txt}(8172 missing values generated)

{com}. 
. 
. gen InfExp_Mean_rv = .
{txt}(8172 missing values generated)

{com}. gen InfExp_Var_rv = .
{txt}(8172 missing values generated)

{com}. 
. 
. ************************************************
. ** Auto Regression of the Individual Moments  **
. ************************************************
. 
. eststo clear
{txt}
{com}. 
. foreach mom in Mean FE Var{c -(}
{txt}  2{com}.    foreach var in SPFCPI SPFPCE{c -(}
{txt}  3{com}.     replace InfExp_`mom' = `var'_`mom'
{txt}  4{com}.         xtset ID dateQ
{txt}  5{com}.     replace InfExp_`mom'_ch = InfExp_`mom'-l1.InfExp_`mom'
{txt}  6{com}. 
.         eststo `var'_`mom'lvl: reg InfExp_`mom' l(3/5).InfExp_`mom', vce(cluster dateQ)
{txt}  7{com}.     eststo `var'_`mom'diff: reg InfExp_`mom'_ch l(3/5).InfExp_`mom'_ch, vce(cluster dateQ)
{txt}  8{com}.   {c )-}
{txt}  9{com}. {c )-}
{txt}(5056 real changes made)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dateQ, 1968q4 to 2019q1, but with gaps
{txt}{col 17}delta:  {res}1 quarter
{txt}(3897 real changes made)

Linear regression                                      Number of obs ={res}    2501
                                                       {txt}F(  3,   141) ={res}  294.01
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.6480
                                                       {txt}Root MSE      = {res}   .584

{txt}{ralign 78:(Std. Err. adjusted for {res:142} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} InfExp_Mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Mean {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .4519905{col 26}{space 2} .0387915{col 37}{space 1}   11.65{col 46}{space 3}0.000{col 54}{space 4} .3753024{col 67}{space 3} .5286786
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}  .096043{col 26}{space 2} .0602878{col 37}{space 1}    1.59{col 46}{space 3}0.113{col 54}{space 4}-.0231419{col 67}{space 3} .2152278
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .2120063{col 26}{space 2} .0460068{col 37}{space 1}    4.61{col 46}{space 3}0.000{col 54}{space 4}  .121054{col 67}{space 3} .3029586
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .5614722{col 26}{space 2} .0710101{col 37}{space 1}    7.91{col 46}{space 3}0.000{col 54}{space 4} .4210902{col 67}{space 3} .7018543
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    1898
                                                       {txt}F(  3,   138) ={res}    0.30
                                                       {txt}Prob > F      = {res} 0.8239
                                                       {txt}R-squared     = {res} 0.0017
                                                       {txt}Root MSE      = {res} .50753

{txt}{ralign 80:(Std. Err. adjusted for {res:139} clusters in dateQ)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}InfExp_Mean_ch{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Mean_ch {c |}
{space 11}L3. {c |}{col 16}{res}{space 2} -.013545{col 28}{space 2} .0377731{col 39}{space 1}   -0.36{col 48}{space 3}0.720{col 56}{space 4} -.088234{col 69}{space 3} .0611439
{txt}{space 11}L4. {c |}{col 16}{res}{space 2}-.0308508{col 28}{space 2}  .047938{col 39}{space 1}   -0.64{col 48}{space 3}0.521{col 56}{space 4}-.1256388{col 69}{space 3} .0639371
{txt}{space 11}L5. {c |}{col 16}{res}{space 2} .0143002{col 28}{space 2} .0318034{col 39}{space 1}    0.45{col 48}{space 3}0.654{col 56}{space 4}-.0485849{col 69}{space 3} .0771852
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2} -.023912{col 28}{space 2} .0178672{col 39}{space 1}   -1.34{col 48}{space 3}0.183{col 56}{space 4}-.0592408{col 69}{space 3} .0114168
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(5049 real changes made, 3352 to missing)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dateQ, 1968q4 to 2019q1, but with gaps
{txt}{col 17}delta:  {res}1 quarter
{txt}(3881 real changes made, 2504 to missing)

Linear regression                                      Number of obs ={res}     939
                                                       {txt}F(  3,    43) ={res}   32.45
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.3460
                                                       {txt}Root MSE      = {res} .46661

{txt}{ralign 78:(Std. Err. adjusted for {res:44} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} InfExp_Mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Mean {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .3854789{col 26}{space 2} .0705583{col 37}{space 1}    5.46{col 46}{space 3}0.000{col 54}{space 4} .2431845{col 67}{space 3} .5277732
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .1210385{col 26}{space 2} .0525281{col 37}{space 1}    2.30{col 46}{space 3}0.026{col 54}{space 4} .0151054{col 67}{space 3} .2269715
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .1043465{col 26}{space 2} .0477848{col 37}{space 1}    2.18{col 46}{space 3}0.034{col 54}{space 4} .0079792{col 67}{space 3} .2007137
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .6967154{col 26}{space 2} .1019343{col 37}{space 1}    6.83{col 46}{space 3}0.000{col 54}{space 4} .4911454{col 67}{space 3} .9022855
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     751
                                                       {txt}F(  3,    42) ={res}    2.47
                                                       {txt}Prob > F      = {res} 0.0750
                                                       {txt}R-squared     = {res} 0.0110
                                                       {txt}Root MSE      = {res} .41284

{txt}{ralign 80:(Std. Err. adjusted for {res:43} clusters in dateQ)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}InfExp_Mean_ch{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Mean_ch {c |}
{space 11}L3. {c |}{col 16}{res}{space 2}-.0172092{col 28}{space 2} .0528981{col 39}{space 1}   -0.33{col 48}{space 3}0.747{col 56}{space 4}-.1239619{col 69}{space 3} .0895435
{txt}{space 11}L4. {c |}{col 16}{res}{space 2}-.0239648{col 28}{space 2} .0541233{col 39}{space 1}   -0.44{col 48}{space 3}0.660{col 56}{space 4}-.1331901{col 69}{space 3} .0852605
{txt}{space 11}L5. {c |}{col 16}{res}{space 2}-.1085013{col 28}{space 2} .0408564{col 39}{space 1}   -2.66{col 48}{space 3}0.011{col 56}{space 4}-.1909529{col 69}{space 3}-.0260497
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2}-.0197322{col 28}{space 2} .0243047{col 39}{space 1}   -0.81{col 48}{space 3}0.421{col 56}{space 4} -.068781{col 69}{space 3} .0293166
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(4697 real changes made)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dateQ, 1968q4 to 2019q1, but with gaps
{txt}{col 17}delta:  {res}1 quarter
{txt}(3676 real changes made)

Linear regression                                      Number of obs ={res}    2377
                                                       {txt}F(  3,   130) ={res}    4.60
                                                       {txt}Prob > F      = {res} 0.0043
                                                       {txt}R-squared     = {res} 0.1163
                                                       {txt}Root MSE      = {res}  1.104

{txt}{ralign 78:(Std. Err. adjusted for {res:131} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .4174231{col 26}{space 2}  .137421{col 37}{space 1}    3.04{col 46}{space 3}0.003{col 54}{space 4} .1455522{col 67}{space 3}  .689294
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.3037186{col 26}{space 2} .1182731{col 37}{space 1}   -2.57{col 46}{space 3}0.011{col 54}{space 4}-.5377078{col 67}{space 3}-.0697294
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .1380812{col 26}{space 2} .0812628{col 37}{space 1}    1.70{col 46}{space 3}0.092{col 54}{space 4}-.0226876{col 67}{space 3}   .29885
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1211277{col 26}{space 2} .1058514{col 37}{space 1}    1.14{col 46}{space 3}0.255{col 54}{space 4}-.0882866{col 67}{space 3}  .330542
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    1811
                                                       {txt}F(  3,   127) ={res}    3.03
                                                       {txt}Prob > F      = {res} 0.0319
                                                       {txt}R-squared     = {res} 0.1604
                                                       {txt}Root MSE      = {res} .88003

{txt}{ralign 78:(Std. Err. adjusted for {res:128} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_FE_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_FE_ch {c |}
{space 9}L3. {c |}{col 14}{res}{space 2}   .02618{col 26}{space 2}   .05543{col 37}{space 1}    0.47{col 46}{space 3}0.638{col 54}{space 4} -.083506{col 67}{space 3} .1358659
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.3774225{col 26}{space 2} .1605733{col 37}{space 1}   -2.35{col 46}{space 3}0.020{col 54}{space 4}-.6951681{col 67}{space 3}-.0596768
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}  .030165{col 26}{space 2} .0745361{col 37}{space 1}    0.40{col 46}{space 3}0.686{col 54}{space 4}-.1173286{col 67}{space 3} .1776585
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0147453{col 26}{space 2} .0759671{col 37}{space 1}    0.19{col 46}{space 3}0.846{col 54}{space 4}-.1355799{col 67}{space 3} .1650705
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(4706 real changes made, 3027 to missing)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dateQ, 1968q4 to 2019q1, but with gaps
{txt}{col 17}delta:  {res}1 quarter
{txt}(3685 real changes made, 2308 to missing)

Linear regression                                      Number of obs ={res}     914
                                                       {txt}F(  3,    42) ={res}    2.01
                                                       {txt}Prob > F      = {res} 0.1270
                                                       {txt}R-squared     = {res} 0.0840
                                                       {txt}Root MSE      = {res} .98575

{txt}{ralign 78:(Std. Err. adjusted for {res:43} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .3994771{col 26}{space 2} .1878559{col 37}{space 1}    2.13{col 46}{space 3}0.039{col 54}{space 4} .0203686{col 67}{space 3} .7785857
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.3735824{col 26}{space 2} .1754272{col 37}{space 1}   -2.13{col 46}{space 3}0.039{col 54}{space 4}-.7276088{col 67}{space 3} -.019556
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .1758436{col 26}{space 2} .1416104{col 37}{space 1}    1.24{col 46}{space 3}0.221{col 54}{space 4}-.1099377{col 67}{space 3} .4616249
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2623532{col 26}{space 2} .1519329{col 37}{space 1}    1.73{col 46}{space 3}0.092{col 54}{space 4}-.0442599{col 67}{space 3} .5689662
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     734
                                                       {txt}F(  3,    41) ={res}    1.35
                                                       {txt}Prob > F      = {res} 0.2725
                                                       {txt}R-squared     = {res} 0.1441
                                                       {txt}Root MSE      = {res} .70454

{txt}{ralign 78:(Std. Err. adjusted for {res:42} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_FE_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_FE_ch {c |}
{space 9}L3. {c |}{col 14}{res}{space 2}-.0722702{col 26}{space 2} .0505269{col 37}{space 1}   -1.43{col 46}{space 3}0.160{col 54}{space 4}-.1743113{col 67}{space 3} .0297709
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.3759278{col 26}{space 2} .2103633{col 37}{space 1}   -1.79{col 46}{space 3}0.081{col 54}{space 4}-.8007652{col 67}{space 3} .0489096
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0121895{col 26}{space 2}  .073111{col 37}{space 1}   -0.17{col 46}{space 3}0.868{col 54}{space 4}-.1598402{col 67}{space 3} .1354613
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0459795{col 26}{space 2}  .083941{col 37}{space 1}    0.55{col 46}{space 3}0.587{col 54}{space 4}-.1235428{col 67}{space 3} .2155018
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(1573 real changes made)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dateQ, 1968q4 to 2019q1, but with gaps
{txt}{col 17}delta:  {res}1 quarter
{txt}(1202 real changes made)

Linear regression                                      Number of obs ={res}     691
                                                       {txt}F(  3,    43) ={res}   26.51
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.3499
                                                       {txt}Root MSE      = {res} .14044

{txt}{ralign 78:(Std. Err. adjusted for {res:44} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  InfExp_Var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}InfExp_Var {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .1781005{col 26}{space 2}  .148698{col 37}{space 1}    1.20{col 46}{space 3}0.238{col 54}{space 4}-.1217777{col 67}{space 3} .4779787
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}   .20126{col 26}{space 2} .1228116{col 37}{space 1}    1.64{col 46}{space 3}0.109{col 54}{space 4}-.0464132{col 67}{space 3} .4489332
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .3060968{col 26}{space 2} .1067157{col 37}{space 1}    2.87{col 46}{space 3}0.006{col 54}{space 4}  .090884{col 67}{space 3} .5213096
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0233525{col 26}{space 2} .0044409{col 37}{space 1}    5.26{col 46}{space 3}0.000{col 54}{space 4} .0143966{col 67}{space 3} .0323084
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     494
                                                       {txt}F(  3,    42) ={res}    0.49
                                                       {txt}Prob > F      = {res} 0.6904
                                                       {txt}R-squared     = {res} 0.0311
                                                       {txt}Root MSE      = {res} .13133

{txt}{ralign 79:(Std. Err. adjusted for {res:43} clusters in dateQ)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}InfExp_Var_ch{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_ch {c |}
{space 10}L3. {c |}{col 15}{res}{space 2}-.1648488{col 27}{space 2} .1530778{col 38}{space 1}   -1.08{col 47}{space 3}0.288{col 55}{space 4}-.4737723{col 68}{space 3} .1440747
{txt}{space 10}L4. {c |}{col 15}{res}{space 2}-.1978427{col 27}{space 2}  .248283{col 38}{space 1}   -0.80{col 47}{space 3}0.430{col 55}{space 4} -.698898{col 68}{space 3} .3032127
{txt}{space 10}L5. {c |}{col 15}{res}{space 2}-.1407546{col 27}{space 2} .1327957{col 38}{space 1}   -1.06{col 47}{space 3}0.295{col 55}{space 4}-.4087471{col 68}{space 3} .1272379
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .0009278{col 27}{space 2} .0046504{col 38}{space 1}    0.20{col 47}{space 3}0.843{col 55}{space 4}-.0084571{col 68}{space 3} .0103128
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(1341 real changes made, 268 to missing)
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dateQ, 1968q4 to 2019q1, but with gaps
{txt}{col 17}delta:  {res}1 quarter
{txt}(1082 real changes made, 256 to missing)

Linear regression                                      Number of obs ={res}     576
                                                       {txt}F(  3,    43) ={res}  123.40
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.6856
                                                       {txt}Root MSE      = {res} .10232

{txt}{ralign 78:(Std. Err. adjusted for {res:44} clusters in dateQ)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  InfExp_Var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}InfExp_Var {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .2558945{col 26}{space 2} .1371695{col 37}{space 1}    1.87{col 46}{space 3}0.069{col 54}{space 4}-.0207341{col 67}{space 3} .5325231
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .6065756{col 26}{space 2} .1337586{col 37}{space 1}    4.53{col 46}{space 3}0.000{col 54}{space 4} .3368258{col 67}{space 3} .8763255
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0270402{col 26}{space 2} .1017917{col 37}{space 1}    0.27{col 46}{space 3}0.792{col 54}{space 4}-.1782424{col 67}{space 3} .2323227
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0116681{col 26}{space 2} .0033662{col 37}{space 1}    3.47{col 46}{space 3}0.001{col 54}{space 4} .0048794{col 67}{space 3} .0184567
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     384
                                                       {txt}F(  3,    42) ={res}    3.67
                                                       {txt}Prob > F      = {res} 0.0196
                                                       {txt}R-squared     = {res} 0.3731
                                                       {txt}Root MSE      = {res} .08853

{txt}{ralign 79:(Std. Err. adjusted for {res:43} clusters in dateQ)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}InfExp_Var_ch{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_ch {c |}
{space 10}L3. {c |}{col 15}{res}{space 2}-.0000339{col 27}{space 2} .1700219{col 38}{space 1}   -0.00{col 47}{space 3}1.000{col 55}{space 4}-.3431519{col 68}{space 3} .3430841
{txt}{space 10}L4. {c |}{col 15}{res}{space 2} .4562002{col 27}{space 2} .2046255{col 38}{space 1}    2.23{col 47}{space 3}0.031{col 55}{space 4} .0432493{col 68}{space 3} .8691512
{txt}{space 10}L5. {c |}{col 15}{res}{space 2}-.1782493{col 27}{space 2} .1760354{col 38}{space 1}   -1.01{col 47}{space 3}0.317{col 55}{space 4}-.5335032{col 68}{space 3} .1770046
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .0057971{col 27}{space 2} .0044396{col 38}{space 1}    1.31{col 47}{space 3}0.199{col 55}{space 4}-.0031625{col 68}{space 3} .0147566
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. esttab using "${c -(}sum_table_folder{c )-}/ind/autoregSPFIndQ.csv", mtitles se  r2 replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/ind/autoregSPFIndQ.csv"'})

{com}. eststo clear
{txt}
{com}. 
. 
. *******************************
. *** Unbiasedness Test        **
. *******************************
. eststo clear
{txt}
{com}. 
. foreach mom in FE{c -(}
{txt}  2{com}.    foreach var in SPFCPI SPFPCE{c -(}
{txt}  3{com}.       ttest `var'_`mom'=0
{txt}  4{com}. {c )-}
{txt}  5{com}. {c )-}

{txt}One-sample t test
{hline 9}{c TT}{hline 68}
Variable{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. Err.{col 47}Std. Dev.{col 59}[95% Conf. Interval]
{hline 9}{c +}{hline 68}
SPFCPI~E {c |}{res}{col 12}   4697{col 22} .1216707{col 34} .0171015{col 46} 1.172043{col 58} .0881438{col 70} .1551976
{txt}{hline 9}{c BT}{hline 68}
    mean = mean({res}SPFCPI_FE{txt})                                        t = {res}  7.1146
{txt}Ho: mean = {res}0                                     {txt}degrees of freedom = {res}    4696

    {txt}Ha: mean < {res}0                 {txt}Ha: mean != {res}0                 {txt}Ha: mean > {res}0
 {txt}Pr(T < t) = {res}1.0000         {txt}Pr(|T| > |t|) = {res}0.0000          {txt}Pr(T > t) = {res}0.0000

{txt}One-sample t test
{hline 9}{c TT}{hline 68}
Variable{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. Err.{col 47}Std. Dev.{col 59}[95% Conf. Interval]
{hline 9}{c +}{hline 68}
SPFPCE~E {c |}{res}{col 12}   1679{col 22} .2107691{col 34} .0260663{col 46} 1.068084{col 58} .1596431{col 70}  .261895
{txt}{hline 9}{c BT}{hline 68}
    mean = mean({res}SPFPCE_FE{txt})                                        t = {res}  8.0859
{txt}Ho: mean = {res}0                                     {txt}degrees of freedom = {res}    1678

    {txt}Ha: mean < {res}0                 {txt}Ha: mean != {res}0                 {txt}Ha: mean > {res}0
 {txt}Pr(T < t) = {res}1.0000         {txt}Pr(|T| > |t|) = {res}0.0000          {txt}Pr(T > t) = {res}0.0000
{txt}
{com}. 
. **********************************************
. *** Revision Efficiency Test Using FE       **
. **********************************************
. 
. eststo clear
{txt}
{com}. 
. foreach mom in FE{c -(}
{txt}  2{com}.    foreach var in SPFCPI SPFPCE{c -(}
{txt}  3{com}.    replace InfExp_Mean = `var'_Mean
{txt}  4{com}.    replace InfExp_`mom' = `var'_`mom'
{txt}  5{com}.    eststo `var'_`mom'_bias: reg InfExp_`mom',robust 
{txt}  6{com}.    eststo `var'_`mom'_lag4: reg  InfExp_`mom' l(4).InfExp_Mean, robust
{txt}  7{com}.    eststo `var'_`mom'_arlag4: reg InfExp_`mom' l(4).InfExp_`mom',robust
{txt}  8{com}.    eststo `var'_`mom'_arlag13: reg  InfExp_`mom' l(1/3).InfExp_`mom', robust
{txt}  9{com}. 
.  {c )-}
{txt} 10{com}. {c )-}
{txt}(5049 real changes made, 9 to missing)
(4706 real changes made, 9 to missing)

Linear regression                                      Number of obs ={res}    4697
                                                       {txt}F(  0,  4696) ={res}    0.00
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.0000
                                                       {txt}Root MSE      = {res}  1.172

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .1216707{col 26}{space 2} .0171015{col 37}{space 1}    7.11{col 46}{space 3}0.000{col 54}{space 4} .0881438{col 67}{space 3} .1551976
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    3429
                                                       {txt}F(  1,  3427) ={res}  229.77
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0721
                                                       {txt}Root MSE      = {res} 1.1244

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Mean {c |}
{space 9}L4. {c |}{col 14}{res}{space 2} .3074714{col 26}{space 2} .0202843{col 37}{space 1}   15.16{col 46}{space 3}0.000{col 54}{space 4} .2677009{col 67}{space 3} .3472419
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} -.654955{col 26}{space 2} .0601705{col 37}{space 1}  -10.88{col 46}{space 3}0.000{col 54}{space 4}-.7729286{col 67}{space 3}-.5369813
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    3356
                                                       {txt}F(  1,  3354) ={res}   13.66
                                                       {txt}Prob > F      = {res} 0.0002
                                                       {txt}R-squared     = {res} 0.0059
                                                       {txt}Root MSE      = {res} 1.1621

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L4. {c |}{col 14}{res}{space 2}  .075573{col 26}{space 2} .0204453{col 37}{space 1}    3.70{col 46}{space 3}0.000{col 54}{space 4} .0354864{col 67}{space 3} .1156596
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1450244{col 26}{space 2} .0209541{col 37}{space 1}    6.92{col 46}{space 3}0.000{col 54}{space 4} .1039403{col 67}{space 3} .1861086
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    2536
                                                       {txt}F(  3,  2532) ={res}  253.81
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4386
                                                       {txt}Root MSE      = {res} .87987

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .6572426{col 26}{space 2} .0253254{col 37}{space 1}   25.95{col 46}{space 3}0.000{col 54}{space 4} .6075821{col 67}{space 3} .7069032
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0281502{col 26}{space 2} .0274721{col 37}{space 1}    1.02{col 46}{space 3}0.306{col 54}{space 4}  -.02572{col 67}{space 3} .0820203
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0244041{col 26}{space 2} .0247193{col 37}{space 1}   -0.99{col 46}{space 3}0.324{col 54}{space 4}-.0728762{col 67}{space 3}  .024068
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0625918{col 26}{space 2} .0186827{col 37}{space 1}    3.35{col 46}{space 3}0.001{col 54}{space 4} .0259568{col 67}{space 3} .0992267
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(5049 real changes made, 3352 to missing)
(4706 real changes made, 3027 to missing)

Linear regression                                      Number of obs ={res}    1679
                                                       {txt}F(  0,  1678) ={res}    0.00
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.0000
                                                       {txt}Root MSE      = {res} 1.0681

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .2107691{col 26}{space 2} .0260663{col 37}{space 1}    8.09{col 46}{space 3}0.000{col 54}{space 4} .1596431{col 67}{space 3}  .261895
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    1208
                                                       {txt}F(  1,  1206) ={res}   90.85
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.1185
                                                       {txt}Root MSE      = {res} 1.0012

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Mean {c |}
{space 9}L4. {c |}{col 14}{res}{space 2} .5857937{col 26}{space 2} .0614598{col 37}{space 1}    9.53{col 46}{space 3}0.000{col 54}{space 4} .4652137{col 67}{space 3} .7063738
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.7773054{col 26}{space 2} .1160541{col 37}{space 1}   -6.70{col 46}{space 3}0.000{col 54}{space 4}-1.004996{col 67}{space 3}-.5496151
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    1208
                                                       {txt}F(  1,  1206) ={res}    2.10
                                                       {txt}Prob > F      = {res} 0.1475
                                                       {txt}R-squared     = {res} 0.0026
                                                       {txt}Root MSE      = {res} 1.0649

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L4. {c |}{col 14}{res}{space 2} .0503489{col 26}{space 2} .0347391{col 37}{space 1}    1.45{col 46}{space 3}0.148{col 54}{space 4} -.017807{col 67}{space 3} .1185047
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2753429{col 26}{space 2} .0354253{col 37}{space 1}    7.77{col 46}{space 3}0.000{col 54}{space 4} .2058409{col 67}{space 3} .3448448
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    1004
                                                       {txt}F(  3,  1000) ={res}  213.91
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.5522
                                                       {txt}Root MSE      = {res} .70488

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .8342042{col 26}{space 2} .0372759{col 37}{space 1}   22.38{col 46}{space 3}0.000{col 54}{space 4} .7610563{col 67}{space 3} .9073521
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0858135{col 26}{space 2} .0482513{col 37}{space 1}   -1.78{col 46}{space 3}0.076{col 54}{space 4} -.180499{col 67}{space 3} .0088719
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0555186{col 26}{space 2} .0379728{col 37}{space 1}   -1.46{col 46}{space 3}0.144{col 54}{space 4}-.1300342{col 67}{space 3}  .018997
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1134369{col 26}{space 2} .0262168{col 37}{space 1}    4.33{col 46}{space 3}0.000{col 54}{space 4} .0619907{col 67}{space 3} .1648832
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. esttab using "${c -(}sum_table_folder{c )-}/ind/FEEfficiencySPFIndQ.csv", mtitles se(%8.3f) scalars(N r2) replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/ind/FEEfficiencySPFIndQ.csv"'})

{com}. 
. ***************************************************
. *** Revision Efficiency Test Using Mean Revision **
. ***************************************************
. 
. 
. ***********************************************************
. ** Create some deviation measures from population median **
. ***********************************************************
. eststo clear
{txt}
{com}. 
. foreach mom in Mean{c -(}
{txt}  2{com}.   foreach var in SPFCPI SPFPCE{c -(}
{txt}  3{com}.   gen `var'_dv = `var'_Mean-`var'_ct50
{txt}  4{com}.   label var `var'_dv "Deviation from median forecast"
{txt}  5{com}.   {c )-}
{txt}  6{com}. {c )-}
{txt}(3116 missing values generated)
(6459 missing values generated)

{com}. 
. eststo clear
{txt}
{com}. 
. foreach var in SPFCPI SPFPCE{c -(}
{txt}  2{com}.   foreach mom in Mean{c -(}
{txt}  3{com}.      replace InfExp_`mom'_rv =  `var'_`mom'0 - l1.`var'_`mom'
{txt}  4{com}.          eststo `var'`mom'rvlv0: reg InfExp_`mom'_rv, vce(cluster date)
{txt}  5{com}.      eststo `var'`mom'rvlv1: reg InfExp_`mom'_rv l1.InfExp_`mom'_rv `var'_ct50, vce(cluster date)
{txt}  6{com}.          eststo `var'`mom'rvlv2: reg  InfExp_`mom'_rv l(1/2).InfExp_`mom'_rv `var'_ct50, vce(cluster date)
{txt}  7{com}.          eststo `var'`mom'rvlv3: reg  InfExp_`mom'_rv l(1/3).InfExp_`mom'_rv `var'_ct50, vce(cluster date)
{txt}  8{com}.  {c )-}
{txt}  9{com}. {c )-}
{txt}(1337 real changes made)

Linear regression                                      Number of obs ={res}    1337
                                                       {txt}F(  0,    48) ={res}    0.00
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.0000
                                                       {txt}Root MSE      = {res} .86308

{txt}{ralign 78:(Std. Err. adjusted for {res:49} clusters in date)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_Mea~v{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.256674{col 26}{space 2} .0445274{col 37}{space 1}  -28.22{col 46}{space 3}0.000{col 54}{space 4}-1.346203{col 67}{space 3}-1.167146
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}    1045
                                                       {txt}F(  2,    47) ={res}  250.52
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.3349
                                                       {txt}Root MSE      = {res}  .6979

{txt}{ralign 80:(Std. Err. adjusted for {res:48} clusters in date)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}InfExp_Mean_rv{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Mean_rv {c |}
{space 11}L1. {c |}{col 16}{res}{space 2}   .53873{col 28}{space 2} .0305298{col 39}{space 1}   17.65{col 48}{space 3}0.000{col 56}{space 4}  .477312{col 69}{space 3} .6001481
{txt}{space 14} {c |}
{space 3}SPFCPI_ct50 {c |}{col 16}{res}{space 2}-.4441147{col 28}{space 2} .1047657{col 39}{space 1}   -4.24{col 48}{space 3}0.000{col 56}{space 4}-.6548761{col 69}{space 3}-.2333532
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .3288634{col 28}{space 2} .1907303{col 39}{space 1}    1.72{col 48}{space 3}0.091{col 56}{space 4}-.0548365{col 69}{space 3} .7125632
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     822
                                                       {txt}F(  3,    46) ={res}  130.27
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.3551
                                                       {txt}Root MSE      = {res} .69214

{txt}{ralign 80:(Std. Err. adjusted for {res:47} clusters in date)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}InfExp_Mean_rv{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Mean_rv {c |}
{space 11}L1. {c |}{col 16}{res}{space 2} .4182359{col 28}{space 2}  .042999{col 39}{space 1}    9.73{col 48}{space 3}0.000{col 56}{space 4} .3316835{col 69}{space 3} .5047883
{txt}{space 11}L2. {c |}{col 16}{res}{space 2} .2177217{col 28}{space 2} .0396093{col 39}{space 1}    5.50{col 48}{space 3}0.000{col 56}{space 4} .1379923{col 69}{space 3} .2974511
{txt}{space 14} {c |}
{space 3}SPFCPI_ct50 {c |}{col 16}{res}{space 2}-.3911071{col 28}{space 2} .1236701{col 39}{space 1}   -3.16{col 48}{space 3}0.003{col 56}{space 4}-.6400421{col 69}{space 3}-.1421722
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .3509712{col 28}{space 2} .2372332{col 39}{space 1}    1.48{col 48}{space 3}0.146{col 56}{space 4}-.1265544{col 69}{space 3} .8284969
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     652
                                                       {txt}F(  4,    45) ={res}   82.35
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.3721
                                                       {txt}Root MSE      = {res}  .6886

{txt}{ralign 80:(Std. Err. adjusted for {res:46} clusters in date)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}InfExp_Mean_rv{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Mean_rv {c |}
{space 11}L1. {c |}{col 16}{res}{space 2} .3867924{col 28}{space 2} .0522712{col 39}{space 1}    7.40{col 48}{space 3}0.000{col 56}{space 4} .2815127{col 69}{space 3}  .492072
{txt}{space 11}L2. {c |}{col 16}{res}{space 2} .1656606{col 28}{space 2} .0534033{col 39}{space 1}    3.10{col 48}{space 3}0.003{col 56}{space 4} .0581009{col 69}{space 3} .2732204
{txt}{space 11}L3. {c |}{col 16}{res}{space 2} .1338223{col 28}{space 2} .0483538{col 39}{space 1}    2.77{col 48}{space 3}0.008{col 56}{space 4} .0364326{col 69}{space 3} .2312119
{txt}{space 14} {c |}
{space 3}SPFCPI_ct50 {c |}{col 16}{res}{space 2}-.4535953{col 28}{space 2} .1380975{col 39}{space 1}   -3.28{col 48}{space 3}0.002{col 56}{space 4} -.731738{col 69}{space 3}-.1754526
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .5455621{col 28}{space 2} .2692317{col 39}{space 1}    2.03{col 48}{space 3}0.049{col 56}{space 4} .0033017{col 69}{space 3} 1.087822
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(1417 real changes made, 308 to missing)

Linear regression                                      Number of obs ={res}    1111
                                                       {txt}F(  0,    47) ={res}    0.00
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.0000
                                                       {txt}Root MSE      = {res} .79597

{txt}{ralign 78:(Std. Err. adjusted for {res:48} clusters in date)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_Mea~v{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.095444{col 26}{space 2} .0390148{col 37}{space 1}  -28.08{col 46}{space 3}0.000{col 54}{space 4}-1.173932{col 67}{space 3}-1.016957
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     867
                                                       {txt}F(  2,    46) ={res}  202.00
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4085
                                                       {txt}Root MSE      = {res} .60309

{txt}{ralign 80:(Std. Err. adjusted for {res:47} clusters in date)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}InfExp_Mean_rv{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Mean_rv {c |}
{space 11}L1. {c |}{col 16}{res}{space 2} .6064541{col 28}{space 2} .0338533{col 39}{space 1}   17.91{col 48}{space 3}0.000{col 56}{space 4} .5383109{col 69}{space 3} .6745974
{txt}{space 14} {c |}
{space 3}SPFPCE_ct50 {c |}{col 16}{res}{space 2}-.4320311{col 28}{space 2} .1093116{col 39}{space 1}   -3.95{col 48}{space 3}0.000{col 56}{space 4} -.652064{col 69}{space 3}-.2119983
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .3645596{col 28}{space 2} .1875847{col 39}{space 1}    1.94{col 48}{space 3}0.058{col 56}{space 4}-.0130288{col 69}{space 3} .7421481
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     683
                                                       {txt}F(  3,    45) ={res}  150.12
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4435
                                                       {txt}Root MSE      = {res} .57627

{txt}{ralign 80:(Std. Err. adjusted for {res:46} clusters in date)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}InfExp_Mean_rv{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Mean_rv {c |}
{space 11}L1. {c |}{col 16}{res}{space 2} .4348013{col 28}{space 2} .0421754{col 39}{space 1}   10.31{col 48}{space 3}0.000{col 56}{space 4} .3498558{col 69}{space 3} .5197469
{txt}{space 11}L2. {c |}{col 16}{res}{space 2} .2608536{col 28}{space 2} .0465215{col 39}{space 1}    5.61{col 48}{space 3}0.000{col 56}{space 4} .1671546{col 69}{space 3} .3545526
{txt}{space 14} {c |}
{space 3}SPFPCE_ct50 {c |}{col 16}{res}{space 2}-.4134349{col 28}{space 2} .1110816{col 39}{space 1}   -3.72{col 48}{space 3}0.001{col 56}{space 4}-.6371648{col 69}{space 3} -.189705
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .4277893{col 28}{space 2} .1906758{col 39}{space 1}    2.24{col 48}{space 3}0.030{col 56}{space 4} .0437486{col 69}{space 3} .8118299
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     549
                                                       {txt}F(  4,    44) ={res}  108.87
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4522
                                                       {txt}Root MSE      = {res}  .5686

{txt}{ralign 80:(Std. Err. adjusted for {res:45} clusters in date)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}InfExp_Mean_rv{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Mean_rv {c |}
{space 11}L1. {c |}{col 16}{res}{space 2} .3685224{col 28}{space 2} .0493808{col 39}{space 1}    7.46{col 48}{space 3}0.000{col 56}{space 4}  .269002{col 69}{space 3} .4680429
{txt}{space 11}L2. {c |}{col 16}{res}{space 2} .2458168{col 28}{space 2} .0584193{col 39}{space 1}    4.21{col 48}{space 3}0.000{col 56}{space 4} .1280804{col 69}{space 3} .3635532
{txt}{space 11}L3. {c |}{col 16}{res}{space 2} .1159029{col 28}{space 2} .0692972{col 39}{space 1}    1.67{col 48}{space 3}0.102{col 56}{space 4}-.0237564{col 69}{space 3} .2555622
{txt}{space 14} {c |}
{space 3}SPFPCE_ct50 {c |}{col 16}{res}{space 2}-.5043422{col 28}{space 2} .1375066{col 39}{space 1}   -3.67{col 48}{space 3}0.001{col 56}{space 4}-.7814686{col 69}{space 3}-.2272158
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .6412178{col 28}{space 2} .2281376{col 39}{space 1}    2.81{col 48}{space 3}0.007{col 56}{space 4} .1814366{col 69}{space 3} 1.100999
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. foreach var in SPFCPI SPFPCE{c -(}
{txt}  2{com}.   foreach mom in Var{c -(}
{txt}  3{com}.      replace InfExp_`mom'_rv =  `var'_`mom'0 - l1.`var'_`mom'
{txt}  4{com}.          eststo `var'`mom'rvlv0: reg InfExp_`mom'_rv, vce(cluster date) 
{txt}  5{com}.      eststo `var'`mom'rvlv1: reg InfExp_`mom'_rv l1.InfExp_`mom'_rv, vce(cluster date) 
{txt}  6{com}.          eststo `var'`mom'rvlv2: reg  InfExp_`mom'_rv l(1/2).InfExp_`mom'_rv, vce(cluster date) 
{txt}  7{com}.          eststo `var'`mom'rvlv3: reg  InfExp_`mom'_rv l(1/3).InfExp_`mom'_rv, vce(cluster date)
{txt}  8{com}.  {c )-}
{txt}  9{com}. {c )-}
{txt}(1189 real changes made)

Linear regression                                      Number of obs ={res}    1189
                                                       {txt}F(  0,    47) ={res}    0.00
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.0000
                                                       {txt}Root MSE      = {res} .18512

{txt}{ralign 78:(Std. Err. adjusted for {res:48} clusters in date)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_Var~v{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0335273{col 26}{space 2} .0049694{col 37}{space 1}   -6.75{col 46}{space 3}0.000{col 54}{space 4}-.0435245{col 67}{space 3}-.0235301
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     877
                                                       {txt}F(  1,    46) ={res}    5.64
                                                       {txt}Prob > F      = {res} 0.0217
                                                       {txt}R-squared     = {res} 0.1242
                                                       {txt}Root MSE      = {res} .11911

{txt}{ralign 79:(Std. Err. adjusted for {res:47} clusters in date)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}InfExp_Var_rv{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_rv {c |}
{space 10}L1. {c |}{col 15}{res}{space 2} .2895926{col 27}{space 2} .1218994{col 38}{space 1}    2.38{col 47}{space 3}0.022{col 55}{space 4} .0442219{col 68}{space 3} .5349632
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}-.0108971{col 27}{space 2}  .003588{col 38}{space 1}   -3.04{col 47}{space 3}0.004{col 55}{space 4}-.0181194{col 68}{space 3}-.0036748
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     663
                                                       {txt}F(  2,    45) ={res}   10.21
                                                       {txt}Prob > F      = {res} 0.0002
                                                       {txt}R-squared     = {res} 0.2837
                                                       {txt}Root MSE      = {res} .09446

{txt}{ralign 79:(Std. Err. adjusted for {res:46} clusters in date)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}InfExp_Var_rv{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_rv {c |}
{space 10}L1. {c |}{col 15}{res}{space 2} .5292833{col 27}{space 2}  .117128{col 38}{space 1}    4.52{col 47}{space 3}0.000{col 55}{space 4} .2933754{col 68}{space 3} .7651913
{txt}{space 10}L2. {c |}{col 15}{res}{space 2}-.0587291{col 27}{space 2}  .125227{col 38}{space 1}   -0.47{col 47}{space 3}0.641{col 55}{space 4}-.3109492{col 68}{space 3} .1934911
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}-.0084305{col 27}{space 2} .0034601{col 38}{space 1}   -2.44{col 47}{space 3}0.019{col 55}{space 4}-.0153994{col 68}{space 3}-.0014616
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     504
                                                       {txt}F(  3,    44) ={res}    8.15
                                                       {txt}Prob > F      = {res} 0.0002
                                                       {txt}R-squared     = {res} 0.4075
                                                       {txt}Root MSE      = {res} .07866

{txt}{ralign 79:(Std. Err. adjusted for {res:45} clusters in date)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}InfExp_Var_rv{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_rv {c |}
{space 10}L1. {c |}{col 15}{res}{space 2} .5813735{col 27}{space 2} .1453757{col 38}{space 1}    4.00{col 47}{space 3}0.000{col 55}{space 4} .2883881{col 68}{space 3}  .874359
{txt}{space 10}L2. {c |}{col 15}{res}{space 2} -.209009{col 27}{space 2} .1274407{col 38}{space 1}   -1.64{col 47}{space 3}0.108{col 55}{space 4}-.4658488{col 68}{space 3} .0478308
{txt}{space 10}L3. {c |}{col 15}{res}{space 2} .3525332{col 27}{space 2} .1211523{col 38}{space 1}    2.91{col 47}{space 3}0.006{col 55}{space 4} .1083667{col 68}{space 3} .5966996
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}-.0053383{col 27}{space 2} .0039975{col 38}{space 1}   -1.34{col 47}{space 3}0.189{col 55}{space 4}-.0133948{col 68}{space 3} .0027182
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(1199 real changes made, 258 to missing)

Linear regression                                      Number of obs ={res}    1082
                                                       {txt}F(  0,    47) ={res}    0.00
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.0000
                                                       {txt}Root MSE      = {res} .17386

{txt}{ralign 78:(Std. Err. adjusted for {res:48} clusters in date)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_Var~v{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0386895{col 26}{space 2} .0055218{col 37}{space 1}   -7.01{col 46}{space 3}0.000{col 54}{space 4} -.049798{col 67}{space 3}-.0275811
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     801
                                                       {txt}F(  1,    46) ={res}   52.65
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.3532
                                                       {txt}Root MSE      = {res} .14066

{txt}{ralign 79:(Std. Err. adjusted for {res:47} clusters in date)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}InfExp_Var_rv{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_rv {c |}
{space 10}L1. {c |}{col 15}{res}{space 2} .5770089{col 27}{space 2} .0795219{col 38}{space 1}    7.26{col 47}{space 3}0.000{col 55}{space 4} .4169397{col 68}{space 3} .7370782
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}-.0187872{col 27}{space 2} .0063737{col 38}{space 1}   -2.95{col 47}{space 3}0.005{col 55}{space 4}-.0316167{col 68}{space 3}-.0059577
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     604
                                                       {txt}F(  2,    45) ={res}   49.86
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.5831
                                                       {txt}Root MSE      = {res} .11815

{txt}{ralign 79:(Std. Err. adjusted for {res:46} clusters in date)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}InfExp_Var_rv{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_rv {c |}
{space 10}L1. {c |}{col 15}{res}{space 2} .4771173{col 27}{space 2} .1298426{col 38}{space 1}    3.67{col 47}{space 3}0.001{col 55}{space 4} .2156009{col 68}{space 3} .7386336
{txt}{space 10}L2. {c |}{col 15}{res}{space 2} .3602304{col 27}{space 2} .1429591{col 38}{space 1}    2.52{col 47}{space 3}0.015{col 55}{space 4}  .072296{col 68}{space 3} .6481648
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}-.0101987{col 27}{space 2} .0034285{col 38}{space 1}   -2.97{col 47}{space 3}0.005{col 55}{space 4}-.0171042{col 68}{space 3}-.0032933
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     458
                                                       {txt}F(  3,    44) ={res}   33.55
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.7232
                                                       {txt}Root MSE      = {res} .09958

{txt}{ralign 79:(Std. Err. adjusted for {res:45} clusters in date)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}InfExp_Var_rv{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_rv {c |}
{space 10}L1. {c |}{col 15}{res}{space 2}  .343767{col 27}{space 2} .1481177{col 38}{space 1}    2.32{col 47}{space 3}0.025{col 55}{space 4} .0452555{col 68}{space 3} .6422786
{txt}{space 10}L2. {c |}{col 15}{res}{space 2} .2047146{col 27}{space 2} .0982414{col 38}{space 1}    2.08{col 47}{space 3}0.043{col 55}{space 4} .0067221{col 68}{space 3}  .402707
{txt}{space 10}L3. {c |}{col 15}{res}{space 2} .3901984{col 27}{space 2} .1485954{col 38}{space 1}    2.63{col 47}{space 3}0.012{col 55}{space 4} .0907241{col 68}{space 3} .6896727
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}-.0074135{col 27}{space 2} .0027771{col 38}{space 1}   -2.67{col 47}{space 3}0.011{col 55}{space 4}-.0130104{col 68}{space 3}-.0018167
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/ind/RVEfficiencySPFIndQ.csv", mtitles b(%8.3f) se(%8.3f) scalars(N r2) sfmt(%8.3f %8.3f %8.3f) replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/ind/RVEfficiencySPFIndQ.csv"'})

{com}. ddd
{err}unrecognized command:  ddd
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. clear

. clear

. 