{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/ExpProject/workingfolder/irf_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 Jun 2019, 08:21:07
{txt}
{com}. 
. 
. **********************************************
. *** Clean Inflation Shock data from Python ***
. **********************************************
. 
. use "${c -(}mainfolder{c )-}/OtherData/InfShocks.dta",clear 
{txt}
{com}. 
. drop index 
{txt}
{com}. 
. *** Date 
. gen date_str=string(year)+"Q"+string(quarter) 
{txt}
{com}. 
. gen date = quarterly(date_str,"YQ")
{txt}
{com}. format date %tq 
{txt}
{com}. 
. drop date_str
{txt}
{com}. 
. order date year quarter month
{txt}
{com}. 
. ** Time series 
. 
. tsset date 
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1984q1 to 2018q4
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. 
. ** Merge with survey and inflation  
. 
. merge 1:1 year quarter using "${c -(}folder{c )-}/InfExpQ.dta",keep(match using master)
{res}{txt}{p 0 7 2}
(note: variable
year was 
long, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
quarter was 
long, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             146
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}             146{txt}  (_merge==2)

{col 5}matched{col 30}{res}             140{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge InfExp_merge
{res}{txt}
{com}. 
. drop if month==. 
{txt}(146 observations deleted)

{com}. drop if quarter ==.
{txt}(0 observations deleted)

{com}. 
. merge 1:1 year month using "${c -(}mainfolder{c )-}/OtherData/InfM.dta",keep(match master)
{res}{txt}{p 0 7 2}
(note: variable
month was 
long, now double to accommodate using data's values)
{p_end}
(label _merge already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             140{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge InfM_merge 
{res}{txt}
{com}. 
. ** Label and rename
. 
. label var pty_shock "Technology shock(Gali 1999)"
{txt}
{com}. label var hours_shock "Non-technology shock(Gali 1999)"
{txt}
{com}. label var inf_shock "Shock to inflation(Gali 1999)"
{txt}
{com}. label var pty_max_shock "Technology shock (Francis etal 2014)"
{txt}
{com}. label var news_shock "News shock(Sims etal.2011)"
{txt}
{com}. rename OPShock_nm op_shock 
{res}{txt}
{com}. label var op_shock "Oil price shock (Hamilton 1996)"
{txt}
{com}. rename MP1 mp1_shock
{res}{txt}
{com}. label var mp1_shock "Unexpected change in federal funds rate"
{txt}
{com}. label var ED4 "1-year ahead future-implied change in federal funds rate"
{txt}
{com}. label var ED8 "2-year ahead future-implied change in federal funds rate"
{txt}
{com}. 
. 
. ** MP-path shock 
. 
. foreach ed in ED4 ED8{c -(}
{txt}  2{com}.   reg `ed' mp1_shock
{txt}  3{com}.   predict `ed'_shock, residual
{txt}  4{com}. label var `ed'_shock "Unexpected shock to future federal funds rate"
{txt}  5{com}. {c )-}

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}     121
{txt}{hline 13}{char +}{hline 30}           F(  1,   119) ={res}   21.17
    {txt}   Model {char |} {res}  .22003407     1   .22003407           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 1.23701593   119  .010395092           {txt}R-squared     = {res} 0.1510
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.1439
    {txt}   Total {char |} {res}    1.45705   120  .012142083           {txt}Root MSE      = {res} .10196

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         ED4{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}mp1_shock {c |}{col 14}{res}{space 2} .3596785{col 26}{space 2} .0781778{col 37}{space 1}    4.60{col 46}{space 3}0.000{col 54}{space 4} .2048786{col 67}{space 3} .5144785
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0109294{col 26}{space 2} .0097298{col 37}{space 1}   -1.12{col 46}{space 3}0.264{col 54}{space 4}-.0301953{col 67}{space 3} .0083366
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(19 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}     100
{txt}{hline 13}{char +}{hline 30}           F(  1,    98) ={res}    1.91
    {txt}   Model {char |} {res} .022918019     1  .022918019           {txt}Prob > F      = {res} 0.1704
    {txt}Residual {char |} {res} 1.17762183    98  .012016549           {txt}R-squared     = {res} 0.0191
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0091
    {txt}   Total {char |} {res} 1.20053985    99  .012126665           {txt}Root MSE      = {res} .10962

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         ED8{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}mp1_shock {c |}{col 14}{res}{space 2} .1493479{col 26}{space 2} .1081435{col 37}{space 1}    1.38{col 46}{space 3}0.170{col 54}{space 4}-.0652594{col 67}{space 3} .3639551
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0148961{col 26}{space 2}   .01126{col 37}{space 1}   -1.32{col 46}{space 3}0.189{col 54}{space 4}-.0372413{col 67}{space 3}  .007449
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(40 missing values generated)

{com}. 
. ** Normorlize MP shcoks
. 
. foreach var in mp1 ED4 ED8{c -(}
{txt}  2{com}.   egen `var'_shock_sd =sd(`var'_shock)
{txt}  3{com}.   gen `var'ut_shock = `var'_shock/`var'_shock_sd 
{txt}  4{com}.   local lb : var label `var'_shock
{txt}  5{com}.   label var `var'ut_shock "`lb' in std unit"
{txt}  6{com}. {c )-}
{txt}(19 missing values generated)
(19 missing values generated)
(40 missing values generated)

{com}. 
. 
. ** Generated unidentified shocks. 
. 
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1984q1 to 2018q4
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. 
. eststo clear
{txt}
{com}. 
. foreach Inf in CPIAU CPICore PCEPI{c -(} 
{txt}  2{com}.    reg Inf1y_`Inf' l(1/4).Inf1y_`Inf' l(0/1).pty_shock l(0/1).op_shock l(0/1).mp1ut_shock l(0/1).ED8ut_shock
{txt}  3{com}.    predict `Inf'_uid_shock, residual
{txt}  4{com}.    label var `Inf'_uid_shock "Unidentified shocks to inflation"
{txt}  5{com}.  {c )-}

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}      99
{txt}{hline 13}{char +}{hline 30}           F( 12,    86) ={res}   13.24
    {txt}   Model {char |} {res} 86.2529482    12  7.18774568           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 46.6984119    86   .54300479           {txt}R-squared     = {res} 0.6488
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.5997
    {txt}   Total {char |} {res}  132.95136    98  1.35664653           {txt}Root MSE      = {res} .73689

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} Inf1y_CPIAU{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}Inf1y_CPIAU {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .5691486{col 26}{space 2} .1074395{col 37}{space 1}    5.30{col 46}{space 3}0.000{col 54}{space 4} .3555659{col 67}{space 3} .7827313
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0210417{col 26}{space 2} .1184549{col 37}{space 1}    0.18{col 46}{space 3}0.859{col 54}{space 4}-.2144388{col 67}{space 3} .2565223
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1725765{col 26}{space 2} .1186843{col 37}{space 1}    1.45{col 46}{space 3}0.150{col 54}{space 4}-.0633601{col 67}{space 3} .4085132
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.2093588{col 26}{space 2} .0944661{col 37}{space 1}   -2.22{col 46}{space 3}0.029{col 54}{space 4}-.3971512{col 67}{space 3}-.0215664
{txt}{space 12} {c |}
{space 3}pty_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.1586146{col 26}{space 2} .1082381{col 37}{space 1}   -1.47{col 46}{space 3}0.146{col 54}{space 4}-.3737849{col 67}{space 3} .0565556
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} -.096206{col 26}{space 2} .1023788{col 37}{space 1}   -0.94{col 46}{space 3}0.350{col 54}{space 4}-.2997284{col 67}{space 3} .1073164
{txt}{space 12} {c |}
{space 4}op_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .3063532{col 26}{space 2} .0869153{col 37}{space 1}    3.52{col 46}{space 3}0.001{col 54}{space 4} .1335712{col 67}{space 3} .4791351
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .1197119{col 26}{space 2} .0931144{col 37}{space 1}    1.29{col 46}{space 3}0.202{col 54}{space 4}-.0653934{col 67}{space 3} .3048173
{txt}{space 12} {c |}
{space 1}mp1ut_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .0575501{col 26}{space 2} .0939905{col 37}{space 1}    0.61{col 46}{space 3}0.542{col 54}{space 4}-.1292969{col 67}{space 3}  .244397
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.1129986{col 26}{space 2} .0961086{col 37}{space 1}   -1.18{col 46}{space 3}0.243{col 54}{space 4}-.3040562{col 67}{space 3} .0780591
{txt}{space 12} {c |}
{space 1}ED8ut_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .1329961{col 26}{space 2}  .082032{col 37}{space 1}    1.62{col 46}{space 3}0.109{col 54}{space 4}-.0300781{col 67}{space 3} .2960703
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.0418452{col 26}{space 2} .0856554{col 37}{space 1}   -0.49{col 46}{space 3}0.626{col 54}{space 4}-.2121224{col 67}{space 3}  .128432
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}   .66395{col 26}{space 2}  .221371{col 37}{space 1}    3.00{col 46}{space 3}0.004{col 54}{space 4} .2238789{col 67}{space 3} 1.104021
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(41 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      99
{txt}{hline 13}{char +}{hline 30}           F( 12,    86) ={res}   34.55
    {txt}   Model {char |} {res} 19.4293656    12   1.6191138           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res}  4.0300463    86  .046861003           {txt}R-squared     = {res} 0.8282
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.8042
    {txt}   Total {char |} {res} 23.4594119    98  .239381754           {txt}Root MSE      = {res} .21647

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Inf1y_CPICore{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Inf1y_CPICore {c |}
{space 10}L1. {c |}{col 15}{res}{space 2} .9882084{col 27}{space 2} .1147678{col 38}{space 1}    8.61{col 47}{space 3}0.000{col 55}{space 4} .7600575{col 68}{space 3} 1.216359
{txt}{space 10}L2. {c |}{col 15}{res}{space 2}-.0510983{col 27}{space 2} .1630388{col 38}{space 1}   -0.31{col 47}{space 3}0.755{col 55}{space 4}-.3752087{col 68}{space 3} .2730122
{txt}{space 10}L3. {c |}{col 15}{res}{space 2} .1103214{col 27}{space 2} .1547724{col 38}{space 1}    0.71{col 47}{space 3}0.478{col 55}{space 4}-.1973559{col 68}{space 3} .4179988
{txt}{space 10}L4. {c |}{col 15}{res}{space 2}-.1719145{col 27}{space 2} .1032382{col 38}{space 1}   -1.67{col 47}{space 3}0.100{col 55}{space 4}-.3771453{col 68}{space 3} .0333163
{txt}{space 13} {c |}
{space 4}pty_shock {c |}
{space 10}--. {c |}{col 15}{res}{space 2}-.0610438{col 27}{space 2} .0327464{col 38}{space 1}   -1.86{col 47}{space 3}0.066{col 55}{space 4}-.1261414{col 68}{space 3} .0040539
{txt}{space 10}L1. {c |}{col 15}{res}{space 2}-.0198286{col 27}{space 2}  .031072{col 38}{space 1}   -0.64{col 47}{space 3}0.525{col 55}{space 4}-.0815977{col 68}{space 3} .0419405
{txt}{space 13} {c |}
{space 5}op_shock {c |}
{space 10}--. {c |}{col 15}{res}{space 2} .0607946{col 27}{space 2}  .026395{col 38}{space 1}    2.30{col 47}{space 3}0.024{col 55}{space 4}  .008323{col 68}{space 3} .1132661
{txt}{space 10}L1. {c |}{col 15}{res}{space 2} .0067052{col 27}{space 2}  .026437{col 38}{space 1}    0.25{col 47}{space 3}0.800{col 55}{space 4}-.0458498{col 68}{space 3} .0592603
{txt}{space 13} {c |}
{space 2}mp1ut_shock {c |}
{space 10}--. {c |}{col 15}{res}{space 2}-.0092591{col 27}{space 2} .0279096{col 38}{space 1}   -0.33{col 47}{space 3}0.741{col 55}{space 4}-.0647416{col 68}{space 3} .0462234
{txt}{space 10}L1. {c |}{col 15}{res}{space 2}-.0118367{col 27}{space 2} .0286464{col 38}{space 1}   -0.41{col 47}{space 3}0.680{col 55}{space 4}-.0687839{col 68}{space 3} .0451105
{txt}{space 13} {c |}
{space 2}ED8ut_shock {c |}
{space 10}--. {c |}{col 15}{res}{space 2}-.0076132{col 27}{space 2} .0238197{col 38}{space 1}   -0.32{col 47}{space 3}0.750{col 55}{space 4}-.0549651{col 68}{space 3} .0397387
{txt}{space 10}L1. {c |}{col 15}{res}{space 2} .0021712{col 27}{space 2} .0244717{col 38}{space 1}    0.09{col 47}{space 3}0.930{col 55}{space 4} -.046477{col 68}{space 3} .0508194
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .2013513{col 27}{space 2} .1176176{col 38}{space 1}    1.71{col 47}{space 3}0.091{col 55}{space 4}-.0324647{col 68}{space 3} .4351673
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(41 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      99
{txt}{hline 13}{char +}{hline 30}           F( 12,    86) ={res}   16.21
    {txt}   Model {char |} {res} 54.4071368    12  4.53392807           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res}  24.046811    86  .279614081           {txt}R-squared     = {res} 0.6935
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.6507
    {txt}   Total {char |} {res} 78.4539478    98  .800550488           {txt}Root MSE      = {res} .52879

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} Inf1y_PCEPI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}Inf1y_PCEPI {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .6505327{col 26}{space 2} .1100486{col 37}{space 1}    5.91{col 46}{space 3}0.000{col 54}{space 4} .4317632{col 67}{space 3} .8693021
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0384709{col 26}{space 2} .1253254{col 37}{space 1}   -0.31{col 46}{space 3}0.760{col 54}{space 4}-.2876095{col 67}{space 3} .2106676
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1267602{col 26}{space 2}  .125449{col 37}{space 1}    1.01{col 46}{space 3}0.315{col 54}{space 4}-.1226243{col 67}{space 3} .3761446
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.1636981{col 26}{space 2} .0950674{col 37}{space 1}   -1.72{col 46}{space 3}0.089{col 54}{space 4}-.3526859{col 67}{space 3} .0252897
{txt}{space 12} {c |}
{space 3}pty_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.0969642{col 26}{space 2} .0771478{col 37}{space 1}   -1.26{col 46}{space 3}0.212{col 54}{space 4} -.250329{col 67}{space 3} .0564006
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.1089007{col 26}{space 2} .0726187{col 37}{space 1}   -1.50{col 46}{space 3}0.137{col 54}{space 4}-.2532619{col 67}{space 3} .0354604
{txt}{space 12} {c |}
{space 4}op_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .2400242{col 26}{space 2}   .06228{col 37}{space 1}    3.85{col 46}{space 3}0.000{col 54}{space 4} .1162156{col 67}{space 3} .3638328
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .0618353{col 26}{space 2} .0674198{col 37}{space 1}    0.92{col 46}{space 3}0.362{col 54}{space 4}-.0721908{col 67}{space 3} .1958615
{txt}{space 12} {c |}
{space 1}mp1ut_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .0661031{col 26}{space 2} .0673379{col 37}{space 1}    0.98{col 46}{space 3}0.329{col 54}{space 4}-.0677602{col 67}{space 3} .1999665
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.0359373{col 26}{space 2} .0691502{col 37}{space 1}   -0.52{col 46}{space 3}0.605{col 54}{space 4}-.1734034{col 67}{space 3} .1015287
{txt}{space 12} {c |}
{space 1}ED8ut_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}  .069708{col 26}{space 2} .0589991{col 37}{space 1}    1.18{col 46}{space 3}0.241{col 54}{space 4}-.0475782{col 67}{space 3} .1869943
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.0246735{col 26}{space 2} .0608363{col 37}{space 1}   -0.41{col 46}{space 3}0.686{col 54}{space 4} -.145612{col 67}{space 3}  .096265
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .5505704{col 26}{space 2} .1606296{col 37}{space 1}    3.43{col 46}{space 3}0.001{col 54}{space 4} .2312493{col 67}{space 3} .8698916
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(41 missing values generated)

{com}. 
. 
. /*
> ** Plot all shocks for checking 
> 
> twoway (tsline pty_shock) (tsline op_shock) ///
>         (tsline mp1ut_shock) (tsline ED8ut_shock) ///
>                 (tsline CPIAU_uid_shock), ///
>                 title("Shocks to Inflation",size(4)) ///
>                 xtitle("Time") ytitle("") ///
>                 legend(cols(1)) 
>                 
> graph export "${c -(}sum_graph_folder{c )-}/inf_shocksQ", as(png) replace
> 
> ** First-run of inflation 
> 
> eststo clear
> foreach sk in pty pty_max op mp1ut ED4ut ED8ut{c -(}
>   foreach Inf in CPIAU CPICore PCEPI{c -(} 
>    eststo `Inf'_`sk': reg Inf1y_`Inf' l(0/1).`sk'_shock, robust
>    eststo `Inf'_uid: reg Inf1y_`Inf' l(0/1).`Inf'_uid_shock,robust 
>  {c )-}
> {c )-}
> esttab using "${c -(}sum_table_folder{c )-}/IRFQ.csv", mtitles se r2 replace
> 
> ** IRF of inflation (one shock each time) 
> 
> eststo clear
> foreach sk in pty pty_max op mp1ut ED4ut ED8ut{c -(}
>   foreach Inf in CPIAU CPICore PCEPI{c -(} 
>    var Inf1y_`Inf', lags(1/4) exo(l(0/1).`sk'_shock)
>    set seed 123456
>    irf create irf1, set(irf,replace) step(10) bsp
>    irf graph dm, impulse(`sk'_shock)
>    graph export "${c -(}sum_graph_folder{c )-}/irf/`Inf'_`sk'", as(png) replace
>  {c )-}
> {c )-}
> 
> ***********************************************
> ** IRF of inflation (all shocks at one time) **
> ***********************************************
> 
> eststo clear
> 
> foreach Inf in CPIAU CPICore PCEPI{c -(} 
>    var Inf1y_`Inf', lags(1/4) ///
>                      exo(l(0/1).pty_shock l(0/1).op_shock ///
>                                          l(0/1).mp1ut_shock l(0/1).ED8ut_shock)   
>    set seed 123456
>    irf create irf1, set(irf,replace) step(10) bsp replace 
>    irf graph dm, impulse(pty_shock op_shock mp1ut_shock ED8ut_shock) ///
>                  byopts(title("`mom'") yrescale xrescale note("")) ///
>                  legend(col(2) order(1 "95% CI" 2 "IRF") symx(*.5) size(vsmall)) ///
>                                  xtitle("Quarters") 
>    graph export "${c -(}sum_graph_folder{c )-}/irf/`Inf'_ashocks", as(png) replace
> 
> {c )-}
> */
. 
. 
. ***********************************************
. ** IRF of inflation (all shocks exl MP at one time) **
. ***********************************************
. 
. 
. eststo clear
{txt}
{com}. 
. foreach Inf in CPIAU CPICore PCEPI{c -(} 
{txt}  2{com}.    var Inf1y_`Inf', lags(1/4) ///
>                      exo(l(0/1).pty_shock l(0/1).op_shock)   
{txt}  3{com}.    set seed 123456
{txt}  4{com}.    irf create irf1, set(irf,replace) step(10) bsp replace 
{txt}  5{com}.    irf graph dm, impulse(pty_shock op_shock) ///
>                  byopts(title("`mom'") yrescale xrescale note("")) ///
>                  legend(col(2) order(1 "95% CI" 2 "IRF") symx(*.5) size(vsmall)) ///
>                                  xtitle("Quarters") 
{txt}  6{com}.    graph export "${c -(}sum_graph_folder{c )-}/irf/`Inf'_ashocks_nmp", as(png) replace
{txt}  7{com}. 
. {c )-}
{res}
{txt}Vector autoregression

{col 1}Sample:  {res}1985q1 - 2018q4 {txt}{col 52}No. of obs{col 68}= {res}      136
{txt}Log likelihood = {res}-142.2758{txt}{col 40}{col 52}AIC{col 68}= {res} 2.224644
{txt}FPE{col 16}= {res} .5417017{txt}{col 52}HQIC{col 68}= {res} 2.302972
{txt}Det(Sigma_ml){col 16}= {res}  .474456{txt}{col 52}SBIC{col 68}= {res} 2.417393

{col 1}{text}Equation        {col 18}  Parms{col 26}     RMSE {col 37}   R-sq  {col 47}   chi2   {col 58} P>chi2
{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 10}{hline 11}{hline 7}
{col 1}{text}Inf1y_CPIAU     {col 18}{result}     9{col 26}{space 2} .712797{col 37}{space 1} 0.7293{col 47} 366.4907{col 58} 0.0000
{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 10}{hline 11}{hline 7}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} Inf1y_CPIAU{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Inf1y_CPIAU  {txt}{c |}
{space 1}Inf1y_CPIAU {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .7071918{col 26}{space 2} .0837475{col 37}{space 1}    8.44{col 46}{space 3}0.000{col 54}{space 4} .5430496{col 67}{space 3} .8713339
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0022103{col 26}{space 2} .0973607{col 37}{space 1}   -0.02{col 46}{space 3}0.982{col 54}{space 4}-.1930338{col 67}{space 3} .1886131
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .2231129{col 26}{space 2} .0979756{col 37}{space 1}    2.28{col 46}{space 3}0.023{col 54}{space 4} .0310843{col 67}{space 3} .4151416
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.1612062{col 26}{space 2} .0756998{col 37}{space 1}   -2.13{col 46}{space 3}0.033{col 54}{space 4} -.309575{col 67}{space 3}-.0128373
{txt}{space 12} {c |}
{space 3}pty_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.1704829{col 26}{space 2} .0767107{col 37}{space 1}   -2.22{col 46}{space 3}0.026{col 54}{space 4}-.3208331{col 67}{space 3}-.0201326
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.0910309{col 26}{space 2} .0775703{col 37}{space 1}   -1.17{col 46}{space 3}0.241{col 54}{space 4}-.2430659{col 67}{space 3} .0610041
{txt}{space 12} {c |}
{space 4}op_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .3487544{col 26}{space 2} .0627062{col 37}{space 1}    5.56{col 46}{space 3}0.000{col 54}{space 4} .2258525{col 67}{space 3} .4716562
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .0186943{col 26}{space 2} .0698644{col 37}{space 1}    0.27{col 46}{space 3}0.789{col 54}{space 4}-.1182375{col 67}{space 3}  .155626
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3468444{col 26}{space 2} .1594781{col 37}{space 1}    2.17{col 46}{space 3}0.030{col 54}{space 4} .0342731{col 67}{space 3} .6594156
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
(file irf.irf created)
(file irf.irf now active)
irfname irf1 not found in irf.irf
........................................................................................................................................................................................................
{res}{txt}(file irf.irf updated)
{res}{txt}(file /Users/Myworld/Dropbox/ExpProject/workingfolder/graphs/pop/irf/CPIAU_ashocks_nmp written in PNG format)
{res}
{txt}Vector autoregression

{col 1}Sample:  {res}1985q1 - 2018q4 {txt}{col 52}No. of obs{col 68}= {res}      136
{txt}Log likelihood = {res} 18.84739{txt}{col 40}{col 52}AIC{col 68}= {res}-.1448145
{txt}FPE{col 16}= {res} .0506661{txt}{col 52}HQIC{col 68}= {res}-.0664861
{txt}Det(Sigma_ml){col 16}= {res} .0443765{txt}{col 52}SBIC{col 68}= {res} .0479347

{col 1}{text}Equation        {col 18}  Parms{col 26}     RMSE {col 37}   R-sq  {col 47}   chi2   {col 58} P>chi2
{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 10}{hline 11}{hline 7}
{col 1}{text}Inf1y_CPICore   {col 18}{result}     9{col 26}{space 2} .217994{col 37}{space 1} 0.9609{col 47} 3340.363{col 58} 0.0000
{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 10}{hline 11}{hline 7}

{res}{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Inf1y_CPICore{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Inf1y_CPICore {txt}{c |}
Inf1y_CPICore {c |}
{space 10}L1. {c |}{col 15}{res}{space 2} 1.053623{col 27}{space 2} .0842183{col 38}{space 1}   12.51{col 47}{space 3}0.000{col 55}{space 4} .8885579{col 68}{space 3} 1.218688
{txt}{space 10}L2. {c |}{col 15}{res}{space 2} -.012955{col 27}{space 2} .1177855{col 38}{space 1}   -0.11{col 47}{space 3}0.912{col 55}{space 4}-.2438104{col 68}{space 3} .2179004
{txt}{space 10}L3. {c |}{col 15}{res}{space 2} .0661953{col 27}{space 2} .1147942{col 38}{space 1}    0.58{col 47}{space 3}0.564{col 55}{space 4}-.1587972{col 68}{space 3} .2911879
{txt}{space 10}L4. {c |}{col 15}{res}{space 2}-.1379926{col 27}{space 2} .0766214{col 38}{space 1}   -1.80{col 47}{space 3}0.072{col 55}{space 4}-.2881678{col 68}{space 3} .0121826
{txt}{space 13} {c |}
{space 4}pty_shock {c |}
{space 10}--. {c |}{col 15}{res}{space 2}-.0547339{col 27}{space 2} .0233965{col 38}{space 1}   -2.34{col 47}{space 3}0.019{col 55}{space 4}-.1005903{col 68}{space 3}-.0088775
{txt}{space 10}L1. {c |}{col 15}{res}{space 2}-.0034025{col 27}{space 2} .0236968{col 38}{space 1}   -0.14{col 47}{space 3}0.886{col 55}{space 4}-.0498474{col 68}{space 3} .0430423
{txt}{space 13} {c |}
{space 5}op_shock {c |}
{space 10}--. {c |}{col 15}{res}{space 2} .0897888{col 27}{space 2} .0191457{col 38}{space 1}    4.69{col 47}{space 3}0.000{col 55}{space 4} .0522639{col 68}{space 3} .1273137
{txt}{space 10}L1. {c |}{col 15}{res}{space 2}-.0209597{col 27}{space 2} .0206036{col 38}{space 1}   -1.02{col 47}{space 3}0.309{col 55}{space 4} -.061342{col 68}{space 3} .0194226
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .0219843{col 27}{space 2} .0538982{col 38}{space 1}    0.41{col 47}{space 3}0.683{col 55}{space 4}-.0836543{col 68}{space 3} .1276229
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
(file irf.irf created)
(file irf.irf now active)
irfname irf1 not found in irf.irf
........................................................................................................................................................................................................
{res}{txt}(file irf.irf updated)
{res}{txt}(file /Users/Myworld/Dropbox/ExpProject/workingfolder/graphs/pop/irf/CPICore_ashocks_nmp written in PNG format)
{res}
{txt}Vector autoregression

{col 1}Sample:  {res}1985q1 - 2018q4 {txt}{col 52}No. of obs{col 68}= {res}      136
{txt}Log likelihood = {res}-98.67385{txt}{col 40}{col 52}AIC{col 68}= {res} 1.583439
{txt}FPE{col 16}= {res} .2852914{txt}{col 52}HQIC{col 68}= {res} 1.661767
{txt}Det(Sigma_ml){col 16}= {res} .2498759{txt}{col 52}SBIC{col 68}= {res} 1.776188

{col 1}{text}Equation        {col 18}  Parms{col 26}     RMSE {col 37}   R-sq  {col 47}   chi2   {col 58} P>chi2
{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 10}{hline 11}{hline 7}
{col 1}{text}Inf1y_PCEPI     {col 18}{result}     9{col 26}{space 2} .517285{col 37}{space 1} 0.7931{col 47} 521.4494{col 58} 0.0000
{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 10}{hline 11}{hline 7}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} Inf1y_PCEPI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Inf1y_PCEPI  {txt}{c |}
{space 1}Inf1y_PCEPI {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .8535481{col 26}{space 2} .0840406{col 37}{space 1}   10.16{col 46}{space 3}0.000{col 54}{space 4} .6888316{col 67}{space 3} 1.018265
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0978704{col 26}{space 2} .1040127{col 37}{space 1}   -0.94{col 46}{space 3}0.347{col 54}{space 4}-.3017316{col 67}{space 3} .1059908
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1791234{col 26}{space 2} .1045774{col 37}{space 1}    1.71{col 46}{space 3}0.087{col 54}{space 4}-.0258447{col 67}{space 3} .3840914
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.1115568{col 26}{space 2} .0762611{col 37}{space 1}   -1.46{col 46}{space 3}0.144{col 54}{space 4}-.2610258{col 67}{space 3} .0379123
{txt}{space 12} {c |}
{space 3}pty_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.0962034{col 26}{space 2} .0555198{col 37}{space 1}   -1.73{col 46}{space 3}0.083{col 54}{space 4}-.2050203{col 67}{space 3} .0126134
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} -.091643{col 26}{space 2}  .055564{col 37}{space 1}   -1.65{col 46}{space 3}0.099{col 54}{space 4}-.2005465{col 67}{space 3} .0172605
{txt}{space 12} {c |}
{space 4}op_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .2598722{col 26}{space 2} .0455906{col 37}{space 1}    5.70{col 46}{space 3}0.000{col 54}{space 4} .1705162{col 67}{space 3} .3492282
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.0429493{col 26}{space 2}  .050444{col 37}{space 1}   -0.85{col 46}{space 3}0.395{col 54}{space 4}-.1418178{col 67}{space 3} .0559191
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2275111{col 26}{space 2} .1116914{col 37}{space 1}    2.04{col 46}{space 3}0.042{col 54}{space 4}    .0086{col 67}{space 3} .4464223
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
(file irf.irf created)
(file irf.irf now active)
irfname irf1 not found in irf.irf
........................................................................................................................................................................................................
{res}{txt}(file irf.irf updated)
{res}{txt}(file /Users/Myworld/Dropbox/ExpProject/workingfolder/graphs/pop/irf/PCEPI_ashocks_nmp written in PNG format)

{com}. 
. 
. /*
> ****************************************************
> ** IRF of SPF moments (all shocks at one time)    **
> ****************************************************
> 
> 
> foreach mom in Mean Var Disg FE{c -(}
>    foreach var in SPFCPI SPFPCE{c -(}
>        capture var `var'_`mom', lags(1/4) ///
>                      exo(l(0/1).pty_shock l(0/1).op_shock ///
>                                          l(0/1).mp1ut_shock )
>    set seed 123456
>    capture irf create `var', set(`mom') step(10) bsp 
> {c )-}
>    capture irf graph dm, impulse(pty_shock op_shock mp1ut_shock) ///
>                          byopts(title("`mom'") yrescale /// 
>                                                  xrescale note("")) legend(col(2) /// 
>                                                  order(1 "95% CI" 2 "IRF") symx(*.5) size(vsmall))  ///
>                                                  xtitle("Quarters") 
>    capture graph export "${c -(}sum_graph_folder{c )-}/irf/moments/SPF`mom'_ashocks", as(png) replace
> {c )-}
> */
. 
. 
. 
. ***********************************************************
. ** IRF of SPF moments (all shocks exl MP at one time)    **
. ***********************************************************
. 
. 
. foreach mom in Mean Var Disg FE{c -(}
{txt}  2{com}.    foreach var in SPFCPI SPFPCE{c -(}
{txt}  3{com}.        capture var `var'_`mom', lags(1/4) ///
>                      exo(l(0/1).pty_shock l(0/1).op_shock) 
{txt}  4{com}.    set seed 123456
{txt}  5{com}.    capture irf create `var', set(`mom') step(10) bsp  
{txt}  6{com}. {c )-}
{txt}  7{com}.    capture irf graph dm, impulse(pty_shock op_shock) ///
>                          byopts(title("`mom'") yrescale /// 
>                                                  xrescale note("")) legend(col(2) /// 
>                                                  order(1 "95% CI" 2 "IRF") symx(*.5) size(vsmall))  ///
>                                                  xtitle("Quarters") 
{txt}  8{com}.    capture graph export "${c -(}sum_graph_folder{c )-}/irf/moments/SPF`mom'_ashocks_nmp", as(png) replace
{txt}  9{com}. {c )-}
{txt}
{com}. 
. /*
> ****************************************************
> ** IRF of SCE moments (all shocks at one time)    **
> ****************************************************
> 
> 
> foreach mom in Mean Var Disg FE{c -(}
>    foreach var in SCE{c -(}
>        capture var `var'_`mom', lags(1/4) ///
>                      exo(l(0/1).pty_shock l(0/1).op_shock ///
>                                          l(0/1).mp1ut_shock )
>    set seed 123456
>    capture irf create `var', set(`mom') step(10) bsp replace 
> {c )-}
>    capture irf graph dm, impulse(pty_shock op_shock mp1ut_shock) ///
>                          byopts(title("`mom'") yrescale /// 
>                                                  xrescale note("")) legend(col(2) /// 
>                                                  order(1 "95% CI" 2 "IRF") symx(*.5) size(vsmall))  ///
>                                                  xtitle("Quarters") 
>    capture graph export "${c -(}sum_graph_folder{c )-}/irf/moments/SCE`mom'_ashocks", as(png) replace
> {c )-}
> */
. 
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/ExpProject/workingfolder/irf_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}17 Jun 2019, 08:22:38
{txt}{.-}
{smcl}
{txt}{sf}{ul off}