{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/ExpProject/workingfolder/irf_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}18 Jun 2019, 14:23:34
{txt}
{com}. 
. 
. **********************************************
. *** Clean Inflation Shock data from Python ***
. **********************************************
. 
. use "${c -(}mainfolder{c )-}/OtherData/InfShocks.dta",clear 
{txt}
{com}. 
. drop index 
{txt}
{com}. 
. *** Date 
. gen date_str=string(year)+"Q"+string(quarter) 
{txt}
{com}. 
. gen date = quarterly(date_str,"YQ")
{txt}
{com}. format date %tq 
{txt}
{com}. 
. drop date_str
{txt}
{com}. 
. order date year quarter month
{txt}
{com}. 
. ** Time series 
. 
. tsset date 
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1984q1 to 2018q4
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. 
. ** Period filter   
. ** i.e. Coibion et al2012. 1976-2007. But Density data is only avaiable after 2007.
. 
. keep if year>=1976 & year < 2007
{txt}(48 observations deleted)

{com}. 
. ** Merge with survey and inflation  
. 
. merge 1:1 year quarter using "${c -(}folder{c )-}/InfExpQ.dta",keep(match using master)
{res}{txt}{p 0 7 2}
(note: variable
year was 
long, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
quarter was 
long, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             194
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}             194{txt}  (_merge==2)

{col 5}matched{col 30}{res}              92{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge InfExp_merge
{res}{txt}
{com}. 
. drop if month==. 
{txt}(194 observations deleted)

{com}. drop if quarter ==.
{txt}(0 observations deleted)

{com}. 
. merge 1:1 year month using "${c -(}mainfolder{c )-}/OtherData/InfM.dta",keep(match master)
{res}{txt}{p 0 7 2}
(note: variable
month was 
long, now double to accommodate using data's values)
{p_end}
(label _merge already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              92{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge InfM_merge 
{res}{txt}
{com}. 
. ** Label and rename
. 
. label var pty_shock "Technology shock(Gali 1999)"
{txt}
{com}. label var hours_shock "Non-technology shock(Gali 1999)"
{txt}
{com}. label var inf_shock "Shock to inflation(Gali 1999)"
{txt}
{com}. label var pty_max_shock "Technology shock (Francis etal 2014)"
{txt}
{com}. label var news_shock "News shock(Sims etal.2011)"
{txt}
{com}. rename OPShock_nm op_shock 
{res}{txt}
{com}. label var op_shock "Oil price shock (Hamilton 1996)"
{txt}
{com}. rename MP1 mp1_shock
{res}{txt}
{com}. label var mp1_shock "Unexpected change in federal funds rate"
{txt}
{com}. label var ED4 "1-year ahead future-implied change in federal funds rate"
{txt}
{com}. label var ED8 "2-year ahead future-implied change in federal funds rate"
{txt}
{com}. 
. 
. ** MP-path shock 
. 
. foreach ed in ED4 ED8{c -(}
{txt}  2{com}.   reg `ed' mp1_shock
{txt}  3{com}.   predict `ed'_shock, residual
{txt}  4{com}. label var `ed'_shock "Unexpected shock to future federal funds rate"
{txt}  5{com}. {c )-}

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}      73
{txt}{hline 13}{char +}{hline 30}           F(  1,    71) ={res}   14.91
    {txt}   Model {char |} {res}  .15708416     1   .15708416           {txt}Prob > F      = {res} 0.0002
    {txt}Residual {char |} {res} .748163785    71  .010537518           {txt}R-squared     = {res} 0.1735
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.1619
    {txt}   Total {char |} {res} .905247945    72  .012572888           {txt}Root MSE      = {res} .10265

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         ED4{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}mp1_shock {c |}{col 14}{res}{space 2} .3398667{col 26}{space 2} .0880261{col 37}{space 1}    3.86{col 46}{space 3}0.000{col 54}{space 4} .1643476{col 67}{space 3} .5153859
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0038573{col 26}{space 2} .0128112{col 37}{space 1}   -0.30{col 46}{space 3}0.764{col 54}{space 4} -.029402{col 67}{space 3} .0216875
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(19 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      52
{txt}{hline 13}{char +}{hline 30}           F(  1,    50) ={res}    2.70
    {txt}   Model {char |} {res} .028508292     1  .028508292           {txt}Prob > F      = {res} 0.1064
    {txt}Residual {char |} {res} .527204501    50   .01054409           {txt}R-squared     = {res} 0.0513
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0323
    {txt}   Total {char |} {res} .555712793    51  .010896329           {txt}Root MSE      = {res} .10268

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         ED8{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}mp1_shock {c |}{col 14}{res}{space 2} .1998741{col 26}{space 2} .1215557{col 37}{space 1}    1.64{col 46}{space 3}0.106{col 54}{space 4}-.0442778{col 67}{space 3}  .444026
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0112077{col 26}{space 2} .0146579{col 37}{space 1}   -0.76{col 46}{space 3}0.448{col 54}{space 4}-.0406488{col 67}{space 3} .0182335
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(40 missing values generated)

{com}. 
. ** Normorlize MP shcoks
. 
. foreach var in mp1 ED4 ED8{c -(}
{txt}  2{com}.   egen `var'_shock_sd =sd(`var'_shock)
{txt}  3{com}.   gen `var'ut_shock = `var'_shock/`var'_shock_sd 
{txt}  4{com}.   local lb : var label `var'_shock
{txt}  5{com}.   label var `var'ut_shock "`lb' in std unit"
{txt}  6{com}. {c )-}
{txt}(19 missing values generated)
(19 missing values generated)
(40 missing values generated)

{com}. 
. ** Absolute values of the shocks
. 
. foreach var in op pty mp1ut ED8ut{c -(}
{txt}  2{com}. gen `var'_abshock = abs(`var'_shock)
{txt}  3{com}. local lb: var label `var'_shock
{txt}  4{com}. label var `var'_abshock "Absolute value of `lb'"
{txt}  5{com}. {c )-} 
{txt}(19 missing values generated)
(40 missing values generated)

{com}. 
. ** Generated unidentified shocks. 
. 
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1984q1 to 2006q4
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. 
. eststo clear
{txt}
{com}. 
. foreach Inf in CPIAU CPICore PCEPI{c -(} 
{txt}  2{com}.    reg Inf1y_`Inf' l(1/4).Inf1y_`Inf' l(0/1).pty_shock l(0/1).op_shock l(0/1).mp1ut_shock l(0/1).ED8ut_shock
{txt}  3{com}.    predict `Inf'_uid_shock, residual
{txt}  4{com}.    label var `Inf'_uid_shock "Unidentified shocks to inflation"
{txt}  5{com}.  {c )-}

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}      51
{txt}{hline 13}{char +}{hline 30}           F( 12,    38) ={res}   15.97
    {txt}   Model {char |} {res}  25.542958    12  2.12857984           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 5.06411814    38  .133266267           {txt}R-squared     = {res} 0.8345
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.7823
    {txt}   Total {char |} {res} 30.6070762    50  .612141523           {txt}Root MSE      = {res} .36506

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} Inf1y_CPIAU{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}Inf1y_CPIAU {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .3790326{col 26}{space 2} .1053336{col 37}{space 1}    3.60{col 46}{space 3}0.001{col 54}{space 4} .1657958{col 67}{space 3} .5922694
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .3395557{col 26}{space 2} .1009893{col 37}{space 1}    3.36{col 46}{space 3}0.002{col 54}{space 4} .1351135{col 67}{space 3} .5439979
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}  .456208{col 26}{space 2} .1114394{col 37}{space 1}    4.09{col 46}{space 3}0.000{col 54}{space 4} .2306106{col 67}{space 3} .6818053
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.7331456{col 26}{space 2} .1113144{col 37}{space 1}   -6.59{col 46}{space 3}0.000{col 54}{space 4}-.9584899{col 67}{space 3}-.5078013
{txt}{space 12} {c |}
{space 3}pty_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.1910123{col 26}{space 2} .0857014{col 37}{space 1}   -2.23{col 46}{space 3}0.032{col 54}{space 4}-.3645058{col 67}{space 3}-.0175189
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}  -.21257{col 26}{space 2}  .066737{col 37}{space 1}   -3.19{col 46}{space 3}0.003{col 54}{space 4} -.347672{col 67}{space 3}-.0774679
{txt}{space 12} {c |}
{space 4}op_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .2499287{col 26}{space 2} .0587308{col 37}{space 1}    4.26{col 46}{space 3}0.000{col 54}{space 4} .1310343{col 67}{space 3} .3688231
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.0460754{col 26}{space 2} .0672329{col 37}{space 1}   -0.69{col 46}{space 3}0.497{col 54}{space 4}-.1821813{col 67}{space 3} .0900305
{txt}{space 12} {c |}
{space 1}mp1ut_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.1564882{col 26}{space 2} .0676429{col 37}{space 1}   -2.31{col 46}{space 3}0.026{col 54}{space 4}-.2934241{col 67}{space 3}-.0195523
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .0026983{col 26}{space 2} .0791264{col 37}{space 1}    0.03{col 46}{space 3}0.973{col 54}{space 4}-.1574848{col 67}{space 3} .1628814
{txt}{space 12} {c |}
{space 1}ED8ut_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .0975737{col 26}{space 2} .0534427{col 37}{space 1}    1.83{col 46}{space 3}0.076{col 54}{space 4}-.0106153{col 67}{space 3} .2057627
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .0421561{col 26}{space 2} .0550625{col 37}{space 1}    0.77{col 46}{space 3}0.449{col 54}{space 4}-.0693121{col 67}{space 3} .1536242
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.261548{col 26}{space 2} .2630713{col 37}{space 1}    4.80{col 46}{space 3}0.000{col 54}{space 4} .7289878{col 67}{space 3} 1.794108
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(41 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      51
{txt}{hline 13}{char +}{hline 30}           F( 12,    38) ={res}   17.30
    {txt}   Model {char |} {res} 8.52973727    12  .710811439           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 1.56118387    38  .041083786           {txt}R-squared     = {res} 0.8453
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.7964
    {txt}   Total {char |} {res} 10.0909211    50  .201818423           {txt}Root MSE      = {res} .20269

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Inf1y_CPICore{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Inf1y_CPICore {c |}
{space 10}L1. {c |}{col 15}{res}{space 2} .8751241{col 27}{space 2} .1560184{col 38}{space 1}    5.61{col 47}{space 3}0.000{col 55}{space 4} .5592813{col 68}{space 3} 1.190967
{txt}{space 10}L2. {c |}{col 15}{res}{space 2}-.0639474{col 27}{space 2} .2160089{col 38}{space 1}   -0.30{col 47}{space 3}0.769{col 55}{space 4}-.5012346{col 68}{space 3} .3733399
{txt}{space 10}L3. {c |}{col 15}{res}{space 2} .2078686{col 27}{space 2}  .210843{col 38}{space 1}    0.99{col 47}{space 3}0.330{col 55}{space 4}-.2189607{col 68}{space 3} .6346979
{txt}{space 10}L4. {c |}{col 15}{res}{space 2}-.2358018{col 27}{space 2} .1579692{col 38}{space 1}   -1.49{col 47}{space 3}0.144{col 55}{space 4}-.5555937{col 68}{space 3} .0839901
{txt}{space 13} {c |}
{space 4}pty_shock {c |}
{space 10}--. {c |}{col 15}{res}{space 2}-.0845798{col 27}{space 2} .0460984{col 38}{space 1}   -1.83{col 47}{space 3}0.074{col 55}{space 4}-.1779011{col 68}{space 3} .0087415
{txt}{space 10}L1. {c |}{col 15}{res}{space 2}-.0452931{col 27}{space 2} .0401028{col 38}{space 1}   -1.13{col 47}{space 3}0.266{col 55}{space 4} -.126477{col 68}{space 3} .0358908
{txt}{space 13} {c |}
{space 5}op_shock {c |}
{space 10}--. {c |}{col 15}{res}{space 2} .0162525{col 27}{space 2}  .034776{col 38}{space 1}    0.47{col 47}{space 3}0.643{col 55}{space 4}-.0541478{col 68}{space 3} .0866529
{txt}{space 10}L1. {c |}{col 15}{res}{space 2}-.0194725{col 27}{space 2} .0333123{col 38}{space 1}   -0.58{col 47}{space 3}0.562{col 55}{space 4}-.0869098{col 68}{space 3} .0479647
{txt}{space 13} {c |}
{space 2}mp1ut_shock {c |}
{space 10}--. {c |}{col 15}{res}{space 2}-.0634424{col 27}{space 2} .0376255{col 38}{space 1}   -1.69{col 47}{space 3}0.100{col 55}{space 4}-.1396112{col 68}{space 3} .0127264
{txt}{space 10}L1. {c |}{col 15}{res}{space 2} .0120416{col 27}{space 2} .0440593{col 38}{space 1}    0.27{col 47}{space 3}0.786{col 55}{space 4}-.0771519{col 68}{space 3} .1012351
{txt}{space 13} {c |}
{space 2}ED8ut_shock {c |}
{space 10}--. {c |}{col 15}{res}{space 2} .0179684{col 27}{space 2} .0297946{col 38}{space 1}    0.60{col 47}{space 3}0.550{col 55}{space 4}-.0423477{col 68}{space 3} .0782845
{txt}{space 10}L1. {c |}{col 15}{res}{space 2} .0666291{col 27}{space 2} .0298987{col 38}{space 1}    2.23{col 47}{space 3}0.032{col 55}{space 4} .0061024{col 68}{space 3} .1271558
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .5062778{col 27}{space 2} .2095381{col 38}{space 1}    2.42{col 47}{space 3}0.021{col 55}{space 4} .0820901{col 68}{space 3} .9304656
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(41 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      51
{txt}{hline 13}{char +}{hline 30}           F( 12,    38) ={res}   17.78
    {txt}   Model {char |} {res} 20.0872683    12  1.67393902           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 3.57680936    38  .094126562           {txt}R-squared     = {res} 0.8489
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.8011
    {txt}   Total {char |} {res} 23.6640777    50  .473281553           {txt}Root MSE      = {res}  .3068

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} Inf1y_PCEPI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}Inf1y_PCEPI {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .4109787{col 26}{space 2} .1239913{col 37}{space 1}    3.31{col 46}{space 3}0.002{col 54}{space 4} .1599715{col 67}{space 3} .6619859
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}  .364777{col 26}{space 2}  .121878{col 37}{space 1}    2.99{col 46}{space 3}0.005{col 54}{space 4} .1180479{col 67}{space 3}  .611506
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}  .399865{col 26}{space 2} .1320872{col 37}{space 1}    3.03{col 46}{space 3}0.004{col 54}{space 4} .1324683{col 67}{space 3} .6672616
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.6083786{col 26}{space 2} .1296876{col 37}{space 1}   -4.69{col 46}{space 3}0.000{col 54}{space 4}-.8709174{col 67}{space 3}-.3458399
{txt}{space 12} {c |}
{space 3}pty_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.1119658{col 26}{space 2} .0744564{col 37}{space 1}   -1.50{col 46}{space 3}0.141{col 54}{space 4}-.2626949{col 67}{space 3} .0387634
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.1808351{col 26}{space 2} .0562939{col 37}{space 1}   -3.21{col 46}{space 3}0.003{col 54}{space 4}-.2947961{col 67}{space 3}-.0668741
{txt}{space 12} {c |}
{space 4}op_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}  .201616{col 26}{space 2} .0507525{col 37}{space 1}    3.97{col 46}{space 3}0.000{col 54}{space 4} .0988729{col 67}{space 3}  .304359
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} -.072149{col 26}{space 2} .0579461{col 37}{space 1}   -1.25{col 46}{space 3}0.221{col 54}{space 4}-.1894547{col 67}{space 3} .0451566
{txt}{space 12} {c |}
{space 1}mp1ut_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.0856222{col 26}{space 2} .0565828{col 37}{space 1}   -1.51{col 46}{space 3}0.138{col 54}{space 4}-.2001681{col 67}{space 3} .0289237
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .0875615{col 26}{space 2} .0648813{col 37}{space 1}    1.35{col 46}{space 3}0.185{col 54}{space 4}-.0437839{col 67}{space 3} .2189069
{txt}{space 12} {c |}
{space 1}ED8ut_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .0598629{col 26}{space 2}  .045938{col 37}{space 1}    1.30{col 46}{space 3}0.200{col 54}{space 4}-.0331338{col 67}{space 3} .1528596
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} -.000839{col 26}{space 2}  .046228{col 37}{space 1}   -0.02{col 46}{space 3}0.986{col 54}{space 4}-.0944226{col 67}{space 3} .0927447
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .7766372{col 26}{space 2} .1842547{col 37}{space 1}    4.22{col 46}{space 3}0.000{col 54}{space 4} .4036331{col 67}{space 3} 1.149641
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(41 missing values generated)

{com}. 
. ddd
{err}unrecognized command:  ddd
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. tsline SPFCPI_Var
{res}
{com}. 