{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/ExpProject/workingfolder/irf_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 6 Sep 2020, 13:38:06
{txt}
{com}. 
. 
. **************************************************
. *** Clean inflation shock data from Python for  **
. *** both quarterly and monthly                 ***
. **************************************************
. 
. 
. *******************************************
. * Generate monthly inflation shock data   *
. *******************************************
. 
. import excel "${c -(}mainfolder{c )-}/OtherData/2MPShocksJW.xls", sheet("data") firstrow allstring clear
{res}{txt}
{com}. 
. gen date = daily(Date,"MDY")
{txt}
{com}. drop Date
{txt}
{com}. gen year = year(date)
{txt}
{com}. gen month = month(date)
{txt}
{com}. gen date_str=string(year)+"M"+string(month)
{txt}
{com}. gen dateM = monthly(date_str,"YM")
{txt}
{com}. 
. 
. rename date dateD
{res}{txt}
{com}. rename dateM date
{res}{txt}
{com}. format date %tm
{txt}
{com}. 
. keep year month date dateD MP1 ED4 ED8
{txt}
{com}. sort date dateD year month MP1 ED4 ED8
{txt}
{com}. 
. foreach var in MP1 ED4 ED8{c -(}
{txt}  2{com}. destring `var',force replace 
{txt}  3{com}. egen `var'M = sum(`var'), by(year month) 
{txt}  4{com}. label var `var'M "Cumulated sum of `var'"
{txt}  5{com}. drop `var'
{txt}  6{com}. rename `var'M `var'
{txt}  7{com}. {c )-}
{txt}MP1 contains nonnumeric characters; {res}replaced {txt}as {res}double
{txt}(61 missing values generated)
{res}{txt}ED4 contains nonnumeric characters; {res}replaced {txt}as {res}double
{txt}ED8 contains nonnumeric characters; {res}replaced {txt}as {res}double
{txt}(126 missing values generated)
{res}{txt}
{com}. 
. duplicates drop year month,force 

{p 0 4}{txt}Duplicates in terms of {res} year month{p_end}

{txt}(39 observations deleted)

{com}. 
. ** Complete all months in the sameple since MP shocks are only recorded for some months
. 
. tsset date 
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1984m2 to 2019m3, but with gaps
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. 
. tsfill
{txt}
{com}. replace year = yofd(dofm(date))
{txt}(121 real changes made)

{com}. replace month = month(dofm(date))
{txt}(121 real changes made)

{com}. 
. sort date
{txt}
{com}. 
. foreach var in MP1 ED4 ED8{c -(}
{txt}  2{com}.    replace `var'=0 if `var'==.
{txt}  3{com}. {c )-}
{txt}(121 real changes made)
(121 real changes made)
(121 real changes made)

{com}. 
. 
. duplicates report date 

{p 0 4}{txt}Duplicates in terms of {res} date{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}          {res}422             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. save "${c -(}mainfolder{c )-}/OtherData/MPShocksM.dta",replace 
{txt}(note: file /Users/Myworld/Dropbox/ExpProject/workingfolder/OtherData/MPShocksM.dta not found)
file /Users/Myworld/Dropbox/ExpProject/workingfolder/OtherData/MPShocksM.dta saved

{com}. 
. 
. *************************
. **  Oil Price Shock *****
. **************************
. 
. clear
{txt}
{com}. 
. import excel "${c -(}mainfolder{c )-}/OtherData/OilShock.xls", sheet("data") firstrow allstring clear
{res}{txt}
{com}. 
. keep observation_date OPShock
{txt}
{com}. 
. destring(OPShock),force replace 
{txt}OPShock contains nonnumeric characters; {res}replaced {txt}as {res}double
{txt}(12 missing values generated)

{com}. 
. gen date = daily(observation_date,"MDY")
{txt}
{com}. gen year = year(date) 
{txt}
{com}. gen month =month(date) 
{txt}
{com}. 
. gen date_str=string(year)+"M"+string(month)
{txt}
{com}. gen dateM = monthly(date_str,"YM")
{txt}
{com}. 
. drop date
{txt}
{com}. rename dateM date
{res}{txt}
{com}. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, -168 to 711
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. format date %tm
{txt}
{com}. 
. ** Normalize Oil shock
. 
. egen OPShock_sd = sd(OPShock)
{txt}
{com}. gen OPShock_nom = OPShock/OPShock_sd
{txt}(12 missing values generated)

{com}. label var OPShock_nom "Oil price shock(normalized)"
{txt}
{com}. 
. 
. 
. save "${c -(}mainfolder{c )-}/OtherData/OPShocksM.dta",replace 
{txt}(note: file /Users/Myworld/Dropbox/ExpProject/workingfolder/OtherData/OPShocksM.dta not found)
file /Users/Myworld/Dropbox/ExpProject/workingfolder/OtherData/OPShocksM.dta saved

{com}. 
. **************************************
. ***  Merge Shocks and Inflation *****
. **************************************
. 
. merge 1:1 year month using "${c -(}mainfolder{c )-}/OtherData/MPShocksM.dta",keep(master match)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             458
{txt}{col 9}from master{col 30}{res}             458{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             422{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge MPshock_merge
{res}{txt}
{com}. 
. 
. * Merge with inflation 
. merge 1:1 year month using "${c -(}mainfolder{c )-}/OtherData/InfM.dta",keep(match master using)
{res}{txt}(label _merge already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              22
{txt}{col 9}from master{col 30}{res}              12{txt}  (_merge==1)
{col 9}from using{col 30}{res}              10{txt}  (_merge==2)

{col 5}matched{col 30}{res}             868{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge InfM_merge 
{res}{txt}
{com}. 
. ddd
{err}unrecognized command:  ddd
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. clear

. do "/Users/Myworld/Dropbox/ExpProject/workingfolder/DoFile/Step00_InflationData.do"
{txt}
{com}. 
. 
. ******************************************
. ** Importing and cleaning inflation series 
. ******************************************
. clear
{txt}
{com}. 
. 
. global mainfolder "/Users/Myworld/Dropbox/ExpProject/workingfolder"
{txt}
{com}. global folder "${c -(}mainfolder{c )-}/SurveyData/"
{txt}
{com}. global surveyfolder "NYFEDSurvey"
{txt}
{com}. global otherdatafolder "OtherData"
{txt}
{com}. global sum_graph_folder "${c -(}mainfolder{c )-}/${c -(}otherdatafolder{c )-}"
{txt}
{com}. 
. 
. 
. cd "${c -(}mainfolder{c )-}/${c -(}otherdatafolder{c )-}"
{res}/Users/Myworld/Dropbox/ExpProject/workingfolder/OtherData
{txt}
{com}. 
. import excel "${c -(}mainfolder{c )-}/${c -(}otherdatafolder{c )-}/CPI&CPICoreIdxM.xls", sheet("FRED Graph") cellrange(A12:C890) firstrow
{res}{txt}
{com}. rename observation_date date
{res}{txt}
{com}. gen month=month(date)
{txt}
{com}. gen year = year(date)
{txt}
{com}. gen date_str=string(year)+"m"+string(month)
{txt}
{com}. gen date2=monthly(date_str,"YM")
{txt}
{com}. format date2 %tm
{txt}
{com}. drop date_str date 
{txt}
{com}. rename date2 date 
{res}{txt}
{com}. label var CPIAUCSL "CPI index for all urban households(seasonally adjusted)"
{txt}
{com}. label var CPILFESL "CPI index for all urban households excl food and energy (seaonsally adjusted)"
{txt}
{com}. 
. rename CPIAUCSL CPIAU
{res}{txt}
{com}. rename CPILFESL CPICore
{res}{txt}
{com}. 
. order date year month
{txt}
{com}.  
. save CPICPICore.dta,replace
{txt}file CPICPICore.dta saved

{com}. 
. 
. clear
{txt}
{com}. import excel "${c -(}mainfolder{c )-}/${c -(}otherdatafolder{c )-}/PCEIdxM.xls", sheet("FRED Graph") cellrange(A11:B744) firstrow
{res}{txt}
{com}. rename observation_date date
{res}{txt}
{com}. gen month=month(date)
{txt}
{com}. gen year = year(date)
{txt}
{com}. gen date_str=string(year)+"m"+string(month)
{txt}
{com}. gen date2=monthly(date_str,"YM")
{txt}
{com}. format date2 %tm
{txt}
{com}. drop date_str date
{txt}
{com}. rename date2 date 
{res}{txt}
{com}. order date year month 
{txt}
{com}. rename PCEPI PCE
{res}{txt}
{com}. label var PCE "PCE index: chain-type (sesonally adjusted)"
{txt}
{com}. save PCEIdx.dta,replace
{txt}file PCEIdx.dta saved

{com}. clear
{txt}
{com}. 
. 
. clear
{txt}
{com}. import excel "${c -(}mainfolder{c )-}/${c -(}otherdatafolder{c )-}/PCEPILFE.xls", sheet("FRED Graph") cellrange(A11:B744) firstrow
{res}{txt}
{com}. 
. rename observation_date date
{res}{txt}
{com}. gen month=month(date)
{txt}
{com}. gen year = year(date)
{txt}
{com}. gen date_str=string(year)+"m"+string(month)
{txt}
{com}. gen date2=monthly(date_str,"YM")
{txt}
{com}. format date2 %tm
{txt}
{com}. drop date_str date
{txt}
{com}. rename date2 date 
{res}{txt}
{com}. order date year month 
{txt}
{com}. rename PCEPILFE PCECore
{res}{txt}
{com}. label var PCECore "PCE index: chain-type exl food and energe(sesonally adjusted)"
{txt}
{com}. save CPCEIdx.dta,replace
{txt}file CPCEIdx.dta saved

{com}. clear
{txt}
{com}. 
. ** merge information 
. 
. use "${c -(}mainfolder{c )-}/${c -(}otherdatafolder{c )-}/CPICPICore.dta",clear 
{txt}
{com}. 
. merge 1:1 date using "${c -(}mainfolder{c )-}/${c -(}otherdatafolder{c )-}/PCEIdx.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             145
{txt}{col 9}from master{col 30}{res}             145{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             733{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. rename _merge PCEPI_merge
{res}{txt}
{com}. 
. merge 1:1 date using "${c -(}mainfolder{c )-}/${c -(}otherdatafolder{c )-}/CPCEIdx.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             145
{txt}{col 9}from master{col 30}{res}             145{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             733{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. rename _merge CPCEPI_merge 
{res}{txt}
{com}. 
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1947m1 to 2020m2
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. 
. 
. foreach var in  CPIAU CPICore PCE PCECore{c -(}
{txt}  2{com}.    
.    ** computing yoy inflation and foreward inflation
.    gen Inf1y_`var' = (`var'- l12.`var')*100/l12.`var'
{txt}  3{com}.    label var Inf1y_`var' "yoy inflation based on `var'"
{txt}  4{com}.    gen Inf1yf_`var' = (f12.`var'- `var')*100/`var'
{txt}  5{com}.    label var Inf1yf_`var' "1-year-ahead realized inflation"
{txt}  6{com}.      
. {c )-}
{txt}(12 missing values generated)
(12 missing values generated)
(132 missing values generated)
(132 missing values generated)
(157 missing values generated)
(157 missing values generated)
(157 missing values generated)
(157 missing values generated)

{com}. 
. 
. *********************************
. **   Plot Inflation Series *****
. *********************************
. 
. 
. tsline Inf1y_CPIAU Inf1y_CPICore Inf1y_PCE Inf1y_PCECore, title("Annual Inflation of the U.S.") legend(label(1 "Headline CPI") label(2 "Core CPI") label(3 "PCE") label(4 "Core PCE"))
{res}{txt}
{com}. graph export "${c -(}mainfolder{c )-}/${c -(}otherdatafolder{c )-}/Inflation", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/ExpProject/workingfolder/OtherData/Inflation written in PNG format)

{com}. 
. save InfM,replace 
{txt}file InfM.dta saved

{com}. 
{txt}end of do-file

{com}. clear

. 