{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/ExpProject/workingfolder/irf_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}11 Jun 2019, 17:20:21
{txt}
{com}. 
. 
. **********************************************
. *** Clean Inflation Shock data from Python ***
. **********************************************
. 
. use "${c -(}mainfolder{c )-}/OtherData/InfShocks.dta",clear 
{txt}
{com}. 
. drop index 
{txt}
{com}. 
. *** Date 
. gen date_str=string(year)+"Q"+string(quarter) 
{txt}
{com}. 
. gen date = quarterly(date_str,"YQ")
{txt}
{com}. format date %tq 
{txt}
{com}. 
. drop date_str
{txt}
{com}. 
. order date year quarter month
{txt}
{com}. 
. ** Time series 
. 
. tsset date 
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1984q1 to 2018q4
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. 
. ** Merge with survey and inflation  
. 
. merge 1:1 year quarter using "${c -(}folder{c )-}/InfExpQ.dta",keep(match using master)
{res}{txt}{p 0 7 2}
(note: variable
year was 
long, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
quarter was 
long, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             146
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}             146{txt}  (_merge==2)

{col 5}matched{col 30}{res}             140{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge InfExp_merge
{res}{txt}
{com}. 
. drop if month==. 
{txt}(146 observations deleted)

{com}. drop if quarter ==.
{txt}(0 observations deleted)

{com}. 
. merge 1:1 year month using "${c -(}mainfolder{c )-}/OtherData/InfM.dta",keep(match master)
{res}{txt}{p 0 7 2}
(note: variable
month was 
long, now double to accommodate using data's values)
{p_end}
(label _merge already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             140{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge InfM_merge 
{res}{txt}
{com}. 
. ** Label and rename
. 
. label var pty_shock "Technology shock(Gali 1999)"
{txt}
{com}. label var hours_shock "Non-technology shock(Gali 1999)"
{txt}
{com}. label var inf_shock "Shock to inflation(Gali 1999)"
{txt}
{com}. label var pty_shock_max "Technology shock (Francis etal 2014)"
{txt}
{com}. label var news_shock "News shock(Sims etal.2011)"
{txt}
{com}. rename OPShock_nm op_shock 
{res}{txt}
{com}. label var op_shock "Oil price shock (Hamilton 1996)"
{txt}
{com}. rename MP1 mp1_shock
{res}{txt}
{com}. label var mp1_shock "Unexpected change in federal funds rate(%)"
{txt}
{com}. label var ED4 "1-year ahead future-implied change in federal funds rate(%)"
{txt}
{com}. label var ED8 "2-year ahead future-implied change in federal funds rate(%)"
{txt}
{com}. 
. ** MP-path shock 
. 
. foreach ed in ED4 ED8{c -(}
{txt}  2{com}.   reg `ed' mp1_shock
{txt}  3{com}.   predict `ed'_shock, residual
{txt}  4{com}. label var `ed'_shock "Unexpected shock to future federal funds rate(%)"
{txt}  5{com}. {c )-}

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}     121
{txt}{hline 13}{char +}{hline 30}           F(  1,   119) ={res}   21.17
    {txt}   Model {char |} {res}  .22003407     1   .22003407           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 1.23701593   119  .010395092           {txt}R-squared     = {res} 0.1510
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.1439
    {txt}   Total {char |} {res}    1.45705   120  .012142083           {txt}Root MSE      = {res} .10196

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         ED4{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}mp1_shock {c |}{col 14}{res}{space 2} .3596785{col 26}{space 2} .0781778{col 37}{space 1}    4.60{col 46}{space 3}0.000{col 54}{space 4} .2048786{col 67}{space 3} .5144785
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0109294{col 26}{space 2} .0097298{col 37}{space 1}   -1.12{col 46}{space 3}0.264{col 54}{space 4}-.0301953{col 67}{space 3} .0083366
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(19 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}     100
{txt}{hline 13}{char +}{hline 30}           F(  1,    98) ={res}    1.91
    {txt}   Model {char |} {res} .022918019     1  .022918019           {txt}Prob > F      = {res} 0.1704
    {txt}Residual {char |} {res} 1.17762183    98  .012016549           {txt}R-squared     = {res} 0.0191
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0091
    {txt}   Total {char |} {res} 1.20053985    99  .012126665           {txt}Root MSE      = {res} .10962

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         ED8{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}mp1_shock {c |}{col 14}{res}{space 2} .1493479{col 26}{space 2} .1081435{col 37}{space 1}    1.38{col 46}{space 3}0.170{col 54}{space 4}-.0652594{col 67}{space 3} .3639551
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0148961{col 26}{space 2}   .01126{col 37}{space 1}   -1.32{col 46}{space 3}0.189{col 54}{space 4}-.0372413{col 67}{space 3}  .007449
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(40 missing values generated)

{com}. 
. 
. 
. ** Generated unidentified shocks. 
. 
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1984q1 to 2018q4
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. 
. eststo clear
{txt}
{com}. 
. foreach Inf in CPIAU CPICore PCEPI{c -(} 
{txt}  2{com}.    reg Inf1y_`Inf' l(1/4).Inf1y_`Inf' l(0/1).pty_shock l(0/1).op_shock l(0/1).mp1_shock l(0/1).ED8_shock
{txt}  3{com}.    predict `Inf'_uid_shock, residual
{txt}  4{com}.    label var `Inf'_uid_shock "Unidentified shocks to inflation"
{txt}  5{com}.  {c )-}

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}      99
{txt}{hline 13}{char +}{hline 30}           F( 12,    86) ={res}   13.24
    {txt}   Model {char |} {res} 86.2529482    12  7.18774569           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 46.6984119    86  .543004789           {txt}R-squared     = {res} 0.6488
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.5997
    {txt}   Total {char |} {res}  132.95136    98  1.35664653           {txt}Root MSE      = {res} .73689

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} Inf1y_CPIAU{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}Inf1y_CPIAU {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .5691486{col 26}{space 2} .1074395{col 37}{space 1}    5.30{col 46}{space 3}0.000{col 54}{space 4} .3555659{col 67}{space 3} .7827313
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0210417{col 26}{space 2} .1184549{col 37}{space 1}    0.18{col 46}{space 3}0.859{col 54}{space 4}-.2144388{col 67}{space 3} .2565223
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1725765{col 26}{space 2} .1186843{col 37}{space 1}    1.45{col 46}{space 3}0.150{col 54}{space 4}-.0633601{col 67}{space 3} .4085132
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.2093588{col 26}{space 2} .0944661{col 37}{space 1}   -2.22{col 46}{space 3}0.029{col 54}{space 4}-.3971512{col 67}{space 3}-.0215664
{txt}{space 12} {c |}
{space 3}pty_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.1586146{col 26}{space 2} .1082381{col 37}{space 1}   -1.47{col 46}{space 3}0.146{col 54}{space 4}-.3737849{col 67}{space 3} .0565556
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} -.096206{col 26}{space 2} .1023788{col 37}{space 1}   -0.94{col 46}{space 3}0.350{col 54}{space 4}-.2997284{col 67}{space 3} .1073164
{txt}{space 12} {c |}
{space 4}op_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .3063532{col 26}{space 2} .0869153{col 37}{space 1}    3.52{col 46}{space 3}0.001{col 54}{space 4} .1335712{col 67}{space 3} .4791351
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .1197119{col 26}{space 2} .0931144{col 37}{space 1}    1.29{col 46}{space 3}0.202{col 54}{space 4}-.0653934{col 67}{space 3} .3048173
{txt}{space 12} {c |}
{space 3}mp1_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .4833994{col 26}{space 2} .7894855{col 37}{space 1}    0.61{col 46}{space 3}0.542{col 54}{space 4}-1.086046{col 67}{space 3} 2.052845
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.9491461{col 26}{space 2} .8072769{col 37}{space 1}   -1.18{col 46}{space 3}0.243{col 54}{space 4}-2.553959{col 67}{space 3} .6556673
{txt}{space 12} {c |}
{space 3}ED8_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} 1.219421{col 26}{space 2} .7521387{col 37}{space 1}    1.62{col 46}{space 3}0.109{col 54}{space 4}-.2757815{col 67}{space 3} 2.714623
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.3836723{col 26}{space 2} .7853607{col 37}{space 1}   -0.49{col 46}{space 3}0.626{col 54}{space 4}-1.944918{col 67}{space 3} 1.177573
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}   .66395{col 26}{space 2}  .221371{col 37}{space 1}    3.00{col 46}{space 3}0.004{col 54}{space 4} .2238789{col 67}{space 3} 1.104021
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(41 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      99
{txt}{hline 13}{char +}{hline 30}           F( 12,    86) ={res}   34.55
    {txt}   Model {char |} {res} 19.4293656    12   1.6191138           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 4.03004629    86  .046861003           {txt}R-squared     = {res} 0.8282
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.8042
    {txt}   Total {char |} {res} 23.4594119    98  .239381754           {txt}Root MSE      = {res} .21647

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Inf1y_CPICore{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Inf1y_CPICore {c |}
{space 10}L1. {c |}{col 15}{res}{space 2} .9882084{col 27}{space 2} .1147678{col 38}{space 1}    8.61{col 47}{space 3}0.000{col 55}{space 4} .7600575{col 68}{space 3} 1.216359
{txt}{space 10}L2. {c |}{col 15}{res}{space 2}-.0510983{col 27}{space 2} .1630388{col 38}{space 1}   -0.31{col 47}{space 3}0.755{col 55}{space 4}-.3752087{col 68}{space 3} .2730122
{txt}{space 10}L3. {c |}{col 15}{res}{space 2} .1103214{col 27}{space 2} .1547724{col 38}{space 1}    0.71{col 47}{space 3}0.478{col 55}{space 4}-.1973559{col 68}{space 3} .4179988
{txt}{space 10}L4. {c |}{col 15}{res}{space 2}-.1719145{col 27}{space 2} .1032382{col 38}{space 1}   -1.67{col 47}{space 3}0.100{col 55}{space 4}-.3771453{col 68}{space 3} .0333163
{txt}{space 13} {c |}
{space 4}pty_shock {c |}
{space 10}--. {c |}{col 15}{res}{space 2}-.0610438{col 27}{space 2} .0327464{col 38}{space 1}   -1.86{col 47}{space 3}0.066{col 55}{space 4}-.1261414{col 68}{space 3} .0040539
{txt}{space 10}L1. {c |}{col 15}{res}{space 2}-.0198286{col 27}{space 2}  .031072{col 38}{space 1}   -0.64{col 47}{space 3}0.525{col 55}{space 4}-.0815977{col 68}{space 3} .0419405
{txt}{space 13} {c |}
{space 5}op_shock {c |}
{space 10}--. {c |}{col 15}{res}{space 2} .0607946{col 27}{space 2}  .026395{col 38}{space 1}    2.30{col 47}{space 3}0.024{col 55}{space 4}  .008323{col 68}{space 3} .1132661
{txt}{space 10}L1. {c |}{col 15}{res}{space 2} .0067052{col 27}{space 2}  .026437{col 38}{space 1}    0.25{col 47}{space 3}0.800{col 55}{space 4}-.0458498{col 68}{space 3} .0592603
{txt}{space 13} {c |}
{space 4}mp1_shock {c |}
{space 10}--. {c |}{col 15}{res}{space 2}-.0777729{col 27}{space 2} .2344306{col 38}{space 1}   -0.33{col 47}{space 3}0.741{col 55}{space 4}-.5438055{col 68}{space 3} .3882596
{txt}{space 10}L1. {c |}{col 15}{res}{space 2}-.0994242{col 27}{space 2} .2406194{col 38}{space 1}   -0.41{col 47}{space 3}0.680{col 55}{space 4}-.5777596{col 68}{space 3} .3789113
{txt}{space 13} {c |}
{space 4}ED8_shock {c |}
{space 10}--. {c |}{col 15}{res}{space 2}-.0698045{col 27}{space 2} .2183988{col 38}{space 1}   -0.32{col 47}{space 3}0.750{col 55}{space 4}-.5039668{col 68}{space 3} .3643579
{txt}{space 10}L1. {c |}{col 15}{res}{space 2} .0199073{col 27}{space 2} .2243776{col 38}{space 1}    0.09{col 47}{space 3}0.930{col 55}{space 4}-.4261406{col 68}{space 3} .4659552
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .2013513{col 27}{space 2} .1176176{col 38}{space 1}    1.71{col 47}{space 3}0.091{col 55}{space 4}-.0324647{col 68}{space 3} .4351673
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(41 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      99
{txt}{hline 13}{char +}{hline 30}           F( 12,    86) ={res}   16.21
    {txt}   Model {char |} {res} 54.4071369    12  4.53392807           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res}  24.046811    86  .279614081           {txt}R-squared     = {res} 0.6935
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.6507
    {txt}   Total {char |} {res} 78.4539478    98  .800550488           {txt}Root MSE      = {res} .52879

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} Inf1y_PCEPI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}Inf1y_PCEPI {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .6505327{col 26}{space 2} .1100486{col 37}{space 1}    5.91{col 46}{space 3}0.000{col 54}{space 4} .4317632{col 67}{space 3} .8693021
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0384709{col 26}{space 2} .1253254{col 37}{space 1}   -0.31{col 46}{space 3}0.760{col 54}{space 4}-.2876095{col 67}{space 3} .2106676
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1267602{col 26}{space 2}  .125449{col 37}{space 1}    1.01{col 46}{space 3}0.315{col 54}{space 4}-.1226243{col 67}{space 3} .3761446
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.1636981{col 26}{space 2} .0950674{col 37}{space 1}   -1.72{col 46}{space 3}0.089{col 54}{space 4}-.3526859{col 67}{space 3} .0252897
{txt}{space 12} {c |}
{space 3}pty_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.0969642{col 26}{space 2} .0771478{col 37}{space 1}   -1.26{col 46}{space 3}0.212{col 54}{space 4} -.250329{col 67}{space 3} .0564006
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.1089007{col 26}{space 2} .0726187{col 37}{space 1}   -1.50{col 46}{space 3}0.137{col 54}{space 4}-.2532619{col 67}{space 3} .0354604
{txt}{space 12} {c |}
{space 4}op_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .2400242{col 26}{space 2}   .06228{col 37}{space 1}    3.85{col 46}{space 3}0.000{col 54}{space 4} .1162156{col 67}{space 3} .3638328
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .0618353{col 26}{space 2} .0674198{col 37}{space 1}    0.92{col 46}{space 3}0.362{col 54}{space 4}-.0721908{col 67}{space 3} .1958615
{txt}{space 12} {c |}
{space 3}mp1_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .5552419{col 26}{space 2} .5656136{col 37}{space 1}    0.98{col 46}{space 3}0.329{col 54}{space 4}-.5691608{col 67}{space 3} 1.679645
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.3018604{col 26}{space 2} .5808361{col 37}{space 1}   -0.52{col 46}{space 3}0.605{col 54}{space 4}-1.456524{col 67}{space 3} .8528036
{txt}{space 12} {c |}
{space 3}ED8_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .6391422{col 26}{space 2} .5409534{col 37}{space 1}    1.18{col 46}{space 3}0.241{col 54}{space 4}-.4362376{col 67}{space 3} 1.714522
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.2262274{col 26}{space 2} .5577984{col 37}{space 1}   -0.41{col 46}{space 3}0.686{col 54}{space 4}-1.335094{col 67}{space 3}  .882639
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .5505704{col 26}{space 2} .1606296{col 37}{space 1}    3.43{col 46}{space 3}0.001{col 54}{space 4} .2312493{col 67}{space 3} .8698916
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(41 missing values generated)

{com}. 
. ** Plot all shocks for checking 
. 
. twoway (tsline pty_shock) (tsline op_shock) ///
>         (tsline mp1_shock) (tsline ED8_shock) ///
>                 (tsline CPIAU_uid_shock), ///
>                 title("Shocks to Inflation",size(6)) ///
>                 xtitle("Time") ytitle("") ///
>                 legend(cols(1)) 
{res}{txt}
{com}.                 
. graph export "${c -(}sum_graph_folder{c )-}/inf_shocksQ", as(png) replace
{txt}(file /Users/Myworld/Dropbox/ExpProject/workingfolder/graphs/pop/inf_shocksQ written in PNG format)

{com}. 
. 
. ** First-run of inflation 
. 
. eststo clear
{txt}
{com}. foreach sk in pty op mp1 ED4 ED8 {c -(}
{txt}  2{com}.   foreach Inf in CPIAU CPICore PCEPI{c -(} 
{txt}  3{com}.    eststo `Inf'_`sk': reg Inf1y_`Inf' l(0/1).`sk'_shock, robust
{txt}  4{com}.    eststo `Inf'_uid: reg Inf1y_`Inf' l(0/1).`Inf'_uid_shock,robust 
{txt}  5{com}.  {c )-}
{txt}  6{com}. {c )-}

{txt}Linear regression                                      Number of obs ={res}     139
                                                       {txt}F(  2,   136) ={res}    0.19
                                                       {txt}Prob > F      = {res} 0.8242
                                                       {txt}R-squared     = {res} 0.0029
                                                       {txt}Root MSE      = {res} 1.3425

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} Inf1y_CPIAU{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}pty_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .0170092{col 26}{space 2}  .143705{col 37}{space 1}    0.12{col 46}{space 3}0.906{col 54}{space 4}-.2671761{col 67}{space 3} .3011945
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.0900085{col 26}{space 2}   .14987{col 37}{space 1}   -0.60{col 46}{space 3}0.549{col 54}{space 4}-.3863855{col 67}{space 3} .2063685
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.659861{col 26}{space 2}  .120214{col 37}{space 1}   22.13{col 46}{space 3}0.000{col 54}{space 4}  2.42213{col 67}{space 3} 2.897592
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      98
                                                       {txt}F(  2,    95) ={res}   29.59
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4868
                                                       {txt}Root MSE      = {res} .84727

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}    Inf1y_CPIAU{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
CPIAU_uid_shock {c |}
{space 12}--. {c |}{col 17}{res}{space 2} .9098069{col 29}{space 2} .1629486{col 40}{space 1}    5.58{col 49}{space 3}0.000{col 57}{space 4} .5863131{col 70}{space 3} 1.233301
{txt}{space 12}L1. {c |}{col 17}{res}{space 2} .6283418{col 29}{space 2}  .158104{col 40}{space 1}    3.97{col 49}{space 3}0.000{col 57}{space 4} .3144657{col 70}{space 3} .9422178
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} 2.234414{col 29}{space 2} .0857486{col 40}{space 1}   26.06{col 49}{space 3}0.000{col 57}{space 4} 2.064181{col 70}{space 3} 2.404646
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     139
                                                       {txt}F(  2,   136) ={res}    0.60
                                                       {txt}Prob > F      = {res} 0.5517
                                                       {txt}R-squared     = {res} 0.0084
                                                       {txt}Root MSE      = {res} 1.1219

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}Inf1y_CPIC~e{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}pty_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .1040799{col 26}{space 2} .1131762{col 37}{space 1}    0.92{col 46}{space 3}0.359{col 54}{space 4} -.119733{col 67}{space 3} .3278928
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .0700358{col 26}{space 2}  .115342{col 37}{space 1}    0.61{col 46}{space 3}0.545{col 54}{space 4}-.1580599{col 67}{space 3} .2981316
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.752175{col 26}{space 2} .0976742{col 37}{space 1}   28.18{col 46}{space 3}0.000{col 54}{space 4} 2.559018{col 67}{space 3} 2.945331
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      98
                                                       {txt}F(  2,    95) ={res}   23.83
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.3282
                                                       {txt}Root MSE      = {res} .40285

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}    Inf1y_CPICore{col 19}{c |}      Coef.{col 31}   Std. Err.{col 43}      t{col 51}   P>|t|{col 59}     [95% Con{col 72}f. Interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
CPICore_uid_shock {c |}
{space 14}--. {c |}{col 19}{res}{space 2} .9186123{col 31}{space 2} .2137016{col 42}{space 1}    4.30{col 51}{space 3}0.000{col 59}{space 4}  .494361{col 72}{space 3} 1.342864
{txt}{space 14}L1. {c |}{col 19}{res}{space 2} .9392385{col 31}{space 2} .1900672{col 42}{space 1}    4.94{col 51}{space 3}0.000{col 59}{space 4} .5619073{col 72}{space 3}  1.31657
{txt}{space 17} {c |}
{space 12}_cons {c |}{col 19}{res}{space 2}  2.11082{col 31}{space 2}  .040685{col 42}{space 1}   51.88{col 51}{space 3}0.000{col 59}{space 4}  2.03005{col 72}{space 3}  2.19159
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     139
                                                       {txt}F(  2,   136) ={res}    0.41
                                                       {txt}Prob > F      = {res} 0.6648
                                                       {txt}R-squared     = {res} 0.0066
                                                       {txt}Root MSE      = {res} 1.1151

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} Inf1y_PCEPI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}pty_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.0103683{col 26}{space 2} .1181828{col 37}{space 1}   -0.09{col 46}{space 3}0.930{col 54}{space 4} -.244082{col 67}{space 3} .2233453
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.1117604{col 26}{space 2} .1239187{col 37}{space 1}   -0.90{col 46}{space 3}0.369{col 54}{space 4}-.3568171{col 67}{space 3} .1332963
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.238274{col 26}{space 2}  .099666{col 37}{space 1}   22.46{col 46}{space 3}0.000{col 54}{space 4} 2.041179{col 67}{space 3}  2.43537
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      98
                                                       {txt}F(  2,    95) ={res}   25.16
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4591
                                                       {txt}Root MSE      = {res} .66815

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}    Inf1y_PCEPI{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
PCEPI_uid_shock {c |}
{space 12}--. {c |}{col 17}{res}{space 2} .9199758{col 29}{space 2} .1807358{col 40}{space 1}    5.09{col 49}{space 3}0.000{col 57}{space 4} .5611699{col 70}{space 3} 1.278782
{txt}{space 12}L1. {c |}{col 17}{res}{space 2} .7106169{col 29}{space 2} .1662509{col 40}{space 1}    4.27{col 49}{space 3}0.000{col 57}{space 4} .3805671{col 70}{space 3} 1.040667
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} 1.822022{col 29}{space 2} .0675409{col 40}{space 1}   26.98{col 49}{space 3}0.000{col 57}{space 4} 1.687936{col 70}{space 3} 1.956107
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     139
                                                       {txt}F(  2,   136) ={res}   14.06
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.1737
                                                       {txt}Root MSE      = {res} 1.2221

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} Inf1y_CPIAU{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}op_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .3138777{col 26}{space 2} .1327781{col 37}{space 1}    2.36{col 46}{space 3}0.019{col 54}{space 4}  .051301{col 67}{space 3} .5764544
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .3440324{col 26}{space 2} .1165657{col 37}{space 1}    2.95{col 46}{space 3}0.004{col 54}{space 4} .1135167{col 67}{space 3} .5745481
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.262668{col 26}{space 2} .1336944{col 37}{space 1}   16.92{col 46}{space 3}0.000{col 54}{space 4} 1.998279{col 67}{space 3} 2.527057
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      98
                                                       {txt}F(  2,    95) ={res}   29.59
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4868
                                                       {txt}Root MSE      = {res} .84727

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}    Inf1y_CPIAU{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
CPIAU_uid_shock {c |}
{space 12}--. {c |}{col 17}{res}{space 2} .9098069{col 29}{space 2} .1629486{col 40}{space 1}    5.58{col 49}{space 3}0.000{col 57}{space 4} .5863131{col 70}{space 3} 1.233301
{txt}{space 12}L1. {c |}{col 17}{res}{space 2} .6283418{col 29}{space 2}  .158104{col 40}{space 1}    3.97{col 49}{space 3}0.000{col 57}{space 4} .3144657{col 70}{space 3} .9422178
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} 2.234414{col 29}{space 2} .0857486{col 40}{space 1}   26.06{col 49}{space 3}0.000{col 57}{space 4} 2.064181{col 70}{space 3} 2.404646
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     139
                                                       {txt}F(  2,   136) ={res}    0.19
                                                       {txt}Prob > F      = {res} 0.8259
                                                       {txt}R-squared     = {res} 0.0041
                                                       {txt}Root MSE      = {res} 1.1243

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}Inf1y_CPIC~e{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}op_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.0506116{col 26}{space 2} .1512037{col 37}{space 1}   -0.33{col 46}{space 3}0.738{col 54}{space 4} -.349626{col 67}{space 3} .2484028
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.0327991{col 26}{space 2} .1425716{col 37}{space 1}   -0.23{col 46}{space 3}0.818{col 54}{space 4}-.3147431{col 67}{space 3} .2491449
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.788044{col 26}{space 2} .1202275{col 37}{space 1}   23.19{col 46}{space 3}0.000{col 54}{space 4} 2.550287{col 67}{space 3} 3.025801
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      98
                                                       {txt}F(  2,    95) ={res}   23.83
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.3282
                                                       {txt}Root MSE      = {res} .40285

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}    Inf1y_CPICore{col 19}{c |}      Coef.{col 31}   Std. Err.{col 43}      t{col 51}   P>|t|{col 59}     [95% Con{col 72}f. Interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
CPICore_uid_shock {c |}
{space 14}--. {c |}{col 19}{res}{space 2} .9186123{col 31}{space 2} .2137016{col 42}{space 1}    4.30{col 51}{space 3}0.000{col 59}{space 4}  .494361{col 72}{space 3} 1.342864
{txt}{space 14}L1. {c |}{col 19}{res}{space 2} .9392385{col 31}{space 2} .1900672{col 42}{space 1}    4.94{col 51}{space 3}0.000{col 59}{space 4} .5619073{col 72}{space 3}  1.31657
{txt}{space 17} {c |}
{space 12}_cons {c |}{col 19}{res}{space 2}  2.11082{col 31}{space 2}  .040685{col 42}{space 1}   51.88{col 51}{space 3}0.000{col 59}{space 4}  2.03005{col 72}{space 3}  2.19159
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     139
                                                       {txt}F(  2,   136) ={res}   11.05
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.1379
                                                       {txt}Root MSE      = {res} 1.0388

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} Inf1y_PCEPI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}op_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .2501082{col 26}{space 2} .1069932{col 37}{space 1}    2.34{col 46}{space 3}0.021{col 54}{space 4} .0385227{col 67}{space 3} .4616938
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .2378215{col 26}{space 2} .0929286{col 37}{space 1}    2.56{col 46}{space 3}0.012{col 54}{space 4} .0540496{col 67}{space 3} .4215934
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.949714{col 26}{space 2} .1159266{col 37}{space 1}   16.82{col 46}{space 3}0.000{col 54}{space 4} 1.720462{col 67}{space 3} 2.178966
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      98
                                                       {txt}F(  2,    95) ={res}   25.16
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4591
                                                       {txt}Root MSE      = {res} .66815

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}    Inf1y_PCEPI{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
PCEPI_uid_shock {c |}
{space 12}--. {c |}{col 17}{res}{space 2} .9199758{col 29}{space 2} .1807358{col 40}{space 1}    5.09{col 49}{space 3}0.000{col 57}{space 4} .5611699{col 70}{space 3} 1.278782
{txt}{space 12}L1. {c |}{col 17}{res}{space 2} .7106169{col 29}{space 2} .1662509{col 40}{space 1}    4.27{col 49}{space 3}0.000{col 57}{space 4} .3805671{col 70}{space 3} 1.040667
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} 1.822022{col 29}{space 2} .0675409{col 40}{space 1}   26.98{col 49}{space 3}0.000{col 57}{space 4} 1.687936{col 70}{space 3} 1.956107
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     120
                                                       {txt}F(  2,   117) ={res}    3.29
                                                       {txt}Prob > F      = {res} 0.0406
                                                       {txt}R-squared     = {res} 0.0564
                                                       {txt}Root MSE      = {res} 1.3132

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} Inf1y_CPIAU{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}mp1_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-1.815034{col 26}{space 2} 1.155432{col 37}{space 1}   -1.57{col 46}{space 3}0.119{col 54}{space 4}-4.103307{col 67}{space 3} .4732396
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-1.567277{col 26}{space 2} 1.295864{col 37}{space 1}   -1.21{col 46}{space 3}0.229{col 54}{space 4}-4.133668{col 67}{space 3} .9991141
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.410989{col 26}{space 2} .1228853{col 37}{space 1}   19.62{col 46}{space 3}0.000{col 54}{space 4} 2.167621{col 67}{space 3} 2.654357
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      98
                                                       {txt}F(  2,    95) ={res}   29.59
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4868
                                                       {txt}Root MSE      = {res} .84727

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}    Inf1y_CPIAU{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
CPIAU_uid_shock {c |}
{space 12}--. {c |}{col 17}{res}{space 2} .9098069{col 29}{space 2} .1629486{col 40}{space 1}    5.58{col 49}{space 3}0.000{col 57}{space 4} .5863131{col 70}{space 3} 1.233301
{txt}{space 12}L1. {c |}{col 17}{res}{space 2} .6283418{col 29}{space 2}  .158104{col 40}{space 1}    3.97{col 49}{space 3}0.000{col 57}{space 4} .3144657{col 70}{space 3} .9422178
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} 2.234414{col 29}{space 2} .0857486{col 40}{space 1}   26.06{col 49}{space 3}0.000{col 57}{space 4} 2.064181{col 70}{space 3} 2.404646
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     120
                                                       {txt}F(  2,   117) ={res}    7.35
                                                       {txt}Prob > F      = {res} 0.0010
                                                       {txt}R-squared     = {res} 0.1836
                                                       {txt}Root MSE      = {res} .87857

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}Inf1y_CPIC~e{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}mp1_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-2.482921{col 26}{space 2} .8259944{col 37}{space 1}   -3.01{col 46}{space 3}0.003{col 54}{space 4} -4.11876{col 67}{space 3}-.8470821
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-1.890917{col 26}{space 2} .8827409{col 37}{space 1}   -2.14{col 46}{space 3}0.034{col 54}{space 4}-3.639139{col 67}{space 3}-.1426946
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.310568{col 26}{space 2} .0854137{col 37}{space 1}   27.05{col 46}{space 3}0.000{col 54}{space 4} 2.141411{col 67}{space 3} 2.479726
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      98
                                                       {txt}F(  2,    95) ={res}   23.83
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.3282
                                                       {txt}Root MSE      = {res} .40285

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}    Inf1y_CPICore{col 19}{c |}      Coef.{col 31}   Std. Err.{col 43}      t{col 51}   P>|t|{col 59}     [95% Con{col 72}f. Interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
CPICore_uid_shock {c |}
{space 14}--. {c |}{col 19}{res}{space 2} .9186123{col 31}{space 2} .2137016{col 42}{space 1}    4.30{col 51}{space 3}0.000{col 59}{space 4}  .494361{col 72}{space 3} 1.342864
{txt}{space 14}L1. {c |}{col 19}{res}{space 2} .9392385{col 31}{space 2} .1900672{col 42}{space 1}    4.94{col 51}{space 3}0.000{col 59}{space 4} .5619073{col 72}{space 3}  1.31657
{txt}{space 17} {c |}
{space 12}_cons {c |}{col 19}{res}{space 2}  2.11082{col 31}{space 2}  .040685{col 42}{space 1}   51.88{col 51}{space 3}0.000{col 59}{space 4}  2.03005{col 72}{space 3}  2.19159
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     120
                                                       {txt}F(  2,   117) ={res}    1.52
                                                       {txt}Prob > F      = {res} 0.2235
                                                       {txt}R-squared     = {res} 0.0292
                                                       {txt}Root MSE      = {res} 1.0665

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} Inf1y_PCEPI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}mp1_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-1.179249{col 26}{space 2} .9383827{col 37}{space 1}   -1.26{col 46}{space 3}0.211{col 54}{space 4}-3.037667{col 67}{space 3} .6791684
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.7460218{col 26}{space 2} 1.099569{col 37}{space 1}   -0.68{col 46}{space 3}0.499{col 54}{space 4}-2.923661{col 67}{space 3} 1.431617
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.015374{col 26}{space 2} .0989506{col 37}{space 1}   20.37{col 46}{space 3}0.000{col 54}{space 4} 1.819407{col 67}{space 3}  2.21134
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      98
                                                       {txt}F(  2,    95) ={res}   25.16
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4591
                                                       {txt}Root MSE      = {res} .66815

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}    Inf1y_PCEPI{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
PCEPI_uid_shock {c |}
{space 12}--. {c |}{col 17}{res}{space 2} .9199758{col 29}{space 2} .1807358{col 40}{space 1}    5.09{col 49}{space 3}0.000{col 57}{space 4} .5611699{col 70}{space 3} 1.278782
{txt}{space 12}L1. {c |}{col 17}{res}{space 2} .7106169{col 29}{space 2} .1662509{col 40}{space 1}    4.27{col 49}{space 3}0.000{col 57}{space 4} .3805671{col 70}{space 3} 1.040667
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} 1.822022{col 29}{space 2} .0675409{col 40}{space 1}   26.98{col 49}{space 3}0.000{col 57}{space 4} 1.687936{col 70}{space 3} 1.956107
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     120
                                                       {txt}F(  2,   117) ={res}   10.11
                                                       {txt}Prob > F      = {res} 0.0001
                                                       {txt}R-squared     = {res} 0.1294
                                                       {txt}Root MSE      = {res} 1.2613

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} Inf1y_CPIAU{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}ED4_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} 3.861034{col 26}{space 2} 1.206261{col 37}{space 1}    3.20{col 46}{space 3}0.002{col 54}{space 4} 1.472096{col 67}{space 3} 6.249972
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} 3.390175{col 26}{space 2} 1.232131{col 37}{space 1}    2.75{col 46}{space 3}0.007{col 54}{space 4} .9500038{col 67}{space 3} 5.830345
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.543352{col 26}{space 2} .1150875{col 37}{space 1}   22.10{col 46}{space 3}0.000{col 54}{space 4} 2.315427{col 67}{space 3} 2.771277
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      98
                                                       {txt}F(  2,    95) ={res}   29.59
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4868
                                                       {txt}Root MSE      = {res} .84727

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}    Inf1y_CPIAU{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
CPIAU_uid_shock {c |}
{space 12}--. {c |}{col 17}{res}{space 2} .9098069{col 29}{space 2} .1629486{col 40}{space 1}    5.58{col 49}{space 3}0.000{col 57}{space 4} .5863131{col 70}{space 3} 1.233301
{txt}{space 12}L1. {c |}{col 17}{res}{space 2} .6283418{col 29}{space 2}  .158104{col 40}{space 1}    3.97{col 49}{space 3}0.000{col 57}{space 4} .3144657{col 70}{space 3} .9422178
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} 2.234414{col 29}{space 2} .0857486{col 40}{space 1}   26.06{col 49}{space 3}0.000{col 57}{space 4} 2.064181{col 70}{space 3} 2.404646
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     120
                                                       {txt}F(  2,   117) ={res}    1.82
                                                       {txt}Prob > F      = {res} 0.1665
                                                       {txt}R-squared     = {res} 0.0153
                                                       {txt}Root MSE      = {res} .96488

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}Inf1y_CPIC~e{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}ED4_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .7044707{col 26}{space 2} .6135228{col 37}{space 1}    1.15{col 46}{space 3}0.253{col 54}{space 4}-.5105792{col 67}{space 3} 1.919521
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} 1.047897{col 26}{space 2} .5928212{col 37}{space 1}    1.77{col 46}{space 3}0.080{col 54}{space 4}-.1261546{col 67}{space 3} 2.221948
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.480257{col 26}{space 2} .0881165{col 37}{space 1}   28.15{col 46}{space 3}0.000{col 54}{space 4} 2.305747{col 67}{space 3} 2.654767
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      98
                                                       {txt}F(  2,    95) ={res}   23.83
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.3282
                                                       {txt}Root MSE      = {res} .40285

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}    Inf1y_CPICore{col 19}{c |}      Coef.{col 31}   Std. Err.{col 43}      t{col 51}   P>|t|{col 59}     [95% Con{col 72}f. Interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
CPICore_uid_shock {c |}
{space 14}--. {c |}{col 19}{res}{space 2} .9186123{col 31}{space 2} .2137016{col 42}{space 1}    4.30{col 51}{space 3}0.000{col 59}{space 4}  .494361{col 72}{space 3} 1.342864
{txt}{space 14}L1. {c |}{col 19}{res}{space 2} .9392385{col 31}{space 2} .1900672{col 42}{space 1}    4.94{col 51}{space 3}0.000{col 59}{space 4} .5619073{col 72}{space 3}  1.31657
{txt}{space 17} {c |}
{space 12}_cons {c |}{col 19}{res}{space 2}  2.11082{col 31}{space 2}  .040685{col 42}{space 1}   51.88{col 51}{space 3}0.000{col 59}{space 4}  2.03005{col 72}{space 3}  2.19159
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}     120
                                                       {txt}F(  2,   117) ={res}    9.25
                                                       {txt}Prob > F      = {res} 0.0002
                                                       {txt}R-squared     = {res} 0.1201
                                                       {txt}Root MSE      = {res} 1.0154

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} Inf1y_PCEPI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}ED4_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} 2.838972{col 26}{space 2}  1.03163{col 37}{space 1}    2.75{col 46}{space 3}0.007{col 54}{space 4} .7958816{col 67}{space 3} 4.882062
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} 2.768906{col 26}{space 2} .9883823{col 37}{space 1}    2.80{col 46}{space 3}0.006{col 54}{space 4} .8114662{col 67}{space 3} 4.726345
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.091063{col 26}{space 2} .0926716{col 37}{space 1}   22.56{col 46}{space 3}0.000{col 54}{space 4} 1.907532{col 67}{space 3} 2.274594
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      98
                                                       {txt}F(  2,    95) ={res}   25.16
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4591
                                                       {txt}Root MSE      = {res} .66815

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}    Inf1y_PCEPI{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
PCEPI_uid_shock {c |}
{space 12}--. {c |}{col 17}{res}{space 2} .9199758{col 29}{space 2} .1807358{col 40}{space 1}    5.09{col 49}{space 3}0.000{col 57}{space 4} .5611699{col 70}{space 3} 1.278782
{txt}{space 12}L1. {c |}{col 17}{res}{space 2} .7106169{col 29}{space 2} .1662509{col 40}{space 1}    4.27{col 49}{space 3}0.000{col 57}{space 4} .3805671{col 70}{space 3} 1.040667
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} 1.822022{col 29}{space 2} .0675409{col 40}{space 1}   26.98{col 49}{space 3}0.000{col 57}{space 4} 1.687936{col 70}{space 3} 1.956107
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      99
                                                       {txt}F(  2,    96) ={res}    6.20
                                                       {txt}Prob > F      = {res} 0.0029
                                                       {txt}R-squared     = {res} 0.1186
                                                       {txt}Root MSE      = {res} 1.1048

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} Inf1y_CPIAU{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}ED8_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} 3.109192{col 26}{space 2} 1.186463{col 37}{space 1}    2.62{col 46}{space 3}0.010{col 54}{space 4} .7540823{col 67}{space 3} 5.464302
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} 2.457156{col 26}{space 2} 1.371653{col 37}{space 1}    1.79{col 46}{space 3}0.076{col 54}{space 4}-.2655536{col 67}{space 3} 5.179867
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.234582{col 26}{space 2} .1110462{col 37}{space 1}   20.12{col 46}{space 3}0.000{col 54}{space 4} 2.014157{col 67}{space 3} 2.455007
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      98
                                                       {txt}F(  2,    95) ={res}   29.59
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4868
                                                       {txt}Root MSE      = {res} .84727

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}    Inf1y_CPIAU{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
CPIAU_uid_shock {c |}
{space 12}--. {c |}{col 17}{res}{space 2} .9098069{col 29}{space 2} .1629486{col 40}{space 1}    5.58{col 49}{space 3}0.000{col 57}{space 4} .5863131{col 70}{space 3} 1.233301
{txt}{space 12}L1. {c |}{col 17}{res}{space 2} .6283418{col 29}{space 2}  .158104{col 40}{space 1}    3.97{col 49}{space 3}0.000{col 57}{space 4} .3144657{col 70}{space 3} .9422178
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} 2.234414{col 29}{space 2} .0857486{col 40}{space 1}   26.06{col 49}{space 3}0.000{col 57}{space 4} 2.064181{col 70}{space 3} 2.404646
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      99
                                                       {txt}F(  2,    96) ={res}    0.54
                                                       {txt}Prob > F      = {res} 0.5843
                                                       {txt}R-squared     = {res} 0.0109
                                                       {txt}Root MSE      = {res} .49163

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}Inf1y_CPIC~e{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}ED8_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .2413175{col 26}{space 2} .4373404{col 37}{space 1}    0.55{col 46}{space 3}0.582{col 54}{space 4}-.6267963{col 67}{space 3} 1.109431
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .4369373{col 26}{space 2} .4469186{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4}-.4501891{col 67}{space 3} 1.324064
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.117497{col 26}{space 2} .0494174{col 37}{space 1}   42.85{col 46}{space 3}0.000{col 54}{space 4} 2.019404{col 67}{space 3} 2.215589
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      98
                                                       {txt}F(  2,    95) ={res}   23.83
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.3282
                                                       {txt}Root MSE      = {res} .40285

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}    Inf1y_CPICore{col 19}{c |}      Coef.{col 31}   Std. Err.{col 43}      t{col 51}   P>|t|{col 59}     [95% Con{col 72}f. Interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
CPICore_uid_shock {c |}
{space 14}--. {c |}{col 19}{res}{space 2} .9186123{col 31}{space 2} .2137016{col 42}{space 1}    4.30{col 51}{space 3}0.000{col 59}{space 4}  .494361{col 72}{space 3} 1.342864
{txt}{space 14}L1. {c |}{col 19}{res}{space 2} .9392385{col 31}{space 2} .1900672{col 42}{space 1}    4.94{col 51}{space 3}0.000{col 59}{space 4} .5619073{col 72}{space 3}  1.31657
{txt}{space 17} {c |}
{space 12}_cons {c |}{col 19}{res}{space 2}  2.11082{col 31}{space 2}  .040685{col 42}{space 1}   51.88{col 51}{space 3}0.000{col 59}{space 4}  2.03005{col 72}{space 3}  2.19159
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      99
                                                       {txt}F(  2,    96) ={res}    6.79
                                                       {txt}Prob > F      = {res} 0.0017
                                                       {txt}R-squared     = {res} 0.1303
                                                       {txt}Root MSE      = {res} .84304

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} Inf1y_PCEPI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}ED8_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} 2.381697{col 26}{space 2} .8938626{col 37}{space 1}    2.66{col 46}{space 3}0.009{col 54}{space 4} .6073939{col 67}{space 3}    4.156
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} 2.132369{col 26}{space 2}  1.04349{col 37}{space 1}    2.04{col 46}{space 3}0.044{col 54}{space 4} .0610574{col 67}{space 3}  4.20368
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.822641{col 26}{space 2} .0847425{col 37}{space 1}   21.51{col 46}{space 3}0.000{col 54}{space 4} 1.654429{col 67}{space 3} 1.990854
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      98
                                                       {txt}F(  2,    95) ={res}   25.16
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4591
                                                       {txt}Root MSE      = {res} .66815

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}    Inf1y_PCEPI{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
PCEPI_uid_shock {c |}
{space 12}--. {c |}{col 17}{res}{space 2} .9199758{col 29}{space 2} .1807358{col 40}{space 1}    5.09{col 49}{space 3}0.000{col 57}{space 4} .5611699{col 70}{space 3} 1.278782
{txt}{space 12}L1. {c |}{col 17}{res}{space 2} .7106169{col 29}{space 2} .1662509{col 40}{space 1}    4.27{col 49}{space 3}0.000{col 57}{space 4} .3805671{col 70}{space 3} 1.040667
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} 1.822022{col 29}{space 2} .0675409{col 40}{space 1}   26.98{col 49}{space 3}0.000{col 57}{space 4} 1.687936{col 70}{space 3} 1.956107
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. esttab using "${c -(}sum_table_folder{c )-}/IRFQ.csv", mtitles se r2 replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/IRFQ.csv"'})

{com}. 
. 
. 
. ** IRF of inflation 
. /*
> eststo clear
> foreach sk in pty op mp1 ED4 ED8 {c -(}
>   foreach Inf in CPIAU CPICore PCEPI{c -(} 
>    var Inf1y_`Inf', lags(1/4) exo(l(0/1).`sk'_shock)
>    set seed 123456
>    irf create irf1, set(`Inf'_`sk',replace) step(10) bsp
>    irf graph dm, impulse(`sk'_shock)
>    graph export "${c -(}sum_graph_folder{c )-}/irf/`Inf'_`sk'", as(png) replace
> 
>  {c )-}
> {c )-}
> 
> */
. 
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/ExpProject/workingfolder/irf_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}11 Jun 2019, 17:20:25
{txt}{.-}
{smcl}
{txt}{sf}{ul off}