{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/ExpProject/workingfolder/irf_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}24 Jun 2019, 15:31:53
{txt}
{com}. 
. 
. **************************************************
. *** Clean inflation shock data from Python for  **
. *** both quarterly and monthly                 ***
. **************************************************
. 
. 
. *******************************************
. * Generate monthly inflation shock data   *
. *******************************************
. 
. import excel "${c -(}mainfolder{c )-}/OtherData/2MPShocksJW.xls", sheet("data") firstrow clear
{res}{txt}
{com}. 
. gen date = daily(Date,"MDY")
{txt}
{com}. drop Date
{txt}
{com}. gen year = year(date)
{txt}
{com}. gen month = month(date)
{txt}
{com}. gen date_str=string(year)+"M"+string(month)
{txt}
{com}. gen dateM = monthly(date_str,"YM")
{txt}
{com}. 
. rename date dateD
{res}{txt}
{com}. rename dateM date
{res}{txt}
{com}. 
. keep year month date dateD MP1 ED4 ED8
{txt}
{com}. sort date dateD year month MP1 ED4 ED8
{txt}
{com}. 
. foreach var in MP1 ED4 ED8{c -(}
{txt}  2{com}. destring `var',force replace 
{txt}  3{com}. egen `var'M = sum(`var'), by(year month) 
{txt}  4{com}. label var `var'M "Cumulated sum of `var'"
{txt}  5{com}. drop `var'
{txt}  6{com}. rename `var'M `var'
{txt}  7{com}. {c )-}
{txt}MP1 contains nonnumeric characters; {res}replaced {txt}as {res}double
{txt}(61 missing values generated)
{res}{txt}ED4 already numeric; no {res}replace
{txt}ED8 contains nonnumeric characters; {res}replaced {txt}as {res}double
{txt}(126 missing values generated)
{res}{txt}
{com}. 
. duplicates drop year month,force 

{p 0 4}{txt}Duplicates in terms of {res} year month{p_end}

{txt}(39 observations deleted)

{com}. 
. save "${c -(}mainfolder{c )-}/OtherData/MPShockM.dta",replace 
{txt}(note: file /Users/Myworld/Dropbox/ExpProject/workingfolder/OtherData/MPShockM.dta not found)
file /Users/Myworld/Dropbox/ExpProject/workingfolder/OtherData/MPShockM.dta saved

{com}. 
. 
. *************************
. **  Oil Price Shock *****
. **************************
. 
. clear
{txt}
{com}. 
. import excel "${c -(}mainfolder{c )-}/OtherData/OilShock.xls", sheet("data") firstrow allstring clear
{res}{txt}
{com}. 
. keep observation_date OPShock
{txt}
{com}. 
. destring(OPShock),force replace 
{txt}OPShock contains nonnumeric characters; {res}replaced {txt}as {res}double
{txt}(12 missing values generated)

{com}. 
. gen date = daily(observation_date,"MDY")
{txt}
{com}. gen year = year(date) 
{txt}
{com}. gen month =month(date) 
{txt}
{com}. 
. gen date_str=string(year)+"M"+string(month)
{txt}
{com}. gen dateM = monthly(date_str,"YM")
{txt}
{com}. 
. drop date
{txt}
{com}. rename dateM date
{res}{txt}
{com}. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, -168 to 711
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. format date %tm
{txt}
{com}. 
. ** Normorlize MP shcoks
. 
. egen OPShock_sd =sd(OPShock)
{txt}
{com}. gen OPShock_nm = OPShock/OPShock_sd
{txt}(12 missing values generated)

{com}. label var OPShock_nm "Normalized oil price shock"
{txt}
{com}. 
. save "${c -(}mainfolder{c )-}/OtherData/OPShockM.dta",replace 
{txt}(note: file /Users/Myworld/Dropbox/ExpProject/workingfolder/OtherData/OPShockM.dta not found)
file /Users/Myworld/Dropbox/ExpProject/workingfolder/OtherData/OPShockM.dta saved

{com}. 
. **************************************
. ***  Merge Shocks and Inflation *****
. **************************************
. 
. merge 1:1 year month using "${c -(}mainfolder{c )-}/OtherData/MPShockM.dta",keep(master match)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             579
{txt}{col 9}from master{col 30}{res}             579{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             301{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge MPshock_merge
{res}{txt}
{com}. 
. 
. * Merge with inflation 
. merge 1:1 year month using "${c -(}mainfolder{c )-}/OtherData/InfM.dta",keep(match master)
{res}{txt}(label _merge already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              25
{txt}{col 9}from master{col 30}{res}              25{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             855{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge InfM_merge 
{res}{txt}
{com}. 
. 
. ** Label and rename
. 
. rename OPShock_nm op_shock 
{res}{txt}
{com}. label var op_shock "Oil price shock (Hamilton 1996)"
{txt}
{com}. rename MP1 mp1_shock
{res}{txt}
{com}. label var mp1_shock "Unexpected change in federal funds rate"
{txt}
{com}. label var ED4 "1-year ahead future-implied change in federal funds rate"
{txt}
{com}. label var ED8 "2-year ahead future-implied change in federal funds rate"
{txt}
{com}. 
. 
. ** MP-path shock 
. 
. foreach ed in ED4 ED8{c -(}
{txt}  2{com}.   reg `ed' mp1_shock
{txt}  3{com}.   predict `ed'_shock, residual
{txt}  4{com}. label var `ed'_shock "Unexpected shock to future federal funds rate"
{txt}  5{com}. {c )-}

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}     301
{txt}{hline 13}{char +}{hline 30}           F(  1,   299) ={res}   23.08
    {txt}   Model {char |} {res} .191164842     1  .191164842           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 2.47619195   299  .008281578           {txt}R-squared     = {res} 0.0717
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0686
    {txt}   Total {char |} {res} 2.66735679   300  .008891189           {txt}Root MSE      = {res}   .091

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         ED4{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}mp1_shock {c |}{col 14}{res}{space 2} .3294807{col 26}{space 2} .0685776{col 37}{space 1}    4.80{col 46}{space 3}0.000{col 54}{space 4} .1945247{col 67}{space 3} .4644367
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0057489{col 26}{space 2} .0053475{col 37}{space 1}   -1.08{col 46}{space 3}0.283{col 54}{space 4}-.0162724{col 67}{space 3} .0047746
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(579 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}     301
{txt}{hline 13}{char +}{hline 30}           F(  1,   299) ={res}    7.30
    {txt}   Model {char |} {res} .040232491     1  .040232491           {txt}Prob > F      = {res} 0.0073
    {txt}Residual {char |} {res} 1.64792849   299  .005511467           {txt}R-squared     = {res} 0.0238
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0206
    {txt}   Total {char |} {res} 1.68816098   300  .005627203           {txt}Root MSE      = {res} .07424

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         ED8{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}mp1_shock {c |}{col 14}{res}{space 2} .1511522{col 26}{space 2} .0559448{col 37}{space 1}    2.70{col 46}{space 3}0.007{col 54}{space 4} .0410568{col 67}{space 3} .2612476
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0043348{col 26}{space 2} .0043624{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4}-.0129197{col 67}{space 3} .0042502
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(579 missing values generated)

{com}. 
. ** Normorlize MP shcoks
. 
. foreach var in mp1 ED4 ED8{c -(}
{txt}  2{com}.   egen `var'_shock_sd =sd(`var'_shock)
{txt}  3{com}.   gen `var'ut_shock = `var'_shock/`var'_shock_sd 
{txt}  4{com}.   local lb : var label `var'_shock
{txt}  5{com}.   label var `var'ut_shock "`lb' in std unit"
{txt}  6{com}. {c )-}
{txt}(579 missing values generated)
(579 missing values generated)
(579 missing values generated)

{com}. 
. ** Absolute values of the shocks
. 
. foreach var in op mp1ut ED8ut{c -(}
{txt}  2{com}. gen `var'_abshock = abs(`var'_shock)
{txt}  3{com}. local lb: var label `var'_shock
{txt}  4{com}. label var `var'_abshock "Absolute value of `lb'"
{txt}  5{com}. {c )-} 
{txt}(12 missing values generated)
(579 missing values generated)
(579 missing values generated)

{com}. 
. ** Generated unidentified shocks. 
. 
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1946m1 to 2019m4
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. 
. eststo clear
{txt}
{com}. 
. foreach Inf in CPIAU CPICore PCEPI{c -(} 
{txt}  2{com}.    reg Inf1y_`Inf' l(1/4).Inf1y_`Inf' l(0/1).op_shock l(0/1).mp1ut_shock l(0/1).ED8ut_shock
{txt}  3{com}.    predict `Inf'_uid_shock, residual
{txt}  4{com}.    label var `Inf'_uid_shock "Unidentified shocks to inflation"
{txt}  5{com}.  {c )-}

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}     179
{txt}{hline 13}{char +}{hline 30}           F( 10,   168) ={res}  295.06
    {txt}   Model {char |} {res}  303.38206    10   30.338206           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 17.2740894   168  .102821961           {txt}R-squared     = {res} 0.9461
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.9429
    {txt}   Total {char |} {res}  320.65615   178  1.80143904           {txt}Root MSE      = {res} .32066

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} Inf1y_CPIAU{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}Inf1y_CPIAU {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} 1.526174{col 26}{space 2}   .07452{col 37}{space 1}   20.48{col 46}{space 3}0.000{col 54}{space 4} 1.379058{col 67}{space 3} 1.673291
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.7104585{col 26}{space 2} .1249879{col 37}{space 1}   -5.68{col 46}{space 3}0.000{col 54}{space 4}-.9572077{col 67}{space 3}-.4637093
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1153475{col 26}{space 2} .1290226{col 37}{space 1}    0.89{col 46}{space 3}0.373{col 54}{space 4}-.1393669{col 67}{space 3} .3700619
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0401018{col 26}{space 2} .0831697{col 37}{space 1}    0.48{col 46}{space 3}0.630{col 54}{space 4}-.1240905{col 67}{space 3} .2042942
{txt}{space 12} {c |}
{space 4}op_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .1561082{col 26}{space 2} .0418652{col 37}{space 1}    3.73{col 46}{space 3}0.000{col 54}{space 4} .0734586{col 67}{space 3} .2387578
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .0559608{col 26}{space 2} .0465386{col 37}{space 1}    1.20{col 46}{space 3}0.231{col 54}{space 4}-.0359151{col 67}{space 3} .1478367
{txt}{space 12} {c |}
{space 1}mp1ut_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.0389704{col 26}{space 2} .0212008{col 37}{space 1}   -1.84{col 46}{space 3}0.068{col 54}{space 4}-.0808247{col 67}{space 3} .0028838
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .0478531{col 26}{space 2} .0252766{col 37}{space 1}    1.89{col 46}{space 3}0.060{col 54}{space 4}-.0020476{col 67}{space 3} .0977538
{txt}{space 12} {c |}
{space 1}ED8ut_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} -.021269{col 26}{space 2}  .029833{col 37}{space 1}   -0.71{col 46}{space 3}0.477{col 54}{space 4}-.0801648{col 67}{space 3} .0376268
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.0425572{col 26}{space 2} .0232143{col 37}{space 1}   -1.83{col 46}{space 3}0.069{col 54}{space 4}-.0883866{col 67}{space 3} .0032722
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0131576{col 26}{space 2} .0628257{col 37}{space 1}    0.21{col 46}{space 3}0.834{col 54}{space 4} -.110872{col 67}{space 3} .1371873
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(701 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}     179
{txt}{hline 13}{char +}{hline 30}           F( 10,   168) ={res} 1408.61
    {txt}   Model {char |} {res} 247.976105    10  24.7976105           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 2.95753144   168  .017604354           {txt}R-squared     = {res} 0.9882
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.9875
    {txt}   Total {char |} {res} 250.933637   178  1.40973953           {txt}Root MSE      = {res} .13268

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Inf1y_CPIC~e{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Inf1y_CPIC~e {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} 1.057257{col 26}{space 2}  .080767{col 37}{space 1}   13.09{col 46}{space 3}0.000{col 54}{space 4} .8978076{col 67}{space 3} 1.216706
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0098628{col 26}{space 2} .1113028{col 37}{space 1}   -0.09{col 46}{space 3}0.929{col 54}{space 4}-.2295951{col 67}{space 3} .2098694
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .0632601{col 26}{space 2} .1006184{col 37}{space 1}    0.63{col 46}{space 3}0.530{col 54}{space 4}-.1353792{col 67}{space 3} .2618994
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.1111923{col 26}{space 2} .0712668{col 37}{space 1}   -1.56{col 46}{space 3}0.121{col 54}{space 4}-.2518862{col 67}{space 3} .0295016
{txt}{space 12} {c |}
{space 4}op_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .0424137{col 26}{space 2} .0176044{col 37}{space 1}    2.41{col 46}{space 3}0.017{col 54}{space 4} .0076593{col 67}{space 3} .0771682
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .0020799{col 26}{space 2} .0193709{col 37}{space 1}    0.11{col 46}{space 3}0.915{col 54}{space 4}-.0361619{col 67}{space 3} .0403218
{txt}{space 12} {c |}
{space 1}mp1ut_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .0003079{col 26}{space 2} .0086536{col 37}{space 1}    0.04{col 46}{space 3}0.972{col 54}{space 4}-.0167759{col 67}{space 3} .0173917
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.0080094{col 26}{space 2} .0100997{col 37}{space 1}   -0.79{col 46}{space 3}0.429{col 54}{space 4}-.0279481{col 67}{space 3} .0119293
{txt}{space 12} {c |}
{space 1}ED8ut_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.0036173{col 26}{space 2} .0117439{col 37}{space 1}   -0.31{col 46}{space 3}0.758{col 54}{space 4}-.0268019{col 67}{space 3} .0195674
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .0071037{col 26}{space 2} .0092915{col 37}{space 1}    0.76{col 46}{space 3}0.446{col 54}{space 4}-.0112394{col 67}{space 3} .0254468
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0084047{col 26}{space 2} .0295012{col 37}{space 1}   -0.28{col 46}{space 3}0.776{col 54}{space 4}-.0666455{col 67}{space 3}  .049836
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(701 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}     179
{txt}{hline 13}{char +}{hline 30}           F( 10,   168) ={res}  358.70
    {txt}   Model {char |} {res} 220.025582    10  22.0025582           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res}  10.305079   168  .061339756           {txt}R-squared     = {res} 0.9553
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.9526
    {txt}   Total {char |} {res} 230.330661   178  1.29399248           {txt}Root MSE      = {res} .24767

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} Inf1y_PCEPI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}Inf1y_PCEPI {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}  1.41545{col 26}{space 2}  .076639{col 37}{space 1}   18.47{col 46}{space 3}0.000{col 54}{space 4} 1.264151{col 67}{space 3}  1.56675
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.4294493{col 26}{space 2} .1275048{col 37}{space 1}   -3.37{col 46}{space 3}0.001{col 54}{space 4}-.6811675{col 67}{space 3}-.1777312
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0858964{col 26}{space 2} .1242722{col 37}{space 1}   -0.69{col 46}{space 3}0.490{col 54}{space 4}-.3312327{col 67}{space 3} .1594399
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0693503{col 26}{space 2}  .080066{col 37}{space 1}    0.87{col 46}{space 3}0.388{col 54}{space 4}-.0887147{col 67}{space 3} .2274153
{txt}{space 12} {c |}
{space 4}op_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .1166383{col 26}{space 2}  .032384{col 37}{space 1}    3.60{col 46}{space 3}0.000{col 54}{space 4} .0527062{col 67}{space 3} .1805704
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .0419584{col 26}{space 2} .0359426{col 37}{space 1}    1.17{col 46}{space 3}0.245{col 54}{space 4}-.0289989{col 67}{space 3} .1129156
{txt}{space 12} {c |}
{space 1}mp1ut_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.0122103{col 26}{space 2}  .016312{col 37}{space 1}   -0.75{col 46}{space 3}0.455{col 54}{space 4}-.0444132{col 67}{space 3} .0199926
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .0105656{col 26}{space 2} .0191598{col 37}{space 1}    0.55{col 46}{space 3}0.582{col 54}{space 4}-.0272594{col 67}{space 3} .0483905
{txt}{space 12} {c |}
{space 1}ED8ut_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.0223842{col 26}{space 2} .0226867{col 37}{space 1}   -0.99{col 46}{space 3}0.325{col 54}{space 4}-.0671719{col 67}{space 3} .0224034
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.0122677{col 26}{space 2} .0178986{col 37}{space 1}   -0.69{col 46}{space 3}0.494{col 54}{space 4}-.0476029{col 67}{space 3} .0230674
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  .027834{col 26}{space 2} .0471192{col 37}{space 1}    0.59{col 46}{space 3}0.556{col 54}{space 4} -.065188{col 67}{space 3} .1208559
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(701 missing values generated)

{com}. 
. 
. *Save a dta file for individual monthly IR analysis **
. 
. *******************************
. **  Plot Shocks for checking **
. ********************************
. 
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1946m1 to 2019m4
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. format date %tm
{txt}
{com}. 
. foreach var in mp1 ED4 ED8 op{c -(}
{txt}  2{com}. tsline(`var'_shock) if `var'_shock!=., title("Shocks to Inflation(Monthly)")
{txt}  3{com}. {c )-}
{res}{txt}
{com}. graph export "${c -(}mainfolder{c )-}/graphs/shocks/`var'_shock",as(png) replace 
{txt}(file /Users/Myworld/Dropbox/ExpProject/workingfolder/graphs/shocks/_shock written in PNG format)

{com}. 
. 
. save "${c -(}mainfolder{c )-}/OtherData/InfShockMClean.dta",replace  
{txt}file /Users/Myworld/Dropbox/ExpProject/workingfolder/OtherData/InfShockMClean.dta saved

{com}. rm "${c -(}mainfolder{c )-}/OtherData/MPShockM.dta"
{txt}
{com}. rm "${c -(}mainfolder{c )-}/OtherData/OPShockM.dta"
{txt}
{com}. 
. 
. ***********************************************
. * Quarterly. originally generated from Python *
. * Will be generated using stata later. *******
. ***********************************************
. 
. use "${c -(}mainfolder{c )-}/OtherData/InfShocksQ.dta",clear 
{txt}
{com}. 
. drop index 
{txt}
{com}. 
. *** Date 
. gen date_str=string(year)+"Q"+string(quarter) 
{txt}
{com}. 
. gen date = quarterly(date_str,"YQ")
{txt}
{com}. format date %tq 
{txt}
{com}. 
. drop date_str
{txt}
{com}. 
. order date year quarter month
{txt}
{com}. 
. ** Time series 
. 
. tsset date 
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1984q1 to 2018q4
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. 
. 
. * Merge with inflation 
. merge 1:1 year month using "${c -(}mainfolder{c )-}/OtherData/InfM.dta",keep(match master)
{res}{txt}{p 0 7 2}
(note: variable
year was 
long, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
month was 
long, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             140{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge InfM_merge 
{res}{txt}
{com}. 
. 
. ** Label and rename
. 
. label var pty_shock "Technology shock(Gali 1999)"
{txt}
{com}. label var hours_shock "Non-technology shock(Gali 1999)"
{txt}
{com}. label var inf_shock "Shock to inflation(Gali 1999)"
{txt}
{com}. label var pty_max_shock "Technology shock (Francis etal 2014)"
{txt}
{com}. label var news_shock "News shock(Sims etal.2011)"
{txt}
{com}. rename OPShock_nm op_shock 
{res}{txt}
{com}. label var op_shock "Oil price shock (Hamilton 1996)"
{txt}
{com}. rename MP1 mp1_shock
{res}{txt}
{com}. label var mp1_shock "Unexpected change in federal funds rate"
{txt}
{com}. label var ED4 "1-year ahead future-implied change in federal funds rate"
{txt}
{com}. label var ED8 "2-year ahead future-implied change in federal funds rate"
{txt}
{com}. 
. ** MP-path shock 
. 
. foreach ed in ED4 ED8{c -(}
{txt}  2{com}.   reg `ed' mp1_shock
{txt}  3{com}.   predict `ed'_shock, residual
{txt}  4{com}. label var `ed'_shock "Unexpected shock to future federal funds rate"
{txt}  5{com}. {c )-}

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}     121
{txt}{hline 13}{char +}{hline 30}           F(  1,   119) ={res}   21.17
    {txt}   Model {char |} {res}  .22003407     1   .22003407           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 1.23701593   119  .010395092           {txt}R-squared     = {res} 0.1510
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.1439
    {txt}   Total {char |} {res}    1.45705   120  .012142083           {txt}Root MSE      = {res} .10196

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         ED4{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}mp1_shock {c |}{col 14}{res}{space 2} .3596785{col 26}{space 2} .0781778{col 37}{space 1}    4.60{col 46}{space 3}0.000{col 54}{space 4} .2048786{col 67}{space 3} .5144785
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0109294{col 26}{space 2} .0097298{col 37}{space 1}   -1.12{col 46}{space 3}0.264{col 54}{space 4}-.0301953{col 67}{space 3} .0083366
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(19 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}     100
{txt}{hline 13}{char +}{hline 30}           F(  1,    98) ={res}    1.91
    {txt}   Model {char |} {res} .022918019     1  .022918019           {txt}Prob > F      = {res} 0.1704
    {txt}Residual {char |} {res} 1.17762183    98  .012016549           {txt}R-squared     = {res} 0.0191
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0091
    {txt}   Total {char |} {res} 1.20053985    99  .012126665           {txt}Root MSE      = {res} .10962

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         ED8{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}mp1_shock {c |}{col 14}{res}{space 2} .1493479{col 26}{space 2} .1081435{col 37}{space 1}    1.38{col 46}{space 3}0.170{col 54}{space 4}-.0652594{col 67}{space 3} .3639551
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0148961{col 26}{space 2}   .01126{col 37}{space 1}   -1.32{col 46}{space 3}0.189{col 54}{space 4}-.0372413{col 67}{space 3}  .007449
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(40 missing values generated)

{com}. 
. ** Normorlize MP shcoks
. 
. foreach var in mp1 ED4 ED8{c -(}
{txt}  2{com}.   egen `var'_shock_sd =sd(`var'_shock)
{txt}  3{com}.   gen `var'ut_shock = `var'_shock/`var'_shock_sd 
{txt}  4{com}.   local lb : var label `var'_shock
{txt}  5{com}.   label var `var'ut_shock "`lb' in std unit"
{txt}  6{com}. {c )-}
{txt}(19 missing values generated)
(19 missing values generated)
(40 missing values generated)

{com}. 
. ** Absolute values of the shocks
. 
. foreach var in op pty mp1ut ED8ut{c -(}
{txt}  2{com}. gen `var'_abshock = abs(`var'_shock)
{txt}  3{com}. local lb: var label `var'_shock
{txt}  4{com}. label var `var'_abshock "Absolute value of `lb'"
{txt}  5{com}. {c )-} 
{txt}(19 missing values generated)
(40 missing values generated)

{com}. 
. 
. 
. ** Generated unidentified shocks. 
. 
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1984q1 to 2018q4
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. 
. eststo clear
{txt}
{com}. 
. foreach Inf in CPIAU CPICore PCEPI{c -(} 
{txt}  2{com}.    reg Inf1y_`Inf' l(1/4).Inf1y_`Inf' l(0/1).pty_shock l(0/1).op_shock l(0/1).mp1ut_shock l(0/1).ED8ut_shock
{txt}  3{com}.    predict `Inf'_uid_shock, residual
{txt}  4{com}.    label var `Inf'_uid_shock "Unidentified shocks to inflation"
{txt}  5{com}.  {c )-}

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}      99
{txt}{hline 13}{char +}{hline 30}           F( 12,    86) ={res}   13.24
    {txt}   Model {char |} {res} 86.2529482    12  7.18774568           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 46.6984119    86   .54300479           {txt}R-squared     = {res} 0.6488
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.5997
    {txt}   Total {char |} {res}  132.95136    98  1.35664653           {txt}Root MSE      = {res} .73689

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} Inf1y_CPIAU{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}Inf1y_CPIAU {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .5691486{col 26}{space 2} .1074395{col 37}{space 1}    5.30{col 46}{space 3}0.000{col 54}{space 4} .3555659{col 67}{space 3} .7827313
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0210417{col 26}{space 2} .1184549{col 37}{space 1}    0.18{col 46}{space 3}0.859{col 54}{space 4}-.2144388{col 67}{space 3} .2565223
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1725765{col 26}{space 2} .1186843{col 37}{space 1}    1.45{col 46}{space 3}0.150{col 54}{space 4}-.0633601{col 67}{space 3} .4085132
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.2093588{col 26}{space 2} .0944661{col 37}{space 1}   -2.22{col 46}{space 3}0.029{col 54}{space 4}-.3971512{col 67}{space 3}-.0215664
{txt}{space 12} {c |}
{space 3}pty_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.1586146{col 26}{space 2} .1082381{col 37}{space 1}   -1.47{col 46}{space 3}0.146{col 54}{space 4}-.3737849{col 67}{space 3} .0565556
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} -.096206{col 26}{space 2} .1023788{col 37}{space 1}   -0.94{col 46}{space 3}0.350{col 54}{space 4}-.2997284{col 67}{space 3} .1073164
{txt}{space 12} {c |}
{space 4}op_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .3063532{col 26}{space 2} .0869153{col 37}{space 1}    3.52{col 46}{space 3}0.001{col 54}{space 4} .1335712{col 67}{space 3} .4791351
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .1197119{col 26}{space 2} .0931144{col 37}{space 1}    1.29{col 46}{space 3}0.202{col 54}{space 4}-.0653934{col 67}{space 3} .3048173
{txt}{space 12} {c |}
{space 1}mp1ut_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .0575501{col 26}{space 2} .0939905{col 37}{space 1}    0.61{col 46}{space 3}0.542{col 54}{space 4}-.1292969{col 67}{space 3}  .244397
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.1129986{col 26}{space 2} .0961086{col 37}{space 1}   -1.18{col 46}{space 3}0.243{col 54}{space 4}-.3040562{col 67}{space 3} .0780591
{txt}{space 12} {c |}
{space 1}ED8ut_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .1329961{col 26}{space 2}  .082032{col 37}{space 1}    1.62{col 46}{space 3}0.109{col 54}{space 4}-.0300781{col 67}{space 3} .2960703
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.0418452{col 26}{space 2} .0856554{col 37}{space 1}   -0.49{col 46}{space 3}0.626{col 54}{space 4}-.2121224{col 67}{space 3}  .128432
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}   .66395{col 26}{space 2}  .221371{col 37}{space 1}    3.00{col 46}{space 3}0.004{col 54}{space 4} .2238789{col 67}{space 3} 1.104021
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(41 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      99
{txt}{hline 13}{char +}{hline 30}           F( 12,    86) ={res}   34.55
    {txt}   Model {char |} {res} 19.4293656    12   1.6191138           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res}  4.0300463    86  .046861003           {txt}R-squared     = {res} 0.8282
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.8042
    {txt}   Total {char |} {res} 23.4594119    98  .239381754           {txt}Root MSE      = {res} .21647

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Inf1y_CPIC~e{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Inf1y_CPIC~e {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .9882084{col 26}{space 2} .1147678{col 37}{space 1}    8.61{col 46}{space 3}0.000{col 54}{space 4} .7600575{col 67}{space 3} 1.216359
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0510983{col 26}{space 2} .1630388{col 37}{space 1}   -0.31{col 46}{space 3}0.755{col 54}{space 4}-.3752087{col 67}{space 3} .2730122
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1103214{col 26}{space 2} .1547724{col 37}{space 1}    0.71{col 46}{space 3}0.478{col 54}{space 4}-.1973559{col 67}{space 3} .4179988
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.1719145{col 26}{space 2} .1032382{col 37}{space 1}   -1.67{col 46}{space 3}0.100{col 54}{space 4}-.3771453{col 67}{space 3} .0333163
{txt}{space 12} {c |}
{space 3}pty_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.0610438{col 26}{space 2} .0327464{col 37}{space 1}   -1.86{col 46}{space 3}0.066{col 54}{space 4}-.1261414{col 67}{space 3} .0040539
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.0198286{col 26}{space 2}  .031072{col 37}{space 1}   -0.64{col 46}{space 3}0.525{col 54}{space 4}-.0815977{col 67}{space 3} .0419405
{txt}{space 12} {c |}
{space 4}op_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .0607946{col 26}{space 2}  .026395{col 37}{space 1}    2.30{col 46}{space 3}0.024{col 54}{space 4}  .008323{col 67}{space 3} .1132661
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .0067052{col 26}{space 2}  .026437{col 37}{space 1}    0.25{col 46}{space 3}0.800{col 54}{space 4}-.0458498{col 67}{space 3} .0592603
{txt}{space 12} {c |}
{space 1}mp1ut_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.0092591{col 26}{space 2} .0279096{col 37}{space 1}   -0.33{col 46}{space 3}0.741{col 54}{space 4}-.0647416{col 67}{space 3} .0462234
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.0118367{col 26}{space 2} .0286464{col 37}{space 1}   -0.41{col 46}{space 3}0.680{col 54}{space 4}-.0687839{col 67}{space 3} .0451105
{txt}{space 12} {c |}
{space 1}ED8ut_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.0076132{col 26}{space 2} .0238197{col 37}{space 1}   -0.32{col 46}{space 3}0.750{col 54}{space 4}-.0549651{col 67}{space 3} .0397387
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .0021712{col 26}{space 2} .0244717{col 37}{space 1}    0.09{col 46}{space 3}0.930{col 54}{space 4} -.046477{col 67}{space 3} .0508194
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2013513{col 26}{space 2} .1176176{col 37}{space 1}    1.71{col 46}{space 3}0.091{col 54}{space 4}-.0324647{col 67}{space 3} .4351673
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(41 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      99
{txt}{hline 13}{char +}{hline 30}           F( 12,    86) ={res}   16.21
    {txt}   Model {char |} {res} 54.4071368    12  4.53392807           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res}  24.046811    86  .279614081           {txt}R-squared     = {res} 0.6935
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.6507
    {txt}   Total {char |} {res} 78.4539478    98  .800550488           {txt}Root MSE      = {res} .52879

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} Inf1y_PCEPI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}Inf1y_PCEPI {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .6505327{col 26}{space 2} .1100486{col 37}{space 1}    5.91{col 46}{space 3}0.000{col 54}{space 4} .4317632{col 67}{space 3} .8693021
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0384709{col 26}{space 2} .1253254{col 37}{space 1}   -0.31{col 46}{space 3}0.760{col 54}{space 4}-.2876095{col 67}{space 3} .2106676
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1267602{col 26}{space 2}  .125449{col 37}{space 1}    1.01{col 46}{space 3}0.315{col 54}{space 4}-.1226243{col 67}{space 3} .3761446
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.1636981{col 26}{space 2} .0950674{col 37}{space 1}   -1.72{col 46}{space 3}0.089{col 54}{space 4}-.3526859{col 67}{space 3} .0252897
{txt}{space 12} {c |}
{space 3}pty_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.0969642{col 26}{space 2} .0771478{col 37}{space 1}   -1.26{col 46}{space 3}0.212{col 54}{space 4} -.250329{col 67}{space 3} .0564006
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.1089007{col 26}{space 2} .0726187{col 37}{space 1}   -1.50{col 46}{space 3}0.137{col 54}{space 4}-.2532619{col 67}{space 3} .0354604
{txt}{space 12} {c |}
{space 4}op_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .2400242{col 26}{space 2}   .06228{col 37}{space 1}    3.85{col 46}{space 3}0.000{col 54}{space 4} .1162156{col 67}{space 3} .3638328
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .0618353{col 26}{space 2} .0674198{col 37}{space 1}    0.92{col 46}{space 3}0.362{col 54}{space 4}-.0721908{col 67}{space 3} .1958615
{txt}{space 12} {c |}
{space 1}mp1ut_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .0661031{col 26}{space 2} .0673379{col 37}{space 1}    0.98{col 46}{space 3}0.329{col 54}{space 4}-.0677602{col 67}{space 3} .1999665
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.0359373{col 26}{space 2} .0691502{col 37}{space 1}   -0.52{col 46}{space 3}0.605{col 54}{space 4}-.1734034{col 67}{space 3} .1015287
{txt}{space 12} {c |}
{space 1}ED8ut_shock {c |}
{space 9}--. {c |}{col 14}{res}{space 2}  .069708{col 26}{space 2} .0589991{col 37}{space 1}    1.18{col 46}{space 3}0.241{col 54}{space 4}-.0475782{col 67}{space 3} .1869943
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.0246735{col 26}{space 2} .0608363{col 37}{space 1}   -0.41{col 46}{space 3}0.686{col 54}{space 4} -.145612{col 67}{space 3}  .096265
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .5505704{col 26}{space 2} .1606296{col 37}{space 1}    3.43{col 46}{space 3}0.001{col 54}{space 4} .2312493{col 67}{space 3} .8698916
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(41 missing values generated)

{com}. 
.  
. *Save a dta file for individual IR analysis **
.  
. save "${c -(}mainfolder{c )-}/OtherData/InfShocksQClean.dta",replace 
{txt}file /Users/Myworld/Dropbox/ExpProject/workingfolder/OtherData/InfShocksQClean.dta saved

{com}. 
{txt}end of do-file

{com}. 