{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/ExpProject/workingfolder/pop_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}20 Mar 2020, 15:27:18
{txt}
{com}. 
. ****************************************
. **** Population Moments Analysis ******
. ****************************************
. 
. ***********************
. **   Merge other data**
. ***********************
. 
. use "${c -(}folder{c )-}/SCE/InfExpSCEProbPopM",clear 
{txt}
{com}. 
. merge 1:1 year month using "${c -(}mainfolder{c )-}/OtherData/RecessionDateM.dta", keep(match)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             704{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge  recession_merge
{res}{txt}
{com}. 
. merge 1:1 year month using "${c -(}mainfolder{c )-}/OtherData/InfM.dta",keep(match using master)
{res}{txt}(label _merge already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             174
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}             174{txt}  (_merge==2)

{col 5}matched{col 30}{res}             704{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge inflation_merge 
{res}{txt}
{com}. 
. merge 1:1 year month using "${c -(}folder{c )-}/MichiganSurvey/InfExpMichM.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             174
{txt}{col 9}from master{col 30}{res}             174{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             704{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename inf_exp InfExpMichMed 
{res}{txt}
{com}. rename _merge michigan_merge 
{res}{txt}
{com}. 
. ***********************************************
. ** create quarter variable to match with spf
. *********************************************
. 
. gen quarter = .
{txt}(878 missing values generated)

{com}. replace quarter=1 if month<4 & month >=1
{txt}(221 real changes made)

{com}. replace quarter=2 if month<7 & month >=4
{txt}(219 real changes made)

{com}. replace quarter=3 if month<10 & month >=7
{txt}(219 real changes made)

{com}. replace quarter=4 if month<=12 & month >=10
{txt}(219 real changes made)

{com}. 
. merge m:1 year quarter using "${c -(}folder{c )-}/SPF/individual/InfExpSPFPointPopQ.dta",keep(match using master)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             273
{txt}{col 9}from master{col 30}{res}             272{txt}  (_merge==1)
{col 9}from using{col 30}{res}               1{txt}  (_merge==2)

{col 5}matched{col 30}{res}             606{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge spf_merge 
{res}{txt}
{com}. 
. 
. merge m:1 year quarter using "${c -(}folder{c )-}/SPF/InfExpSPFDstPopQ.dta",keep(match using master)
{res}{txt}{p 0 7 2}
(note: variable
year was 
float, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
quarter was 
float, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             731
{txt}{col 9}from master{col 30}{res}             731{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             148{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge spf_dst_merge 
{res}{txt}
{com}. 
. 
. *************************
. ** Declare time series **
. **************************
. 
. gen date2=string(year)+"m"+string(month)
{txt}
{com}. gen date3= monthly(date2,"YM")
{txt}(1 missing value generated)

{com}. format date3 %tm 
{txt}
{com}. 
. drop date2 date 
{txt}
{com}. rename date3 date
{res}{txt}
{com}. 
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1947m1 to 2020m2
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. sort year quarter month 
{txt}
{com}. 
. 
. ******************************
. *** Computing some measures **
. ******************************
. 
. gen SCE_FE = Q9_mean - Inf1yf_CPIAU
{txt}(816 missing values generated)

{com}. label var SCE_FE "1-yr-ahead forecast error"
{txt}
{com}. 
. gen SPFCPI_FE = CORECPI1y - Inf1yf_CPICore
{txt}(733 missing values generated)

{com}. label var SPFCPI_FE "1-yr-ahead forecast error(SPF CPI)"
{txt}
{com}. gen SPFPCE_FE = COREPCE1y - Inf1yf_PCECore
{txt}(734 missing values generated)

{com}. label var SPFPCE_FE "1-yr-ahead forecast error(SPF PCE)"
{txt}
{com}. 
. 
. *****************************
. ****    Summary Charts ******
. *****************************
. 
. 
. /*
> **************************
> ** Single series charts **
> **************************
> 
> foreach var in Q9_mean Q9_var Q9_iqr Q9_cent50 Q9_disg ///
>                CPI1y PCE1y CORECPI1y COREPCE1y ///
>                            CPI_disg PCE_disg CORECPI_disg COREPCE_disg ///
>                            CPI_ct50 PCE_ct50 CORECPI_ct50 COREPCE_ct50{c -(}
> local var_lb: var label `var'
> tsline `var' if `var'!=.,title("`var_lb'") xtitle("Time") ytitle("")
> graph export "${c -(}sum_graph_folder{c )-}/`var'", as(png) replace 
> {c )-}
> 
> 
> 
> ***************************
> ** Multiple series charts**
> ***************************
> 
> drop if CPI1y ==. | PCE1y==.
> 
> twoway (tsline Q9_mean)  (tsline Q9_cent50,lp("dash")) ///
>                          (tsline InfExpMichMed, lp("dot-dash")) ///
>                                                  (tsline CPI1y, lp("shortdash")), ///
>                                                  title("1-yr-ahead Expected Inflation") ///
>                                                  xtitle("Time") ytitle("") ///
>                                                  legend(label(1 "Mean Expectation(SCE)") label(2 "Median Expectation(SCE)") ///
>                                                         label(3 "Median Expectation(Michigan)") label(4 "Mean Expectation(SPF)"))
> graph export "${c -(}sum_graph_folder{c )-}/mean_med", as(png) replace
> 
> twoway (tsline Q9_mean, ytitle(" ",axis(1))) ///
>        (tsline Q9_var,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if Q9_mean!=., ///
>            title("1-yr-ahead Expected Inflation (SCE)") xtitle("Time") ///
>            legend(label(1 "Average Expectation") label(2 "Average Uncertainty(RHS)"))
> graph export "${c -(}sum_graph_folder{c )-}/mean_var", as(png) replace 
> 
> 
> 
> twoway (tsline Q9_mean, ytitle(" ",axis(1))) ///
>        (tsline Q9_disg,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if Q9_mean!=., ///
>            title("1-yr-ahead Expected Inflation") xtitle("Time") ///
>            legend(label(1 "Average Expectation") label(2 "Disagreements(RHS)"))
> graph export "${c -(}sum_graph_folder{c )-}/mean_disg", as(png) replace 
> 
> 
> twoway (tsline Q9_disg, ytitle(" ",axis(1))) ///
>        (tsline CORECPI_disg,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if CORECPI_disg!=., ///
>            title("Disagreements in 1-yr-ahead Inflation") xtitle("Time") ///
>            legend(label(1 "Disagreements (SCE)") label(2 "Disagreements(SPF)(RHS)"))
> graph export "${c -(}sum_graph_folder{c )-}/disg_disg", as(png) replace 
> 
> 
> twoway (tsline Q9_var, ytitle(" ",axis(1))) ///
>        (tsline PRCCPIVar1mean, yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if Q9_var!=., ///
>            title("Uncertainty in 1-yr-ahead Inflation") xtitle("Time") ///
>            legend(label(1 "Uncertainty (SCE)")  /// 
>                   label(2 "Uncertainty (SPF CPI)(RHS)")) 
>                           
> graph export "${c -(}sum_graph_folder{c )-}/var_var", as(png) replace 
> 
> 
> 
> 
> twoway (tsline CORECPI_disg, ytitle(" ",axis(1))) ///
>        (tsline PRCCPIVar1mean,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if Q9_disg!=., ///
>            title("1-yr-ahead Expected Inflation(SPF)") xtitle("Time") ///
>            legend(label(1 "Disagreements") label(2 "Average Uncertainty(RHS)")) 
> graph export "${c -(}sum_graph_folder{c )-}/var_disg2", as(png) replace 
> 
> 
> twoway (tsline Q9_mean) (tsline CORECPI1y,lp("longdash")) ///
>        (tsline Inf1yf_PCEPI,lp("dash")) ///
>        (tsline Inf1yf_CPIAU,lp("shortdash")) ///
>            (tsline Inf1yf_CPICore,lp("dash_dot")) ///
>            if Q9_mean!=., ///
>            title("1-yr-ahead Expected Inflation") xtitle("Time") ytitle("") ///
>            legend(label(1 "Mean Forecast(SCE)") label(2 "Mean Forecast(SPF)") label(3 "Realized Inflation(PCE)") ///
>                   label(4 "Realized Inflation(Headline CPI)") label(5 "Realized Inflation(Core CPI)"))
> graph export "${c -(}sum_graph_folder{c )-}/mean_true", as(png) replace
> 
> 
> twoway (tsline Q9_mean)  (tsline Inf1y_PCEPI,lp("dash")) ///
>        (tsline Inf1y_CPIAU,lp("shortdash")) ///
>            (tsline Inf1y_CPICore,lp("dash_dot")) ///
>            if Q9_mean!=., ///
>            title("1-yr-ahead Expected Inflation") xtitle("Time") ytitle("") ///
>            legend(label(1 "Mean Expectation") label(2 "Past Inflation(PCE)") ///
>                   label(3 "Past Inflation(Headline CPI)") label(4 "Past Inflation(Core CPI)"))
> graph export "${c -(}sum_graph_folder{c )-}/mean_past", as(png) replace
> 
> 
> twoway (tsline SCE_FE,ytitle("",axis(1)))  (tsline SPFCPI_FE, yaxis(2) lp("dash")) ///
>        (tsline SPFPCE_FE, yaxis(2) lp("dash_dot"))  ///  
>                          if SPFPCE_FE!=., ///
>                                                  title("1-yr-ahead Forecast Errors") ///
>                                                  xtitle("Time") ytitle("") ///
>                                                  legend(label(1 "SCE") label(2 "SPF CPI(RHS)") ///
>                                                  label(3 "SPF PCE(RHS)"))
> graph export "${c -(}sum_graph_folder{c )-}/fe_fe", as(png) replace
> 
> 
> 
> 
> twoway (tsline Q9_disg, ytitle(" ",axis(1))) ///
>        (tsline Q9_var,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if Q9_disg!=., ///
>            title("1-yr-ahead Expected Inflation(SCE)") xtitle("Time") ///
>            legend(label(1 "Disagreements") label(2 "Average Uncertainty(RHS)")) 
> graph export "${c -(}sum_graph_folder{c )-}/var_disgSCEM", as(png) replace 
> 
> 
> twoway (tsline SCE_FE, ytitle(" ",axis(1))) ///
>        (tsline Q9_var,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if Q9_var!=., ///
>            title("1-yr-ahead Expected Inflation(SCE)") xtitle("Time") ///
>            legend(label(1 "Average Forecast Error") label(2 "Average Uncertainty(RHS)")) 
> graph export "${c -(}sum_graph_folder{c )-}/fe_varSCEM", as(png) replace
> 
> pwcorr Inf1yf_CPIAU Q9_var, star(0.05)
> local rho: display %4.2f r(rho) 
> twoway (tsline Inf1yf_CPIAU,ytitle(" ",axis(1))lp("shortdash") lwidth(thick)) ///
>        (tsline Q9_var, yaxis(2) ytitle("",axis(2)) lp("longdash") lwidth(thick)) ///
>            if Q9_var!=., ///
>            title("1-yr-ahead Expected Inflation(SCE)",size(large)) xtitle("Time") ytitle("") ///
>            legend(label(1 "Headline CPI Inflation") ///
>                   label(2 "Average Uncertainty(RHS)") size(sml)) ///
>            caption("{c -(}superscript:Corr Coeff: `rho'{c )-}", ///
>            justification(left) position(11) size(large))
> graph export "${c -(}sum_graph_folder{c )-}/true_varSCEM", as(png) replace 
> */
. 
. ********************************************
. ** These are the charts for paper draft 
. ********************************************
. 
. 
. ** generate absolute values of FE for plotting
. 
. foreach var in SCE{c -(}
{txt}  2{com}. gen `var'_abFE = abs(`var'_FE)
{txt}  3{com}. label var `var'_abFE "Absolute Val of Average Forecast Error"
{txt}  4{com}. {c )-}
{txt}(816 missing values generated)

{com}. 
. 
. label var Inf1yf_CPIAU "Realized Headline CPI Inflation"
{txt}
{com}. label var SCE_FE "Average Forecast Error"
{txt}
{com}. label var Q9_disg "Disagreement"
{txt}
{com}. label var Q9_var "Average Uncertainty(RHS)"
{txt}
{com}. 
. foreach var in Inf1yf_CPIAU SCE_abFE Q9_disg{c -(}
{txt}  2{com}. pwcorr `var' Q9_var, star(0.05)
{txt}  3{com}. local rho: display %4.2f r(rho) 
{txt}  4{com}. twoway (tsline `var',ytitle(" ",axis(1)) lp("shortdash") lwidth(thick)) ///
>        (tsline Q9_var, yaxis(2) ytitle("",axis(2)) lp("longdash") lwidth(thick)) ///
>            if Q9_var!=., ///
>            title("SCE",size(large)) xtitle("Time") ytitle("") ///
>            legend(size(large) col(1)) ///
>            caption("{c -(}superscript:Corr Coeff= `rho'{c )-}", ///
>            justification(left) position(11) size(large))
{txt}  5{com}. graph export "${c -(}sum_graph_folder{c )-}/`var'_varSCEM", as(png) replace
{txt}  6{com}. {c )-}

             {txt}{c |} Inf1yf~U   Q9_var
{hline 13}{c +}{hline 18}
Inf1yf_CPIAU {c |} {res}  1.0000 
      {txt}Q9_var {c |} {res} -0.2583*  1.0000 
{txt}(file /Users/Myworld/Dropbox/ExpProject/workingfolder/graphs/pop/Inf1yf_CPIAU_varSCEM written in PNG format)

             {c |} SCE_abFE   Q9_var
{hline 13}{c +}{hline 18}
    SCE_abFE {c |} {res}  1.0000 
      {txt}Q9_var {c |} {res}  0.2776*  1.0000 
{txt}(file /Users/Myworld/Dropbox/ExpProject/workingfolder/graphs/pop/SCE_abFE_varSCEM written in PNG format)

             {c |}  Q9_disg   Q9_var
{hline 13}{c +}{hline 18}
     Q9_disg {c |} {res}  1.0000 
      {txt}Q9_var {c |} {res}  0.4474*  1.0000 
{txt}(file /Users/Myworld/Dropbox/ExpProject/workingfolder/graphs/pop/Q9_disg_varSCEM written in PNG format)

{com}. 
. 
. 
. twoway (tsline Q9_varp25, ytitle(" ",axis(1)) lp("shortdash") lwidth(thick)) ///
>        (tsline Q9_varp75, ytitle(" ",axis(1)) lp("shortdash") lwidth(thick)) ///
>            (tsline Q9_varp50, ytitle(" ",axis(1)) lp("solid") lwidth(thick)) ///
>            if Q9_varp50!=. , /// 
>            title("SCE") xtitle("Time") ///
>            legend(label(1 "25 percentile of uncertainty") label(2 "75 percentile of uncertainty") ///
>                   label(3 "50 percentile of uncertainty") col(1)) 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/IQRvarSCEM", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/ExpProject/workingfolder/graphs/pop/IQRvarSCEM written in PNG format)

{com}. 
. 
. 
. twoway (tsline Q9_meanp25, ytitle(" ",axis(1)) lp("shortdash") lwidth(thick)) ///
>        (tsline Q9_meanp75, ytitle(" ",axis(1)) lp("shortdash") lwidth(thick)) ///
>            (tsline Q9_meanp50, ytitle(" ",axis(1)) lp("solid") lwidth(thick)) ///
>            if Q9_varp50!=. , /// 
>            title("SCE") xtitle("Time") ///
>            legend(label(1 "25 percentile of forecast") label(2 "75 percentile of forecast") ///
>                   label(3 "50 percentile of forecast") col(1)) 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/IQRmeanSCEM", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/ExpProject/workingfolder/graphs/pop/IQRmeanSCEM written in PNG format)

{com}. */
. 
. 
. ***************************
. ***  Population Moments *** 
. ***************************
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1947m1 to 2020m2
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. 
. estpost tabstat Q9_mean Q9_var Q9_disg Q9_iqr CPI1y PCE1y CORECPI1y COREPCE1y ///
>                 Q9c_mean Q9c_var Q9c_disg Q9c_iqr  /// 
>                 CPI_disg PCE_disg CORECPI_disg COREPCE_disg PRCCPIVar1mean PRCPCEVar1mean, ///
>                             st(mean var median) columns(statistics)

{txt}Summary statistics: mean variance p50
     for variables: Q9_mean Q9_var Q9_disg Q9_iqr CPI1y PCE1y CORECPI1y COREPCE1y Q9c_mean Q9c_var Q9c_disg Q9c_iqr CPI_disg PCE_disg CORECPI_disg COREPCE_disg PRCCPIVar1mean PRCPCEVar1mean

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:e(mean)}{space 1}{space 1}{ralign 9:e(varia~)}{space 1}{space 1}{ralign 9:e(p50)}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}
{space 0}{space 0}{ralign 12:Q9_mean}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 3.281084}}}{space 1}{space 1}{ralign 9:{res:{sf: .0645828}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.212349}}}{space 1}
{space 0}{space 0}{ralign 12:Q9_var}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 9.697468}}}{space 1}{space 1}{ralign 9:{res:{sf: .4407553}}}{space 1}{space 1}{ralign 9:{res:{sf: 9.658342}}}{space 1}
{space 0}{space 0}{ralign 12:Q9_disg}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 6.162519}}}{space 1}{space 1}{ralign 9:{res:{sf: .3046296}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.114113}}}{space 1}
{space 0}{space 0}{ralign 12:Q9_iqr}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 4.054852}}}{space 1}{space 1}{ralign 9:{res:{sf: .0401299}}}{space 1}{space 1}{ralign 9:{res:{sf: 4.030001}}}{space 1}
{space 0}{space 0}{ralign 12:CPI1y}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 3.014775}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.413239}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.473909}}}{space 1}
{space 0}{space 0}{ralign 12:PCE1y}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.847065}}}{space 1}{space 1}{ralign 9:{res:{sf:  .052896}}}{space 1}{space 1}{ralign 9:{res:{sf:   1.8534}}}{space 1}
{space 0}{space 0}{ralign 12:CORECPI1y}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.971262}}}{space 1}{space 1}{ralign 9:{res:{sf:  .088121}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.004349}}}{space 1}
{space 0}{space 0}{ralign 12:COREPCE1y}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.754005}}}{space 1}{space 1}{ralign 9:{res:{sf:   .06366}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.775755}}}{space 1}
{space 0}{space 0}{ralign 12:Q9c_mean}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 3.396204}}}{space 1}{space 1}{ralign 9:{res:{sf: .0684268}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.311803}}}{space 1}
{space 0}{space 0}{ralign 12:Q9c_var}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 10.12165}}}{space 1}{space 1}{ralign 9:{res:{sf: .3949908}}}{space 1}{space 1}{ralign 9:{res:{sf: 10.14575}}}{space 1}
{space 0}{space 0}{ralign 12:Q9c_disg}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  6.95167}}}{space 1}{space 1}{ralign 9:{res:{sf: .2677408}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.909791}}}{space 1}
{space 0}{space 0}{ralign 12:Q9c_iqr}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 4.161529}}}{space 1}{space 1}{ralign 9:{res:{sf: .0335854}}}{space 1}{space 1}{ralign 9:{res:{sf:  4.17732}}}{space 1}
{space 0}{space 0}{ralign 12:CPI_disg}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .5022143}}}{space 1}{space 1}{ralign 9:{res:{sf: .5895967}}}{space 1}{space 1}{ralign 9:{res:{sf: .2933465}}}{space 1}
{space 0}{space 0}{ralign 12:PCE_disg}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .3472125}}}{space 1}{space 1}{ralign 9:{res:{sf: .0503315}}}{space 1}{space 1}{ralign 9:{res:{sf: .2818246}}}{space 1}
{space 0}{space 0}{ralign 12:CORECPI_disg}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  .192936}}}{space 1}{space 1}{ralign 9:{res:{sf: .0294365}}}{space 1}{space 1}{ralign 9:{res:{sf:  .107817}}}{space 1}
{space 0}{space 0}{ralign 12:COREPCE_disg}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .1579588}}}{space 1}{space 1}{ralign 9:{res:{sf: .0229367}}}{space 1}{space 1}{ralign 9:{res:{sf: .1031996}}}{space 1}
{space 0}{space 0}{ralign 12:PRCCPIVar1~n}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0834114}}}{space 1}{space 1}{ralign 9:{res:{sf: .0012811}}}{space 1}{space 1}{ralign 9:{res:{sf: .0802793}}}{space 1}
{space 0}{space 0}{ralign 12:PRCPCEVar1~n}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0798223}}}{space 1}{space 1}{ralign 9:{res:{sf: .0009688}}}{space 1}{space 1}{ralign 9:{res:{sf: .0743354}}}{space 1}

{com}. esttab . using "${c -(}sum_table_folder{c )-}/pop_sum_stats.csv", cells("mean(fmt(a3)) var(fmt(a3)) median(fmt(a3))") replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/pop_sum_stats.csv"'})

{com}. 
. eststo clear
{txt}
{com}. foreach var in Q9_mean Q9_var Q9_disg Q9c_mean Q9c_var Q9c_disg CPI1y PCE1y CORECPI1y COREPCE1y{c -(}
{txt}  2{com}. gen `var'_ch = `var'-l1.`var'
{txt}  3{com}. label var `var'_ch "m to m+1 change of `var'"
{txt}  4{com}. eststo: reg `var' l(1/5).`var'
{txt}  5{com}. eststo: reg `var'_ch l(1/5).`var'_ch
{txt}  6{com}. corrgram `var', lags(5) 
{txt}  7{com}. *gen `var'1=`r(ac1)'
. *label var `var'1 "Auto-correlation coefficient of `var'"
. {c )-}
{txt}(817 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      58
{txt}{hline 13}{char +}{hline 30}           F(  5,    52) ={res}   55.45
    {txt}   Model {char |} {res} 2.65275775     5   .53055155           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} .497535156    52  .009567984           {txt}R-squared     = {res} 0.8421
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.8269
    {txt}   Total {char |} {res} 3.15029291    57  .055268297           {txt}Root MSE      = {res} .09782

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     Q9_mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Q9_mean {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .7624735{col 26}{space 2} .1376085{col 37}{space 1}    5.54{col 46}{space 3}0.000{col 54}{space 4} .4863419{col 67}{space 3} 1.038605
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .1118967{col 26}{space 2}  .168582{col 37}{space 1}    0.66{col 46}{space 3}0.510{col 54}{space 4}-.2263878{col 67}{space 3} .4501811
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1035679{col 26}{space 2} .1632486{col 37}{space 1}    0.63{col 46}{space 3}0.529{col 54}{space 4}-.2240143{col 67}{space 3} .4311502
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.0332247{col 26}{space 2} .1582311{col 37}{space 1}   -0.21{col 46}{space 3}0.835{col 54}{space 4}-.3507387{col 67}{space 3} .2842892
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0436664{col 26}{space 2} .1232548{col 37}{space 1}   -0.35{col 46}{space 3}0.725{col 54}{space 4}-.2909953{col 67}{space 3} .2036625
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3174741{col 26}{space 2} .1811843{col 37}{space 1}    1.75{col 46}{space 3}0.086{col 54}{space 4}-.0460989{col 67}{space 3} .6810471
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}      57
{txt}{hline 13}{char +}{hline 30}           F(  5,    51) ={res}    0.37
    {txt}   Model {char |} {res} .019207325     5  .003841465           {txt}Prob > F      = {res} 0.8656
    {txt}Residual {char |} {res} .526771824    51  .010328859           {txt}R-squared     = {res} 0.0352
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0594
    {txt}   Total {char |} {res} .545979149    56  .009749628           {txt}Root MSE      = {res} .10163

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  Q9_mean_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}Q9_mean_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.1725313{col 26}{space 2} .1410345{col 37}{space 1}   -1.22{col 46}{space 3}0.227{col 54}{space 4}-.4556699{col 67}{space 3} .1106073
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0463323{col 26}{space 2}  .138885{col 37}{space 1}   -0.33{col 46}{space 3}0.740{col 54}{space 4}-.3251555{col 67}{space 3} .2324909
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .0476427{col 26}{space 2} .1390251{col 37}{space 1}    0.34{col 46}{space 3}0.733{col 54}{space 4}-.2314618{col 67}{space 3} .3267473
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0083576{col 26}{space 2} .1291989{col 37}{space 1}    0.06{col 46}{space 3}0.949{col 54}{space 4}  -.25102{col 67}{space 3} .2677353
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0382067{col 26}{space 2} .1280088{col 37}{space 1}   -0.30{col 46}{space 3}0.767{col 54}{space 4}-.2951951{col 67}{space 3} .2187818
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0049928{col 26}{space 2} .0136857{col 37}{space 1}   -0.36{col 46}{space 3}0.717{col 54}{space 4} -.032468{col 67}{space 3} .0224824
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est2{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.9031{col 18} 0.9068{col 27} 53.869{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} 
{txt}2     {res}{col 9} 0.8379{col 18} 0.1159{col 27}    101{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}3     {res}{col 9} 0.7734{col 18} 0.1133{col 27} 141.82{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}4     {res}{col 9} 0.6931{col 18}-0.0690{col 27} 175.16{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}5     {res}{col 9} 0.6292{col 18}-0.0437{col 27} 203.12{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}(817 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      58
{txt}{hline 13}{char +}{hline 30}           F(  5,    52) ={res}    5.08
    {txt}   Model {char |} {res} 7.32367748     5   1.4647355           {txt}Prob > F      = {res} 0.0007
    {txt}Residual {char |} {res} 14.9822551    52   .28812029           {txt}R-squared     = {res} 0.3283
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.2637
    {txt}   Total {char |} {res} 22.3059325    57   .39133215           {txt}Root MSE      = {res} .53677

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      Q9_var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}Q9_var {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}  .374951{col 26}{space 2} .1377669{col 37}{space 1}    2.72{col 46}{space 3}0.009{col 54}{space 4} .0985015{col 67}{space 3} .6514004
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .3317462{col 26}{space 2} .1458976{col 37}{space 1}    2.27{col 46}{space 3}0.027{col 54}{space 4} .0389812{col 67}{space 3} .6245113
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.1812722{col 26}{space 2} .1436047{col 37}{space 1}   -1.26{col 46}{space 3}0.212{col 54}{space 4}-.4694361{col 67}{space 3} .1068918
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .1381692{col 26}{space 2} .1426578{col 37}{space 1}    0.97{col 46}{space 3}0.337{col 54}{space 4}-.1480946{col 67}{space 3}  .424433
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.1437357{col 26}{space 2} .1208404{col 37}{space 1}   -1.19{col 46}{space 3}0.240{col 54}{space 4}-.3862197{col 67}{space 3} .0987483
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 4.651463{col 26}{space 2} 1.589052{col 37}{space 1}    2.93{col 46}{space 3}0.005{col 54}{space 4} 1.462796{col 67}{space 3}  7.84013
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est3{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}      57
{txt}{hline 13}{char +}{hline 30}           F(  5,    51) ={res}    4.96
    {txt}   Model {char |} {res} 8.03962768     5  1.60792554           {txt}Prob > F      = {res} 0.0009
    {txt}Residual {char |} {res} 16.5181665    51  .323885617           {txt}R-squared     = {res} 0.3274
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.2614
    {txt}   Total {char |} {res} 24.5577942    56  .438532039           {txt}Root MSE      = {res} .56911

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Q9_var_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}Q9_var_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.4864707{col 26}{space 2} .1371477{col 37}{space 1}   -3.55{col 46}{space 3}0.001{col 54}{space 4}-.7618063{col 67}{space 3}-.2111351
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0472063{col 26}{space 2} .1521486{col 37}{space 1}   -0.31{col 46}{space 3}0.758{col 54}{space 4}-.3526575{col 67}{space 3} .2582448
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.1044082{col 26}{space 2} .1487912{col 37}{space 1}   -0.70{col 46}{space 3}0.486{col 54}{space 4} -.403119{col 67}{space 3} .1943027
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0786123{col 26}{space 2} .1379627{col 37}{space 1}    0.57{col 46}{space 3}0.571{col 54}{space 4}-.1983592{col 67}{space 3} .3555839
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0710001{col 26}{space 2} .1207645{col 37}{space 1}   -0.59{col 46}{space 3}0.559{col 54}{space 4}-.3134449{col 67}{space 3} .1714448
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0015447{col 26}{space 2} .0755136{col 37}{space 1}    0.02{col 46}{space 3}0.984{col 54}{space 4}-.1500551{col 67}{space 3} .1531446
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est4{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.4002{col 18} 0.4025{col 27}  10.58{col 36}0.0011{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c LT}{hline 1}{hline 1}{hline 1}     
{txt}2     {res}{col 9} 0.3213{col 18} 0.1914{col 27} 17.509{col 36}0.0002{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c LT}{hline 1}       
{txt}3     {res}{col 9} 0.0726{col 18}-0.1973{col 27} 17.869{col 36}0.0005{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}4     {res}{col 9} 0.1415{col 18} 0.0872{col 27} 19.259{col 36}0.0007{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}5     {res}{col 9}-0.0671{col 18}-0.1437{col 27} 19.577{col 36}0.0015{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}(817 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      58
{txt}{hline 13}{char +}{hline 30}           F(  5,    52) ={res}   14.31
    {txt}   Model {char |} {res} 9.16447996     5  1.83289599           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 6.66058415    52  .128088157           {txt}R-squared     = {res} 0.5791
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.5386
    {txt}   Total {char |} {res} 15.8250641    57  .277632704           {txt}Root MSE      = {res} .35789

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     Q9_disg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Q9_disg {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}  .258654{col 26}{space 2} .1366457{col 37}{space 1}    1.89{col 46}{space 3}0.064{col 54}{space 4}-.0155457{col 67}{space 3} .5328537
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .1682077{col 26}{space 2} .1326816{col 37}{space 1}    1.27{col 46}{space 3}0.211{col 54}{space 4}-.0980374{col 67}{space 3} .4344528
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1494447{col 26}{space 2} .1330668{col 37}{space 1}    1.12{col 46}{space 3}0.267{col 54}{space 4}-.1175733{col 67}{space 3} .4164628
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .1254262{col 26}{space 2} .1331378{col 37}{space 1}    0.94{col 46}{space 3}0.351{col 54}{space 4}-.1417344{col 67}{space 3} .3925867
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .1536989{col 26}{space 2} .1220007{col 37}{space 1}    1.26{col 46}{space 3}0.213{col 54}{space 4}-.0911134{col 67}{space 3} .3985112
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .8475661{col 26}{space 2} .6267194{col 37}{space 1}    1.35{col 46}{space 3}0.182{col 54}{space 4}-.4100384{col 67}{space 3} 2.105171
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est5{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}      57
{txt}{hline 13}{char +}{hline 30}           F(  5,    51) ={res}    5.37
    {txt}   Model {char |} {res} 3.59841953     5  .719683907           {txt}Prob > F      = {res} 0.0005
    {txt}Residual {char |} {res} 6.83045015    51  .133930395           {txt}R-squared     = {res} 0.3450
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.2808
    {txt}   Total {char |} {res} 10.4288697    56  .186229816           {txt}Root MSE      = {res} .36597

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  Q9_disg_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}Q9_disg_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.6899529{col 26}{space 2} .1400309{col 37}{space 1}   -4.93{col 46}{space 3}0.000{col 54}{space 4}-.9710766{col 67}{space 3}-.4088292
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.5168622{col 26}{space 2} .1689018{col 37}{space 1}   -3.06{col 46}{space 3}0.004{col 54}{space 4}-.8559466{col 67}{space 3}-.1777777
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.3644166{col 26}{space 2} .1742113{col 37}{space 1}   -2.09{col 46}{space 3}0.041{col 54}{space 4}-.7141603{col 67}{space 3}-.0146729
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} -.198654{col 26}{space 2} .1532062{col 37}{space 1}   -1.30{col 46}{space 3}0.201{col 54}{space 4}-.5062283{col 67}{space 3} .1089202
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0349822{col 26}{space 2} .1286552{col 37}{space 1}    0.27{col 46}{space 3}0.787{col 54}{space 4}-.2233038{col 67}{space 3} .2932683
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0490341{col 26}{space 2} .0496596{col 37}{space 1}   -0.99{col 46}{space 3}0.328{col 54}{space 4}-.1487299{col 67}{space 3} .0506618
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est6{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.6715{col 18} 0.6733{col 27}  29.78{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   
{txt}2     {res}{col 9} 0.5754{col 18} 0.2250{col 27} 52.008{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c LT}{hline 1}       
{txt}3     {res}{col 9} 0.5555{col 18} 0.1750{col 27} 73.069{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c LT}{hline 1}       
{txt}4     {res}{col 9} 0.5548{col 18} 0.1795{col 27} 94.429{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c LT}{hline 1}       
{txt}5     {res}{col 9} 0.5414{col 18} 0.1537{col 27} 115.12{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c LT}{hline 1}       
{txt}(817 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      58
{txt}{hline 13}{char +}{hline 30}           F(  5,    52) ={res}   76.52
    {txt}   Model {char |} {res} 2.72546592     5  .545093183           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res}  .37041545    52  .007123374           {txt}R-squared     = {res} 0.8804
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.8688
    {txt}   Total {char |} {res} 3.09588137    57  .054313708           {txt}Root MSE      = {res}  .0844

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    Q9c_mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}Q9c_mean {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .6546304{col 26}{space 2} .1314234{col 37}{space 1}    4.98{col 46}{space 3}0.000{col 54}{space 4} .3909101{col 67}{space 3} .9183507
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .5305188{col 26}{space 2} .1520907{col 37}{space 1}    3.49{col 46}{space 3}0.001{col 54}{space 4} .2253265{col 67}{space 3} .8357111
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.2553797{col 26}{space 2} .1583066{col 37}{space 1}   -1.61{col 46}{space 3}0.113{col 54}{space 4}-.5730451{col 67}{space 3} .0622858
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} -.163202{col 26}{space 2} .1404618{col 37}{space 1}   -1.16{col 46}{space 3}0.251{col 54}{space 4}-.4450591{col 67}{space 3} .1186552
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .1533118{col 26}{space 2} .1178455{col 37}{space 1}    1.30{col 46}{space 3}0.199{col 54}{space 4}-.0831626{col 67}{space 3} .3897861
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2622012{col 26}{space 2} .1608569{col 37}{space 1}    1.63{col 46}{space 3}0.109{col 54}{space 4}-.0605818{col 67}{space 3} .5849841
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est7{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}      57
{txt}{hline 13}{char +}{hline 30}           F(  5,    51) ={res}    3.03
    {txt}   Model {char |} {res} .114399483     5  .022879897           {txt}Prob > F      = {res} 0.0181
    {txt}Residual {char |} {res} .385182362    51  .007552595           {txt}R-squared     = {res} 0.2290
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.1534
    {txt}   Total {char |} {res} .499581844    56  .008921104           {txt}Root MSE      = {res} .08691

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} Q9c_mean_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}Q9c_mean_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.3123025{col 26}{space 2} .1393425{col 37}{space 1}   -2.24{col 46}{space 3}0.029{col 54}{space 4}-.5920441{col 67}{space 3}-.0325608
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .2692228{col 26}{space 2} .1336947{col 37}{space 1}    2.01{col 46}{space 3}0.049{col 54}{space 4} .0008194{col 67}{space 3} .5376262
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .0188267{col 26}{space 2}  .139034{col 37}{space 1}    0.14{col 46}{space 3}0.893{col 54}{space 4}-.2602957{col 67}{space 3}  .297949
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.2071077{col 26}{space 2} .1271893{col 37}{space 1}   -1.63{col 46}{space 3}0.110{col 54}{space 4} -.462451{col 67}{space 3} .0482356
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0949985{col 26}{space 2} .1235707{col 37}{space 1}   -0.77{col 46}{space 3}0.446{col 54}{space 4}-.3430771{col 67}{space 3} .1530801
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0082657{col 26}{space 2} .0118858{col 37}{space 1}   -0.70{col 46}{space 3}0.490{col 54}{space 4}-.0321274{col 67}{space 3}  .015596
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est8{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.9044{col 18} 0.9044{col 27} 54.023{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} 
{txt}2     {res}{col 9} 0.8713{col 18} 0.3333{col 27} 104.99{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c LT}{hline 1}{hline 1}      
{txt}3     {res}{col 9} 0.7790{col 18}-0.1293{col 27} 146.41{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}       {hline 1}{c RT}        
{txt}4     {res}{col 9} 0.7013{col 18}-0.0722{col 27} 180.54{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}5     {res}{col 9} 0.6546{col 18} 0.1533{col 27}  210.8{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c LT}{hline 1}       
{txt}(817 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      58
{txt}{hline 13}{char +}{hline 30}           F(  5,    52) ={res}   14.11
    {txt}   Model {char |} {res} 10.8055917     5  2.16111835           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 7.96230748    52  .153121298           {txt}R-squared     = {res} 0.5757
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.5350
    {txt}   Total {char |} {res} 18.7678992    57   .32926139           {txt}Root MSE      = {res} .39131

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     Q9c_var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Q9c_var {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .7129733{col 26}{space 2} .1364418{col 37}{space 1}    5.23{col 46}{space 3}0.000{col 54}{space 4} .4391828{col 67}{space 3} .9867639
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}  .221891{col 26}{space 2} .1665167{col 37}{space 1}    1.33{col 46}{space 3}0.188{col 54}{space 4}-.1122493{col 67}{space 3} .5560313
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.2678373{col 26}{space 2} .1375039{col 37}{space 1}   -1.95{col 46}{space 3}0.057{col 54}{space 4}-.5437591{col 67}{space 3} .0080845
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0484141{col 26}{space 2} .1398721{col 37}{space 1}    0.35{col 46}{space 3}0.731{col 54}{space 4}-.2322599{col 67}{space 3}  .329088
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0579068{col 26}{space 2} .1041861{col 37}{space 1}   -0.56{col 46}{space 3}0.581{col 54}{space 4}-.2669715{col 67}{space 3} .1511578
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.470128{col 26}{space 2}  1.19605{col 37}{space 1}    2.90{col 46}{space 3}0.005{col 54}{space 4} 1.070078{col 67}{space 3} 5.870179
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est9{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}      57
{txt}{hline 13}{char +}{hline 30}           F(  5,    51) ={res}    1.14
    {txt}   Model {char |} {res} 1.01406206     5  .202812412           {txt}Prob > F      = {res} 0.3508
    {txt}Residual {char |} {res} 9.06264419    51  .177698906           {txt}R-squared     = {res} 0.1006
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0125
    {txt}   Total {char |} {res} 10.0767062    56  .179941183           {txt}Root MSE      = {res} .42154

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  Q9c_var_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}Q9c_var_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.1359755{col 26}{space 2} .1386108{col 37}{space 1}   -0.98{col 46}{space 3}0.331{col 54}{space 4}-.4142483{col 67}{space 3} .1422974
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .1247165{col 26}{space 2} .1389376{col 37}{space 1}    0.90{col 46}{space 3}0.374{col 54}{space 4}-.1542123{col 67}{space 3} .4036453
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.2027015{col 26}{space 2} .1315135{col 37}{space 1}   -1.54{col 46}{space 3}0.129{col 54}{space 4}-.4667259{col 67}{space 3} .0613229
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} -.087744{col 26}{space 2} .1137904{col 37}{space 1}   -0.77{col 46}{space 3}0.444{col 54}{space 4}-.3161877{col 67}{space 3} .1406997
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0548008{col 26}{space 2} .1057078{col 37}{space 1}   -0.52{col 46}{space 3}0.606{col 54}{space 4}-.2670181{col 67}{space 3} .1574166
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0067109{col 26}{space 2} .0560357{col 37}{space 1}   -0.12{col 46}{space 3}0.905{col 54}{space 4}-.1192073{col 67}{space 3} .1057854
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est10{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.5900{col 18} 0.5910{col 27}  22.99{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    
{txt}2     {res}{col 9} 0.3166{col 18}-0.0958{col 27} 29.721{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c |}        
{txt}3     {res}{col 9} 0.1832{col 18}-0.1104{col 27} 32.012{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}4     {res}{col 9} 0.0947{col 18} 0.0601{col 27} 32.634{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}5     {res}{col 9}-0.0062{col 18}-0.0579{col 27} 32.636{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}(817 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      58
{txt}{hline 13}{char +}{hline 30}           F(  5,    52) ={res}   14.50
    {txt}   Model {char |} {res} 8.05124189     5  1.61024838           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 5.77586634    52  .111074353           {txt}R-squared     = {res} 0.5823
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.5421
    {txt}   Total {char |} {res} 13.8271082    57  .242580846           {txt}Root MSE      = {res} .33328

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    Q9c_disg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}Q9c_disg {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .2479251{col 26}{space 2} .1358713{col 37}{space 1}    1.82{col 46}{space 3}0.074{col 54}{space 4}-.0247206{col 67}{space 3} .5205709
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .4736645{col 26}{space 2} .1392354{col 37}{space 1}    3.40{col 46}{space 3}0.001{col 54}{space 4} .1942681{col 67}{space 3} .7530608
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0628806{col 26}{space 2} .1474966{col 37}{space 1}   -0.43{col 46}{space 3}0.672{col 54}{space 4}-.3588541{col 67}{space 3} .2330929
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.0114166{col 26}{space 2} .1343422{col 37}{space 1}   -0.08{col 46}{space 3}0.933{col 54}{space 4} -.280994{col 67}{space 3} .2581608
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .1906302{col 26}{space 2} .1299317{col 37}{space 1}    1.47{col 46}{space 3}0.148{col 54}{space 4}-.0700969{col 67}{space 3} .4513573
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.088938{col 26}{space 2} .7058586{col 37}{space 1}    1.54{col 46}{space 3}0.129{col 54}{space 4}-.3274707{col 67}{space 3} 2.505347
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est11{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}      57
{txt}{hline 13}{char +}{hline 30}           F(  5,    51) ={res}    7.51
    {txt}   Model {char |} {res} 4.41640773     5  .883281545           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 6.00132252    51  .117672991           {txt}R-squared     = {res} 0.4239
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.3675
    {txt}   Total {char |} {res} 10.4177302    56  .186030897           {txt}Root MSE      = {res} .34303

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} Q9c_disg_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}Q9c_disg_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.6798435{col 26}{space 2} .1393898{col 37}{space 1}   -4.88{col 46}{space 3}0.000{col 54}{space 4}-.9596802{col 67}{space 3}-.4000068
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} -.184327{col 26}{space 2} .1668381{col 37}{space 1}   -1.10{col 46}{space 3}0.274{col 54}{space 4}-.5192684{col 67}{space 3} .1506144
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.2960989{col 26}{space 2} .1741972{col 37}{space 1}   -1.70{col 46}{space 3}0.095{col 54}{space 4}-.6458144{col 67}{space 3} .0536166
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.2597461{col 26}{space 2} .1653353{col 37}{space 1}   -1.57{col 46}{space 3}0.122{col 54}{space 4}-.5916706{col 67}{space 3} .0721784
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0121882{col 26}{space 2} .1341818{col 37}{space 1}    0.09{col 46}{space 3}0.928{col 54}{space 4}-.2571931{col 67}{space 3} .2815695
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0418293{col 26}{space 2} .0466671{col 37}{space 1}   -0.90{col 46}{space 3}0.374{col 54}{space 4}-.1355175{col 67}{space 3} .0518588
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est12{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.6504{col 18} 0.6521{col 27} 27.939{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   
{txt}2     {res}{col 9} 0.6919{col 18} 0.4684{col 27} 60.072{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c LT}{hline 1}{hline 1}{hline 1}     
{txt}3     {res}{col 9} 0.5413{col 18} 0.0155{col 27} 80.069{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}4     {res}{col 9} 0.5226{col 18} 0.0526{col 27} 99.027{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}5     {res}{col 9} 0.5016{col 18} 0.1906{col 27} 116.79{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c LT}{hline 1}       
{txt}(427 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}     448
{txt}{hline 13}{char +}{hline 30}           F(  5,   442) ={res} 3695.07
    {txt}   Model {char |} {res} 513.285482     5  102.657096           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 12.2797331   442  .027782202           {txt}R-squared     = {res} 0.9766
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.9764
    {txt}   Total {char |} {res} 525.565215   447  1.17576111           {txt}Root MSE      = {res} .16668

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       CPI1y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}CPI1y {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .9487661{col 26}{space 2} .0475027{col 37}{space 1}   19.97{col 46}{space 3}0.000{col 54}{space 4} .8554069{col 67}{space 3} 1.042125
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0004946{col 26}{space 2}  .065499{col 37}{space 1}    0.01{col 46}{space 3}0.994{col 54}{space 4}-.1282335{col 67}{space 3} .1292227
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0369137{col 26}{space 2} .0654843{col 37}{space 1}   -0.56{col 46}{space 3}0.573{col 54}{space 4} -.165613{col 67}{space 3} .0917856
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0349571{col 26}{space 2} .0655158{col 37}{space 1}    0.53{col 46}{space 3}0.594{col 54}{space 4} -.093804{col 67}{space 3} .1637182
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0196535{col 26}{space 2} .0465697{col 37}{space 1}    0.42{col 46}{space 3}0.673{col 54}{space 4} -.071872{col 67}{space 3} .1111791
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0847356{col 26}{space 2} .0226366{col 37}{space 1}    3.74{col 46}{space 3}0.000{col 54}{space 4} .0402469{col 67}{space 3} .1292244
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est13{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}     447
{txt}{hline 13}{char +}{hline 30}           F(  5,   441) ={res}    0.17
    {txt}   Model {char |} {res} .024480508     5  .004896102           {txt}Prob > F      = {res} 0.9743
    {txt}Residual {char |} {res} 12.8690856   441    .0291816           {txt}R-squared     = {res} 0.0019
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0094
    {txt}   Total {char |} {res} 12.8935661   446  .028909341           {txt}Root MSE      = {res} .17083

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    CPI1y_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}CPI1y_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0056989{col 26}{space 2} .0476183{col 37}{space 1}   -0.12{col 46}{space 3}0.905{col 54}{space 4}-.0992859{col 67}{space 3}  .087888
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0056989{col 26}{space 2} .0476183{col 37}{space 1}   -0.12{col 46}{space 3}0.905{col 54}{space 4}-.0992859{col 67}{space 3}  .087888
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0422757{col 26}{space 2} .0475849{col 37}{space 1}   -0.89{col 46}{space 3}0.375{col 54}{space 4} -.135797{col 67}{space 3} .0512456
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.0056409{col 26}{space 2} .0476267{col 37}{space 1}   -0.12{col 46}{space 3}0.906{col 54}{space 4}-.0992444{col 67}{space 3} .0879626
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0056409{col 26}{space 2} .0476267{col 37}{space 1}   -0.12{col 46}{space 3}0.906{col 54}{space 4}-.0992444{col 67}{space 3} .0879626
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0130176{col 26}{space 2} .0081879{col 37}{space 1}   -1.59{col 46}{space 3}0.113{col 54}{space 4}-.0291098{col 67}{space 3} .0030746
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est14{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.9718{col 18} 0.9727{col 27} 430.69{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} 
{txt}2     {res}{col 9} 0.9437{col 18} 0.0152{col 27} 837.68{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}3     {res}{col 9} 0.9155{col 18} 0.0159{col 27} 1221.6{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}4     {res}{col 9} 0.8883{col 18} 0.0537{col 27} 1583.8{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}5     {res}{col 9} 0.8611{col 18} 0.0197{col 27}   1925{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}(733 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}     142
{txt}{hline 13}{char +}{hline 30}           F(  5,   136) ={res}  206.10
    {txt}   Model {char |} {res} 6.41405464     5  1.28281093           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} .846479884   136  .006224117           {txt}R-squared     = {res} 0.8834
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.8791
    {txt}   Total {char |} {res} 7.26053453   141  .051493153           {txt}Root MSE      = {res} .07889

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       PCE1y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}PCE1y {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .9394433{col 26}{space 2} .0855919{col 37}{space 1}   10.98{col 46}{space 3}0.000{col 54}{space 4} .7701801{col 67}{space 3} 1.108707
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0126207{col 26}{space 2} .1163999{col 37}{space 1}    0.11{col 46}{space 3}0.914{col 54}{space 4}-.2175671{col 67}{space 3} .2428086
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .2024647{col 26}{space 2} .1151489{col 37}{space 1}    1.76{col 46}{space 3}0.081{col 54}{space 4}-.0252493{col 67}{space 3} .4301787
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} -.189108{col 26}{space 2}  .116485{col 37}{space 1}   -1.62{col 46}{space 3}0.107{col 54}{space 4}-.4194642{col 67}{space 3} .0412481
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0586027{col 26}{space 2} .0854857{col 37}{space 1}   -0.69{col 46}{space 3}0.494{col 54}{space 4}-.2276559{col 67}{space 3} .1104506
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1706981{col 26}{space 2} .0582263{col 37}{space 1}    2.93{col 46}{space 3}0.004{col 54}{space 4}  .055552{col 67}{space 3} .2858442
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est15{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}     141
{txt}{hline 13}{char +}{hline 30}           F(  5,   135) ={res}    1.14
    {txt}   Model {char |} {res} .038004833     5  .007600967           {txt}Prob > F      = {res} 0.3429
    {txt}Residual {char |} {res}  .90100516   135  .006674112           {txt}R-squared     = {res} 0.0405
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0049
    {txt}   Total {char |} {res} .939009993   140  .006707214           {txt}Root MSE      = {res}  .0817

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    PCE1y_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}PCE1y_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0000432{col 26}{space 2} .0860663{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-.1702559{col 67}{space 3} .1701694
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0000432{col 26}{space 2} .0860663{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-.1702559{col 67}{space 3} .1701694
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .2012946{col 26}{space 2} .0843547{col 37}{space 1}    2.39{col 46}{space 3}0.018{col 54}{space 4} .0344669{col 67}{space 3} .3681223
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} 5.35e-06{col 26}{space 2} .0861154{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-.1703045{col 67}{space 3} .1703152
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} 5.35e-06{col 26}{space 2} .0861154{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-.1703045{col 67}{space 3} .1703152
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0005257{col 26}{space 2} .0068803{col 37}{space 1}   -0.08{col 46}{space 3}0.939{col 54}{space 4}-.0141328{col 67}{space 3} .0130814
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est16{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.9301{col 18} 0.9370{col 27} 129.78{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} 
{txt}2     {res}{col 9} 0.8602{col 18}-0.0319{col 27} 241.54{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}3     {res}{col 9} 0.7903{col 18}-0.0333{col 27} 336.53{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}4     {res}{col 9} 0.6936{col 18}-0.2446{col 27} 410.21{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}       {hline 1}{c RT}        
{txt}5     {res}{col 9} 0.5969{col 18}-0.0586{col 27} 465.16{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}(733 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}     142
{txt}{hline 13}{char +}{hline 30}           F(  5,   136) ={res}  319.01
    {txt}   Model {char |} {res} 11.3613907     5  2.27227814           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} .968724524   136  .007122974           {txt}R-squared     = {res} 0.9214
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.9185
    {txt}   Total {char |} {res} 12.3301152   141  .087447626           {txt}Root MSE      = {res}  .0844

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   CORECPI1y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}CORECPI1y {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .9687769{col 26}{space 2} .0857075{col 37}{space 1}   11.30{col 46}{space 3}0.000{col 54}{space 4} .7992852{col 67}{space 3} 1.138269
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0046497{col 26}{space 2} .1187869{col 37}{space 1}    0.04{col 46}{space 3}0.969{col 54}{space 4}-.2302585{col 67}{space 3}  .239558
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1409678{col 26}{space 2} .1182289{col 37}{space 1}    1.19{col 46}{space 3}0.235{col 54}{space 4}-.0928371{col 67}{space 3} .3747727
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.1358003{col 26}{space 2} .1188949{col 37}{space 1}   -1.14{col 46}{space 3}0.255{col 54}{space 4}-.3709222{col 67}{space 3} .0993216
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0313043{col 26}{space 2} .0857868{col 37}{space 1}   -0.36{col 46}{space 3}0.716{col 54}{space 4}-.2009529{col 67}{space 3} .1383443
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1030815{col 26}{space 2} .0498584{col 37}{space 1}    2.07{col 46}{space 3}0.041{col 54}{space 4} .0044834{col 67}{space 3} .2016796
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est17{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}     141
{txt}{hline 13}{char +}{hline 30}           F(  5,   135) ={res}    0.54
    {txt}   Model {char |} {res} .020008671     5  .004001734           {txt}Prob > F      = {res} 0.7455
    {txt}Residual {char |} {res} .999938259   135   .00740695           {txt}R-squared     = {res} 0.0196
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0167
    {txt}   Total {char |} {res} 1.01994693   140  .007285335           {txt}Root MSE      = {res} .08606

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}CORECPI1y_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
CORECPI1y_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-7.66e-06{col 26}{space 2} .0860663{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-.1702203{col 67}{space 3}  .170205
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-7.66e-06{col 26}{space 2} .0860663{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-.1702203{col 67}{space 3}  .170205
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1401844{col 26}{space 2} .0852924{col 37}{space 1}    1.64{col 46}{space 3}0.103{col 54}{space 4}-.0284977{col 67}{space 3} .3088664
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} 8.37e-06{col 26}{space 2} .0861415{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4} -.170353{col 67}{space 3} .1703697
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} 8.37e-06{col 26}{space 2} .0861415{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4} -.170353{col 67}{space 3} .1703697
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0002331{col 26}{space 2}  .007248{col 37}{space 1}   -0.03{col 46}{space 3}0.974{col 54}{space 4}-.0145674{col 67}{space 3} .0141013
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est18{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.9529{col 18} 0.9597{col 27} 136.23{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} 
{txt}2     {res}{col 9} 0.9059{col 18}-0.0205{col 27} 260.18{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}3     {res}{col 9} 0.8588{col 18}-0.0211{col 27} 372.37{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}4     {res}{col 9} 0.7992{col 18}-0.1660{col 27}  470.2{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}       {hline 1}{c RT}        
{txt}5     {res}{col 9} 0.7396{col 18}-0.0313{col 27} 554.57{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}(733 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}     142
{txt}{hline 13}{char +}{hline 30}           F(  5,   136) ={res}  302.17
    {txt}   Model {char |} {res} 8.09955465     5  1.61991093           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res}  .72907729   136  .005360862           {txt}R-squared     = {res} 0.9174
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.9144
    {txt}   Total {char |} {res} 8.82863194   141  .062614411           {txt}Root MSE      = {res} .07322

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   COREPCE1y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}COREPCE1y {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .9596465{col 26}{space 2} .0856794{col 37}{space 1}   11.20{col 46}{space 3}0.000{col 54}{space 4} .7902102{col 67}{space 3} 1.129083
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0088441{col 26}{space 2} .1177059{col 37}{space 1}    0.08{col 46}{space 3}0.940{col 54}{space 4}-.2239265{col 67}{space 3} .2416148
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1941615{col 26}{space 2} .1168823{col 37}{space 1}    1.66{col 46}{space 3}0.099{col 54}{space 4}-.0369803{col 67}{space 3} .4253033
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.1837513{col 26}{space 2} .1184022{col 37}{space 1}   -1.55{col 46}{space 3}0.123{col 54}{space 4}-.4178988{col 67}{space 3} .0503962
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0409629{col 26}{space 2} .0861806{col 37}{space 1}   -0.48{col 46}{space 3}0.635{col 54}{space 4}-.2113903{col 67}{space 3} .1294644
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1076461{col 26}{space 2} .0456941{col 37}{space 1}    2.36{col 46}{space 3}0.020{col 54}{space 4} .0172833{col 67}{space 3} .1980089
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est19{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}     141
{txt}{hline 13}{char +}{hline 30}           F(  5,   135) ={res}    1.02
    {txt}   Model {char |} {res} .028604922     5  .005720984           {txt}Prob > F      = {res} 0.4104
    {txt}Residual {char |} {res} .759690897   135   .00562734           {txt}R-squared     = {res} 0.0363
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0006
    {txt}   Total {char |} {res}  .78829582   140  .005630684           {txt}Root MSE      = {res} .07502

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}COREPCE1y_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
COREPCE1y_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0000584{col 26}{space 2} .0860663{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4} -.170271{col 67}{space 3} .1701543
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0000584{col 26}{space 2} .0860663{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4} -.170271{col 67}{space 3} .1701543
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1915363{col 26}{space 2} .0849537{col 37}{space 1}    2.25{col 46}{space 3}0.026{col 54}{space 4}  .023524{col 67}{space 3} .3595487
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0000694{col 26}{space 2} .0865383{col 37}{space 1}    0.00{col 46}{space 3}0.999{col 54}{space 4}-.1710768{col 67}{space 3} .1712156
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0000694{col 26}{space 2} .0865383{col 37}{space 1}    0.00{col 46}{space 3}0.999{col 54}{space 4}-.1710768{col 67}{space 3} .1712156
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0005609{col 26}{space 2} .0063184{col 37}{space 1}   -0.09{col 46}{space 3}0.929{col 54}{space 4}-.0130567{col 67}{space 3} .0119349
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est20{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.9495{col 18} 0.9566{col 27} 135.26{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} 
{txt}2     {res}{col 9} 0.8991{col 18}-0.0221{col 27} 257.36{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}3     {res}{col 9} 0.8486{col 18}-0.0228{col 27}  366.9{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}4     {res}{col 9} 0.7779{col 18}-0.2230{col 27} 459.59{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}       {hline 1}{c RT}        
{txt}5     {res}{col 9} 0.7072{col 18}-0.0410{col 27} 536.74{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}
{com}. esttab using "${c -(}sum_table_folder{c )-}/autoreg.csv", se r2 replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/autoreg.csv"'})

{com}. eststo clear
{txt}
{com}. 
. */
. 
. ****************************************
. **** Stay in Monthly   Analysis  ******
. ****************************************
. 
. *******************************************
. ***  Collapse monthly data to monthly  **
. *******************************************
. 
. local Moments Q9_mean Q9_var Q9_disg Q9_iqr CPI1y PCE1y CORECPI1y InfExpMichMed ///
>               Q9c_mean Q9c_var Q9c_disg Q9c_iqr ///
>                           Q9_fe_var Q9_fe_atv Q9_atv ///
>               COREPCE1y CPI_disg PCE_disg CORECPI_disg COREPCE_disg SCE_FE SPFCPI_FE SPFPCE_FE ///
>                           CPI_atv PCE_atv CORECPI_atv COREPCE_atv ///
>                           CPI_fe_var PCE_fe_var CORECPI_fe_var COREPCE_fe_var ///
>                           CPI_fe_atv PCE_fe_atv CORECPI_fe_atv COREPCE_fe_atv ///
>                       PRCCPIVar1mean PRCPCEVar1mean PRCCPIVar0mean PRCPCEVar0mean 
{txt}
{com}.                                 
. local MomentsRv PRCCPIMean_rv PRCPCEMean_rv  PRCCPIVar_rv PRCPCEVar_rv  ///
>                 PRCCPIMeanl1  PRCCPIVarl1 PRCCPIMeanf0  PRCCPIVarf0 /// 
>                                 PRCPCEMeanl1  PRCPCEVarl1 PRCPCEMeanf0  PRCPCEVarf0
{txt}
{com}.                                 
.                                 
. local MomentsMom PRCCPIMean0p25 PRCCPIMean1p25 PRCPCEMean0p25 PRCPCEMean1p25 /// 
>               PRCCPIVar0p25 PRCCPIVar1p25 PRCPCEVar0p25 PRCPCEVar1p25 ///
>                           PRCCPIMean0p50 PRCCPIMean1p50 PRCPCEMean0p50 PRCPCEMean1p50 /// 
>               PRCCPIVar0p50 PRCCPIVar1p50 PRCPCEVar0p50 PRCPCEVar1p50 ///
>                           PRCCPIMean0p75 PRCCPIMean1p75 PRCPCEMean0p75 PRCPCEMean1p75 /// 
>               PRCCPIVar0p75 PRCCPIVar1p75 PRCPCEVar0p75 PRCPCEVar1p75  ///
>                           Q9_meanp25 Q9_meanp50 Q9_meanp75 Q9_varp25 Q9_varp50 Q9_varp75 ///
>                           Q9c_meanp25 Q9c_meanp50 Q9c_meanp75 Q9c_varp25 Q9c_varp50 Q9c_varp75
{txt}
{com}. 
. 
. collapse (mean) `Moments' `MomentsMom' `MomentsRv', ///
>                                 by(date year month) 
{txt}
{com}. 
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1947m1 to 2020m2
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. sort year month 
{txt}
{com}. order date year month 
{txt}
{com}. 
. ********************************
. ***  Autoregression Monthly  **
. *******************************
. 
. eststo clear
{txt}
{com}. 
. gen InfExp1y = .
{txt}(879 missing values generated)

{com}. gen InfExpFE1y = .
{txt}(879 missing values generated)

{com}. gen InfExpVar1y=.
{txt}(879 missing values generated)

{com}. gen InfExpDisg1y = .
{txt}(879 missing values generated)

{com}. 
. *****************************************
. ****  Renaming so that more consistent **
. *****************************************
. 
. 
. rename Q9_mean SCE_Mean
{res}{txt}
{com}. rename Q9_var SCE_Var
{res}{txt}
{com}. rename Q9_disg SCE_Disg
{res}{txt}
{com}. rename SCE_FE SCE_FE
{res}{txt}  (all {it:newnames}=={it:oldnames})

{com}. rename Q9_fe_var SCE_FEVar
{res}{txt}
{com}. rename Q9_fe_atv SCE_FEATV
{res}{txt}
{com}. rename Q9_atv SCE_ATV
{res}{txt}
{com}. 
. rename Q9c_mean SCE_Mean1
{res}{txt}
{com}. rename Q9c_var SCE_Var1
{res}{txt}
{com}. rename Q9c_disg SCE_Disg1
{res}{txt}
{com}. 
. rename CPI1y SPFCPI_Mean
{res}{txt}
{com}. rename PCE1y SPFPCE_Mean
{res}{txt}
{com}. rename COREPCE1y SPFCPCE_Mean
{res}{txt}
{com}. rename CORECPI1y SPFCCPI_Mean
{res}{txt}
{com}. 
. 
. rename CPI_disg SPFCPI_Disg
{res}{txt}
{com}. rename PCE_disg SPFPCE_Disg 
{res}{txt}
{com}. rename CORECPI_disg SPFCCPI_Disg
{res}{txt}
{com}. rename COREPCE_disg SPFCPCE_Disg
{res}{txt}
{com}. 
. rename CPI_atv SPFCPINC_ATV
{res}{txt}
{com}. rename PCE_atv SPFPCENC_ATV
{res}{txt}
{com}. rename CORECPI_atv SPFCPI_ATV
{res}{txt}
{com}. rename COREPCE_atv SPFPCE_ATV
{res}{txt}
{com}. 
. rename PRCPCEVar1mean SPFPCE_Var
{res}{txt}
{com}. rename PRCCPIVar1mean SPFCPI_Var
{res}{txt}
{com}. 
. rename SPFCPI_FE SPFCPI_FE
{res}{txt}  (all {it:newnames}=={it:oldnames})

{com}. rename SPFPCE_FE SPFPCE_FE
{res}{txt}  (all {it:newnames}=={it:oldnames})

{com}. 
. rename CPI_fe_var SPFCPINC_FEVAR
{res}{txt}
{com}. rename PCE_fe_var SPFPCENC_FEVAR 
{res}{txt}
{com}. rename CORECPI_fe_var SPFCPI_FEVAR
{res}{txt}
{com}. rename COREPCE_fe_var SPFPCE_FEVAR
{res}{txt}
{com}. 
. rename CPI_fe_atv SPFCPINC_FEATV
{res}{txt}
{com}. rename PCE_fe_atv SPFPCENC_FEATV 
{res}{txt}
{com}. rename CORECPI_fe_atv SPFCPI_FEATV
{res}{txt}
{com}. rename COREPCE_fe_atv SPFPCE_FEATV
{res}{txt}
{com}. 
. 
. rename PRCPCEMean_rv SPFPCE_Mean_rv
{res}{txt}
{com}. rename PRCCPIMean_rv SPFCPI_Mean_rv
{res}{txt}
{com}. 
. rename PRCPCEVar_rv SPFPCE_Var_rv
{res}{txt}
{com}. rename PRCCPIVar_rv SPFCPI_Var_rv
{res}{txt}
{com}. 
. **********************************
. rename PRCCPIMeanl1 SPFCPI_Meanl1
{res}{txt}
{com}. rename PRCCPIVarl1 SPFCPI_Varl1
{res}{txt}
{com}. 
. rename PRCCPIMeanf0 SPFCPI_Meanf0
{res}{txt}
{com}. rename PRCCPIVarf0 SPFCPI_Varf0
{res}{txt}
{com}. 
. rename PRCPCEMeanl1 SPFPCE_Meanl1
{res}{txt}
{com}. rename PRCPCEVarl1 SPFPCE_Varl1
{res}{txt}
{com}. 
. rename PRCPCEMeanf0 SPFPCE_Meanf0
{res}{txt}
{com}. rename PRCPCEVarf0 SPFPCE_Varf0
{res}{txt}
{com}. 
. ********************************
. gen InfExp_Mean = .
{txt}(879 missing values generated)

{com}. gen InfExp_Var = .
{txt}(879 missing values generated)

{com}. gen InfExp_FE = .
{txt}(879 missing values generated)

{com}. gen InfExp_Disg = . 
{txt}(879 missing values generated)

{com}. 
. 
. gen InfExp_Mean_ch = .
{txt}(879 missing values generated)

{com}. gen InfExp_Var_ch = .
{txt}(879 missing values generated)

{com}. gen InfExp_FE_ch = .
{txt}(879 missing values generated)

{com}. gen InfExp_Disg_ch = .
{txt}(879 missing values generated)

{com}. 
. gen InfExp_Mean_rv =.
{txt}(879 missing values generated)

{com}. gen InfExp_Var_rv =.
{txt}(879 missing values generated)

{com}. 
. gen InfExp_Meanl1 =. 
{txt}(879 missing values generated)

{com}. gen InfExp_Varl1 =. 
{txt}(879 missing values generated)

{com}. 
. gen InfExp_Meanf0 =. 
{txt}(879 missing values generated)

{com}. gen InfExp_Varf0 =. 
{txt}(879 missing values generated)

{com}.  
. 
. foreach mom in Mean Var{c -(}
{txt}  2{com}.   foreach var in PRCCPI PRCPCE{c -(}
{txt}  3{com}.     forval i =0/1{c -(}
{txt}  4{com}.         local lb=substr("`var'",4,3)
{txt}  5{com}.         rename `var'`mom'`i'p25 SPF`lb'`mom'`i'p25
{txt}  6{com}.     rename `var'`mom'`i'p50 SPF`lb'`mom'`i'p50
{txt}  7{com}.         rename `var'`mom'`i'p75 SPF`lb'`mom'`i'p75
{txt}  8{com}.         {c )-}
{txt}  9{com}.    {c )-}
{txt} 10{com}. {c )-}
{res}{txt}
{com}. 
. /*
> *******************************************************
> **** Autoregression on the levels of population moments
> ********************************************************
> 
> 
> tsset date
> 
> eststo clear 
> foreach mom in Mean Var Disg FE{c -(}
>    foreach var in SCE{c -(}
>          replace InfExp_`mom' = `var'_`mom'
>     eststo `var'_`mom': reg InfExp_`mom' l(1/12).InfExp_`mom', vce(robust)
>   {c )-} 
> {c )-}
> 
> esttab using "${c -(}sum_table_folder{c )-}/autoregLvlM.csv", mtitles drop(_cons) se(%8.3f) scalars(N r2 ar2) replace
> 
> 
> **********************************************************************
> ******** Autoregression on the first difference of population moments
>  **********************************************************************
> 
> eststo clear
> foreach mom in Mean Var Disg FE{c -(}
>    foreach var in SCE{c -(}
>     replace InfExp_`mom' = `var'_`mom'
>     replace InfExp_`mom'_ch = InfExp_`mom'-l1.InfExp_`mom'
>     eststo `var'_`mom': reg InfExp_`mom'_ch l(1/4).InfExp_`mom'_ch, vce(robust)
>   {c )-}
> {c )-}
> esttab using "${c -(}sum_table_folder{c )-}/autoregDiffM.csv", mtitles drop(_cons) se(%8.3f) scalars(N r2 ar2) replace
> 
> ***************
> *** SCE Only **
> ***************
> 
> eststo clear
> 
> foreach mom in Mean Var{c -(}
>    foreach var in SCE{c -(}
>     replace InfExp_`mom' = `var'_`mom'
>     replace InfExp_`mom'_ch = InfExp_`mom'-l1.InfExp_`mom'
>         capture replace InfExp_`mom'_rv = `var'_`mom'_rv  /// caputure because FE and Disg has to rev
> 
>         eststo `var'_`mom'lvl: reg InfExp_`mom' l(1/2).InfExp_`mom' 
>     eststo `var'_`mom'diff: reg InfExp_`mom'_ch l(1/2).InfExp_`mom'_ch  
>         capture eststo `var'_`mom'_rv: reg InfExp_`mom'_rv l(1/2).InfExp_`mom'_rv 
> 
>   {c )-}
> {c )-}
> esttab using "${c -(}sum_table_folder{c )-}/autoregSCEM.csv", mtitles drop(_cons) se(%8.3f) scalars(N r2 ar2) replace
> eststo clear
> 
> 
> *******************************
> *** Unbiasedness Test        **
> *******************************
> eststo clear
> 
> foreach mom in FE{c -(}
>    foreach var in SCE{c -(}
>       ttest `var'_`mom'=0
> {c )-}
> {c )-}
> 
> gen const=1
> 
> foreach mom in FE{c -(}
>    foreach var in SCE{c -(}
>       reg `var'_`mom' const
> {c )-}
> {c )-}
> 
> **********************************************
> *** Revision Efficiency Test Using FE       **
> **********************************************
> 
> foreach mom in FE{c -(}
>    foreach var in SCE{c -(}
>    replace InfExp_Mean = `var'_Mean
>    replace InfExp_`mom' = `var'_`mom'
>    eststo `var'_`mom'_lag6: reg  InfExp_`mom' l(6/8).InfExp_Mean, robust
>    eststo `var'_`mom'_arlag712: reg  InfExp_`mom' l(6/12).InfExp_`mom', robust
>    eststo `var'_`mom'_arlag12: reg  InfExp_`mom' l(12).InfExp_`mom', robust
>  {c )-}
> {c )-}
> esttab using "${c -(}sum_table_folder{c )-}/FEEfficiencySCEM.csv", mtitles drop(_cons) se(%8.3f) scalars(N r2 ar2)  replace
> */
. 
. ***************************************************
. *** Revision Efficiency Test Using Mean Revision **
. ***************************************************
. 
. 
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1947m1 to 2020m2
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. 
. eststo clear
{txt}
{com}. 
. foreach var in SCE{c -(}
{txt}  2{com}.   foreach mom in Mean{c -(}
{txt}  3{com}.      replace InfExp_`mom'_rv =  `var'_`mom' - l12.`var'_`mom'1
{txt}  4{com}.          eststo `var'`mom'rvlv0: reg InfExp_`mom'_rv, vce(cluster date)
{txt}  5{com}.      eststo `var'`mom'rvlv1: reg InfExp_`mom'_rv l1.InfExp_`mom'_rv, robust
{txt}  6{com}.          eststo `var'`mom'rvlv2: reg  InfExp_`mom'_rv l(1/3).InfExp_`mom'_rv, robust
{txt}  7{com}.          eststo `var'`mom'rvlv3: reg  InfExp_`mom'_rv l(1/6).InfExp_`mom'_rv, robust
{txt}  8{com}.  {c )-}
{txt}  9{com}. {c )-}
{txt}(51 real changes made)

Linear regression                                      Number of obs ={res}      51
                                                       {txt}F(  0,    50) ={res}    0.00
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.0000
                                                       {txt}Root MSE      = {res} .26017

{txt}{ralign 78:(Std. Err. adjusted for {res:51} clusters in date)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_Mea~v{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2}  -.22741{col 26}{space 2} .0364315{col 37}{space 1}   -6.24{col 46}{space 3}0.000{col 54}{space 4}-.3005849{col 67}{space 3}-.1542352
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      50
                                                       {txt}F(  1,    48) ={res}  130.51
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.7121
                                                       {txt}Root MSE      = {res} .14188

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_Mea~v{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Mea~v {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .8896412{col 26}{space 2}  .077875{col 37}{space 1}   11.42{col 46}{space 3}0.000{col 54}{space 4}  .733063{col 67}{space 3} 1.046219
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0177912{col 26}{space 2} .0291275{col 37}{space 1}   -0.61{col 46}{space 3}0.544{col 54}{space 4}-.0763559{col 67}{space 3} .0407735
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      48
                                                       {txt}F(  3,    44) ={res}   59.61
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.7804
                                                       {txt}Root MSE      = {res} .12712

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_Mea~v{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Mea~v {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .7905941{col 26}{space 2} .1122722{col 37}{space 1}    7.04{col 46}{space 3}0.000{col 54}{space 4} .5643244{col 67}{space 3} 1.016864
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .1779153{col 26}{space 2} .1159859{col 37}{space 1}    1.53{col 46}{space 3}0.132{col 54}{space 4}-.0558389{col 67}{space 3} .4116694
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0128428{col 26}{space 2} .1262145{col 37}{space 1}   -0.10{col 46}{space 3}0.919{col 54}{space 4}-.2672114{col 67}{space 3} .2415258
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0077734{col 26}{space 2} .0277986{col 37}{space 1}    0.28{col 46}{space 3}0.781{col 54}{space 4}-.0482509{col 67}{space 3} .0637977
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      45
                                                       {txt}F(  6,    38) ={res}   35.36
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.7866
                                                       {txt}Root MSE      = {res} .13466

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_Mea~v{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Mea~v {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .8292464{col 26}{space 2} .1498475{col 37}{space 1}    5.53{col 46}{space 3}0.000{col 54}{space 4}  .525896{col 67}{space 3} 1.132597
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .1877302{col 26}{space 2} .1529538{col 37}{space 1}    1.23{col 46}{space 3}0.227{col 54}{space 4}-.1219085{col 67}{space 3}  .497369
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0818563{col 26}{space 2} .2300904{col 37}{space 1}   -0.36{col 46}{space 3}0.724{col 54}{space 4}-.5476499{col 67}{space 3} .3839373
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0822396{col 26}{space 2} .1752456{col 37}{space 1}    0.47{col 46}{space 3}0.642{col 54}{space 4}-.2725265{col 67}{space 3} .4370057
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}   .00988{col 26}{space 2} .1818628{col 37}{space 1}    0.05{col 46}{space 3}0.957{col 54}{space 4}-.3582819{col 67}{space 3} .3780419
{txt}{space 9}L6. {c |}{col 14}{res}{space 2}-.0959812{col 26}{space 2} .1022254{col 37}{space 1}   -0.94{col 46}{space 3}0.354{col 54}{space 4}-.3029257{col 67}{space 3} .1109634
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0026054{col 26}{space 2} .0399503{col 37}{space 1}   -0.07{col 46}{space 3}0.948{col 54}{space 4}-.0834806{col 67}{space 3} .0782698
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. foreach var in SCE{c -(}
{txt}  2{com}.   foreach mom in Var{c -(}
{txt}  3{com}.      replace InfExp_`mom'_rv =  `var'_`mom' - l12.`var'_`mom'1
{txt}  4{com}.          eststo `var'`mom'rvlv0: reg InfExp_`mom'_rv, vce(cluster date) 
{txt}  5{com}.      eststo `var'`mom'rvlv1: reg InfExp_`mom'_rv l1.InfExp_`mom'_rv, robust
{txt}  6{com}.          eststo `var'`mom'rvlv2: reg  InfExp_`mom'_rv l(1/3).InfExp_`mom'_rv, robust
{txt}  7{com}.          eststo `var'`mom'rvlv3: reg  InfExp_`mom'_rv l(1/6).InfExp_`mom'_rv, robust
{txt}  8{com}.  {c )-}
{txt}  9{com}. {c )-}
{txt}(51 real changes made)

Linear regression                                      Number of obs ={res}      51
                                                       {txt}F(  0,    50) ={res}    0.00
                                                       {txt}Prob > F      = {res}      .
                                                       {txt}R-squared     = {res} 0.0000
                                                       {txt}Root MSE      = {res} 1.1325

{txt}{ralign 78:(Std. Err. adjusted for {res:51} clusters in date)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_Var~v{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2}-.5130241{col 26}{space 2}  .158581{col 37}{space 1}   -3.24{col 46}{space 3}0.002{col 54}{space 4}-.8315434{col 67}{space 3}-.1945048
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      50
                                                       {txt}F(  1,    48) ={res}   36.10
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4355
                                                       {txt}Root MSE      = {res} .80329

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_Var~v{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var~v {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .6104601{col 26}{space 2} .1016018{col 37}{space 1}    6.01{col 46}{space 3}0.000{col 54}{space 4} .4061759{col 67}{space 3} .8147442
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.2600074{col 26}{space 2} .1424858{col 37}{space 1}   -1.82{col 46}{space 3}0.074{col 54}{space 4}-.5464943{col 67}{space 3} .0264795
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      48
                                                       {txt}F(  3,    44) ={res}   17.52
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.5411
                                                       {txt}Root MSE      = {res} .72724

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_Var~v{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var~v {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .6071544{col 26}{space 2} .1345839{col 37}{space 1}    4.51{col 46}{space 3}0.000{col 54}{space 4} .3359184{col 67}{space 3} .8783904
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .2826333{col 26}{space 2} .1431309{col 37}{space 1}    1.97{col 46}{space 3}0.055{col 54}{space 4}-.0058281{col 67}{space 3} .5710948
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.2128926{col 26}{space 2} .1262643{col 37}{space 1}   -1.69{col 46}{space 3}0.099{col 54}{space 4}-.4673615{col 67}{space 3} .0415762
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.1584023{col 26}{space 2} .1410359{col 37}{space 1}   -1.12{col 46}{space 3}0.267{col 54}{space 4}-.4426415{col 67}{space 3} .1258369
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                                      Number of obs ={res}      45
                                                       {txt}F(  6,    38) ={res}   11.02
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.6010
                                                       {txt}Root MSE      = {res} .72883

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_Var~v{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var~v {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .7980464{col 26}{space 2} .1548871{col 37}{space 1}    5.15{col 46}{space 3}0.000{col 54}{space 4} .4844937{col 67}{space 3} 1.111599
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .1239411{col 26}{space 2}  .210258{col 37}{space 1}    0.59{col 46}{space 3}0.559{col 54}{space 4} -.301704{col 67}{space 3} .5495863
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.3529086{col 26}{space 2} .2348824{col 37}{space 1}   -1.50{col 46}{space 3}0.141{col 54}{space 4}-.8284031{col 67}{space 3}  .122586
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .2681186{col 26}{space 2}  .153404{col 37}{space 1}    1.75{col 46}{space 3}0.089{col 54}{space 4}-.0424316{col 67}{space 3} .5786689
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.2447266{col 26}{space 2} .2116573{col 37}{space 1}   -1.16{col 46}{space 3}0.255{col 54}{space 4}-.6732043{col 67}{space 3} .1837512
{txt}{space 9}L6. {c |}{col 14}{res}{space 2} .0913856{col 26}{space 2} .1375355{col 37}{space 1}    0.66{col 46}{space 3}0.510{col 54}{space 4}-.1870405{col 67}{space 3} .3698117
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.1850498{col 26}{space 2} .1497805{col 37}{space 1}   -1.24{col 46}{space 3}0.224{col 54}{space 4}-.4882645{col 67}{space 3}  .118165
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/RVEfficiencySCEM.csv", mtitles b(%8.3f) se(%8.3f) scalars(N r2) sfmt(%8.3f %8.3f %8.3f) replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/RVEfficiencySCEM.csv"'})

{com}. 
. 
. /*
> *******************************************************************
> *** Revision Efficiency Test Using Mean Revision Fuhrer's Approach**
> ********************************************************************
> 
> foreach mom in Var{c -(}
>    foreach var in SCE{c -(}
>     ttest `var'_`mom'_rv =0
>  {c )-}
> {c )-}
> 
> eststo clear
> 
> foreach var in SCE{c -(}
>   foreach mom in Mean{c -(}
>      replace InfExp_`mom' = `var'_`mom'
>      replace InfExp_`mom'l1 = `var'_`mom'l1
>          replace InfExp_`mom'f0 = `var'_`mom'f0
>      eststo `var'`mom'rvlv1: reg InfExp_`mom'f0 InfExp_`mom'
>          test _b[InfExp_`mom']=1
>           scalar pvtest= r(p)
>          estadd scalar pvtest
>          eststo `var'`mom'rvlv2: reg InfExp_`mom'f0 l(0/1).InfExp_`mom'
>          test _b[InfExp_`mom']=1
>          scalar pvtest= r(p)
>          estadd scalar pvtest
>          eststo `var'`mom'rvlv3: reg InfExp_`mom'f0 l(0/2).InfExp_`mom'
>      test _b[InfExp_`mom']=1
>          scalar pvtest= r(p)
>          estadd scalar pvtest
>  {c )-}
> {c )-}
> 
> 
> foreach var in SCE{c -(}
>   foreach mom in Var{c -(}
>      replace InfExp_`mom' = `var'_`mom'
>      replace InfExp_`mom'l1 = `var'_`mom'l1
>          replace InfExp_`mom'f0 = `var'_`mom'f0
>      eststo `var'`mom'rvlv1: reg InfExp_`mom'f0 InfExp_`mom'
>          test _b[_cons]=0
>          scalar pvtest= r(p)
>          estadd scalar pvtest
>          eststo `var'`mom'rvlv2: reg InfExp_`mom'f0 l(0/1).InfExp_`mom'
>          test _b[_cons]=0
>          scalar pvtest= r(p)
>          estadd scalar pvtest
>          eststo `var'`mom'rvlv3: reg InfExp_`mom'f0 l(0/2).InfExp_`mom'
>          test _b[_cons]=0
>          scalar pvtest= r(p)
>          estadd scalar pvtest
>  {c )-}
> {c )-}
> 
> esttab using "${c -(}sum_table_folder{c )-}/RVEfficiencySCEM.csv", mtitles se(%8.3f) scalars(pvtest N r2) replace
> */
. 
. save "${c -(}folder{c )-}/InfExpM.dta",replace 
{txt}file /Users/Myworld/Dropbox/ExpProject/workingfolder/SurveyData//InfExpM.dta saved

{com}. 
. 
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/ExpProject/workingfolder/pop_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}20 Mar 2020, 15:27:40
{txt}{.-}
{smcl}
{txt}{sf}{ul off}