{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/ExpProject/workingfolder/pop_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}13 Nov 2019, 13:45:31
{txt}
{com}. 
. ****************************************
. **** Population Moments Analysis ******
. ****************************************
. 
. ***********************
. **   Merge other data**
. ***********************
. 
. use "${c -(}folder{c )-}/SCE/InfExpSCEProbPopM",clear 
{txt}
{com}. 
. merge 1:1 year month using "${c -(}mainfolder{c )-}/OtherData/RecessionDateM.dta", keep(match)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             704{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge  recession_merge
{res}{txt}
{com}. 
. merge 1:1 year month using "${c -(}mainfolder{c )-}/OtherData/InfM.dta",keep(match using master)
{res}{txt}(label _merge already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             153
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}             153{txt}  (_merge==2)

{col 5}matched{col 30}{res}             704{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge inflation_merge 
{res}{txt}
{com}. 
. merge 1:1 year month using "${c -(}folder{c )-}/MichiganSurvey/InfExpMichM.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             153
{txt}{col 9}from master{col 30}{res}             153{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             704{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename inf_exp InfExpMichMed 
{res}{txt}
{com}. rename _merge michigan_merge 
{res}{txt}
{com}. 
. ***********************************************
. ** create quarter variable to match with spf
. *********************************************
. 
. gen quarter = .
{txt}(857 missing values generated)

{com}. replace quarter=1 if month<4 & month >=1
{txt}(216 real changes made)

{com}. replace quarter=2 if month<7 & month >=4
{txt}(215 real changes made)

{com}. replace quarter=3 if month<10 & month >=7
{txt}(213 real changes made)

{com}. replace quarter=4 if month<=12 & month >=10
{txt}(213 real changes made)

{com}. 
. merge m:1 year quarter using "${c -(}folder{c )-}/SPF/individual/InfExpSPFPointPopQ.dta",keep(match using master)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             252
{txt}{col 9}from master{col 30}{res}             251{txt}  (_merge==1)
{col 9}from using{col 30}{res}               1{txt}  (_merge==2)

{col 5}matched{col 30}{res}             606{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge spf_merge 
{res}{txt}
{com}. 
. merge m:1 year quarter using "${c -(}folder{c )-}/SPF/InfExpSPFDstPopQ.dta",keep(match using master)
{res}{txt}{p 0 7 2}
(note: variable
year was 
float, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
quarter was 
float, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             710
{txt}{col 9}from master{col 30}{res}             710{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             148{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge spf_dst_merge 
{res}{txt}
{com}. 
. 
. *************************
. ** Declare time series **
. **************************
. 
. gen date2=string(year)+"m"+string(month)
{txt}
{com}. gen date3= monthly(date2,"YM")
{txt}(1 missing value generated)

{com}. format date3 %tm 
{txt}
{com}. 
. drop date2 date 
{txt}
{com}. rename date3 date
{res}{txt}
{com}. 
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1948m1 to 2019m5
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. sort year quarter month 
{txt}
{com}. 
. 
. ******************************
. *** Computing some measures **
. ******************************
. 
. gen SCE_FE = Q9_mean - Inf1yf_CPIAU
{txt}(800 missing values generated)

{com}. label var SCE_FE "1-yr-ahead forecast error"
{txt}
{com}. 
. gen SPFCPI_FE = CORECPI1y - Inf1yf_CPICore
{txt}(723 missing values generated)

{com}. label var SPFCPI_FE "1-yr-ahead forecast error(SPF Core CPI)"
{txt}
{com}. 
. gen SPFPCE_FE = COREPCE1y - Inf1yf_PCECore
{txt}(721 missing values generated)

{com}. label var SPFPCE_FE "1-yr-ahead forecast error(SPF Core PCE)"
{txt}
{com}. 
. 
. ***************************
. ***  Population Moments *** 
. ***************************
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1948m1 to 2019m5
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. 
. estpost tabstat Q9_mean Q9_var Q9_disg Q9_iqr CPI1y PCE1y CORECPI1y COREPCE1y ///
>                 CPI_disg PCE_disg CORECPI_disg COREPCE_disg PRCCPIVar1mean PRCPCEVar1mean, ///
>                             st(mean var median) columns(statistics)

{txt}Summary statistics: mean variance p50
     for variables: Q9_mean Q9_var Q9_disg Q9_iqr CPI1y PCE1y CORECPI1y COREPCE1y CPI_disg PCE_disg CORECPI_disg COREPCE_disg PRCCPIVar1mean PRCPCEVar1mean

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:e(mean)}{space 1}{space 1}{ralign 9:e(varia~)}{space 1}{space 1}{ralign 9:e(p50)}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}
{space 0}{space 0}{ralign 12:Q9_mean}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 3.289306}}}{space 1}{space 1}{ralign 9:{res:{sf: .0693647}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.209944}}}{space 1}
{space 0}{space 0}{ralign 12:Q9_var}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  9.69948}}}{space 1}{space 1}{ralign 9:{res:{sf: .4587756}}}{space 1}{space 1}{ralign 9:{res:{sf: 9.657158}}}{space 1}
{space 0}{space 0}{ralign 12:Q9_disg}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 6.260496}}}{space 1}{space 1}{ralign 9:{res:{sf: .3355818}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.191247}}}{space 1}
{space 0}{space 0}{ralign 12:Q9_iqr}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 4.054396}}}{space 1}{space 1}{ralign 9:{res:{sf: .0415127}}}{space 1}{space 1}{ralign 9:{res:{sf: 4.030906}}}{space 1}
{space 0}{space 0}{ralign 12:CPI1y}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 3.014775}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.413239}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.473909}}}{space 1}
{space 0}{space 0}{ralign 12:PCE1y}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.847065}}}{space 1}{space 1}{ralign 9:{res:{sf:  .052896}}}{space 1}{space 1}{ralign 9:{res:{sf:   1.8534}}}{space 1}
{space 0}{space 0}{ralign 12:CORECPI1y}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.971262}}}{space 1}{space 1}{ralign 9:{res:{sf:  .088121}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.004349}}}{space 1}
{space 0}{space 0}{ralign 12:COREPCE1y}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.754005}}}{space 1}{space 1}{ralign 9:{res:{sf:   .06366}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.775755}}}{space 1}
{space 0}{space 0}{ralign 12:CPI_disg}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .5022143}}}{space 1}{space 1}{ralign 9:{res:{sf: .5895967}}}{space 1}{space 1}{ralign 9:{res:{sf: .2933465}}}{space 1}
{space 0}{space 0}{ralign 12:PCE_disg}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .3472125}}}{space 1}{space 1}{ralign 9:{res:{sf: .0503315}}}{space 1}{space 1}{ralign 9:{res:{sf: .2818246}}}{space 1}
{space 0}{space 0}{ralign 12:CORECPI_disg}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  .192936}}}{space 1}{space 1}{ralign 9:{res:{sf: .0294365}}}{space 1}{space 1}{ralign 9:{res:{sf:  .107817}}}{space 1}
{space 0}{space 0}{ralign 12:COREPCE_disg}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .1579588}}}{space 1}{space 1}{ralign 9:{res:{sf: .0229367}}}{space 1}{space 1}{ralign 9:{res:{sf: .1031996}}}{space 1}
{space 0}{space 0}{ralign 12:PRCCPIVar1~n}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0834114}}}{space 1}{space 1}{ralign 9:{res:{sf: .0012811}}}{space 1}{space 1}{ralign 9:{res:{sf: .0802793}}}{space 1}
{space 0}{space 0}{ralign 12:PRCPCEVar1~n}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0798223}}}{space 1}{space 1}{ralign 9:{res:{sf: .0009688}}}{space 1}{space 1}{ralign 9:{res:{sf: .0743354}}}{space 1}

{com}. esttab . using "${c -(}sum_table_folder{c )-}/pop_sum_stats.csv", cells("mean(fmt(a3)) var(fmt(a3)) median(fmt(a3))") replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/pop_sum_stats.csv"'})

{com}. 
. eststo clear
{txt}
{com}. foreach var in Q9_mean Q9_var Q9_disg CPI1y PCE1y CORECPI1y COREPCE1y{c -(}
{txt}  2{com}. gen `var'_ch = `var'-l1.`var'
{txt}  3{com}. label var `var'_ch "m to m+1 change of `var'"
{txt}  4{com}. eststo: reg `var' l(1/5).`var'
{txt}  5{com}. eststo: reg `var'_ch l(1/5).`var'_ch
{txt}  6{com}. corrgram `var', lags(5) 
{txt}  7{com}. *gen `var'1=`r(ac1)'
. *label var `var'1 "Auto-correlation coefficient of `var'"
. {c )-}
{txt}(799 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      55
{txt}{hline 13}{char +}{hline 30}           F(  5,    49) ={res}   55.61
    {txt}   Model {char |} {res} 2.70297201     5  .540594402           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} .476347932    49  .009721386           {txt}R-squared     = {res} 0.8502
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.8349
    {txt}   Total {char |} {res} 3.17931994    54  .058876295           {txt}Root MSE      = {res}  .0986

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     Q9_mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Q9_mean {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .7554774{col 26}{space 2} .1418093{col 37}{space 1}    5.33{col 46}{space 3}0.000{col 54}{space 4}  .470501{col 67}{space 3} 1.040454
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .1064623{col 26}{space 2} .1713519{col 37}{space 1}    0.62{col 46}{space 3}0.537{col 54}{space 4}-.2378822{col 67}{space 3} .4508068
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1382817{col 26}{space 2} .1646235{col 37}{space 1}    0.84{col 46}{space 3}0.405{col 54}{space 4}-.1925417{col 67}{space 3} .4691051
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.0855847{col 26}{space 2} .1612106{col 37}{space 1}   -0.53{col 46}{space 3}0.598{col 54}{space 4}-.4095494{col 67}{space 3}   .23838
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} -.011907{col 26}{space 2} .1263476{col 37}{space 1}   -0.09{col 46}{space 3}0.925{col 54}{space 4}-.2658121{col 67}{space 3}  .241998
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3106777{col 26}{space 2} .1810307{col 37}{space 1}    1.72{col 46}{space 3}0.092{col 54}{space 4}-.0531172{col 67}{space 3} .6744726
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}      54
{txt}{hline 13}{char +}{hline 30}           F(  5,    48) ={res}    0.45
    {txt}   Model {char |} {res} .023882137     5  .004776427           {txt}Prob > F      = {res} 0.8081
    {txt}Residual {char |} {res}  .50470635    48  .010514716           {txt}R-squared     = {res} 0.0452
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0543
    {txt}   Total {char |} {res} .528588488    53  .009973368           {txt}Root MSE      = {res} .10254

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  Q9_mean_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}Q9_mean_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.1792401{col 26}{space 2} .1455921{col 37}{space 1}   -1.23{col 46}{space 3}0.224{col 54}{space 4}-.4719726{col 67}{space 3} .1134924
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0537361{col 26}{space 2} .1446994{col 37}{space 1}   -0.37{col 46}{space 3}0.712{col 54}{space 4}-.3446738{col 67}{space 3} .2372017
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .0729548{col 26}{space 2} .1448548{col 37}{space 1}    0.50{col 46}{space 3}0.617{col 54}{space 4}-.2182953{col 67}{space 3} .3642048
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.0241008{col 26}{space 2} .1330377{col 37}{space 1}   -0.18{col 46}{space 3}0.857{col 54}{space 4} -.291591{col 67}{space 3} .2433894
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0461159{col 26}{space 2} .1304224{col 37}{space 1}   -0.35{col 46}{space 3}0.725{col 54}{space 4}-.3083478{col 67}{space 3}  .216116
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0071369{col 26}{space 2} .0144129{col 37}{space 1}   -0.50{col 46}{space 3}0.623{col 54}{space 4}-.0361159{col 67}{space 3} .0218421
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est2{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.9085{col 18} 0.9090{col 27} 52.042{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} 
{txt}2     {res}{col 9} 0.8437{col 18} 0.1139{col 27} 97.698{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}3     {res}{col 9} 0.7822{col 18} 0.1287{col 27} 137.63{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c LT}{hline 1}       
{txt}4     {res}{col 9} 0.7009{col 18}-0.0865{col 27} 170.26{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}5     {res}{col 9} 0.6407{col 18}-0.0119{col 27} 198.03{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}(799 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      55
{txt}{hline 13}{char +}{hline 30}           F(  5,    49) ={res}    4.89
    {txt}   Model {char |} {res} 7.33764347     5  1.46752869           {txt}Prob > F      = {res} 0.0010
    {txt}Residual {char |} {res} 14.7065208    49  .300133078           {txt}R-squared     = {res} 0.3329
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.2648
    {txt}   Total {char |} {res} 22.0441643    54  .408225264           {txt}Root MSE      = {res} .54784

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      Q9_var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}Q9_var {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}  .379984{col 26}{space 2} .1409843{col 37}{space 1}    2.70{col 46}{space 3}0.010{col 54}{space 4} .0966654{col 67}{space 3} .6633025
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .3306164{col 26}{space 2} .1490758{col 37}{space 1}    2.22{col 46}{space 3}0.031{col 54}{space 4} .0310374{col 67}{space 3} .6301954
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.1772891{col 26}{space 2} .1467614{col 37}{space 1}   -1.21{col 46}{space 3}0.233{col 54}{space 4}-.4722172{col 67}{space 3}  .117639
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .1316297{col 26}{space 2} .1460956{col 37}{space 1}    0.90{col 46}{space 3}0.372{col 54}{space 4}-.1619603{col 67}{space 3} .4252197
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.1428106{col 26}{space 2} .1241833{col 37}{space 1}   -1.15{col 46}{space 3}0.256{col 54}{space 4}-.3923662{col 67}{space 3} .1067451
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 4.635513{col 26}{space 2} 1.632958{col 37}{space 1}    2.84{col 46}{space 3}0.007{col 54}{space 4} 1.353961{col 67}{space 3} 7.917065
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est3{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}      54
{txt}{hline 13}{char +}{hline 30}           F(  5,    48) ={res}    4.62
    {txt}   Model {char |} {res} 7.79155929     5  1.55831186           {txt}Prob > F      = {res} 0.0016
    {txt}Residual {char |} {res} 16.1982613    48  .337463777           {txt}R-squared     = {res} 0.3248
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.2545
    {txt}   Total {char |} {res} 23.9898206    53  .452638124           {txt}Root MSE      = {res} .58092

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Q9_var_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}Q9_var_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} -.484772{col 26}{space 2} .1408143{col 37}{space 1}   -3.44{col 46}{space 3}0.001{col 54}{space 4}-.7678982{col 67}{space 3}-.2016458
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0454814{col 26}{space 2} .1567627{col 37}{space 1}   -0.29{col 46}{space 3}0.773{col 54}{space 4}-.3606738{col 67}{space 3} .2697111
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0991884{col 26}{space 2} .1537125{col 37}{space 1}   -0.65{col 46}{space 3}0.522{col 54}{space 4}-.4082481{col 67}{space 3} .2098714
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0792848{col 26}{space 2} .1420667{col 37}{space 1}    0.56{col 46}{space 3}0.579{col 54}{space 4}-.2063595{col 67}{space 3}  .364929
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0652528{col 26}{space 2} .1237519{col 37}{space 1}   -0.53{col 46}{space 3}0.600{col 54}{space 4}-.3140728{col 67}{space 3} .1835672
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0051738{col 26}{space 2} .0793073{col 37}{space 1}    0.07{col 46}{space 3}0.948{col 54}{space 4}-.1542841{col 67}{space 3} .1646318
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est4{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.4078{col 18} 0.4082{col 27} 10.488{col 36}0.0012{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c LT}{hline 1}{hline 1}{hline 1}     
{txt}2     {res}{col 9} 0.3238{col 18} 0.1883{col 27} 17.211{col 36}0.0002{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c LT}{hline 1}       
{txt}3     {res}{col 9} 0.0776{col 18}-0.1933{col 27} 17.604{col 36}0.0005{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}4     {res}{col 9} 0.1411{col 18} 0.0840{col 27} 18.926{col 36}0.0008{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}5     {res}{col 9}-0.0641{col 18}-0.1428{col 27} 19.204{col 36}0.0018{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}(799 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      55
{txt}{hline 13}{char +}{hline 30}           F(  5,    49) ={res}   16.94
    {txt}   Model {char |} {res} 10.3238653     5  2.06477306           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 5.97292387    49  .121896406           {txt}R-squared     = {res} 0.6335
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.5961
    {txt}   Total {char |} {res} 16.2967892    54  .301792392           {txt}Root MSE      = {res} .34914

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     Q9_disg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Q9_disg {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1815969{col 26}{space 2} .1411488{col 37}{space 1}    1.29{col 46}{space 3}0.204{col 54}{space 4}-.1020523{col 67}{space 3}  .465246
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .1800616{col 26}{space 2} .1309926{col 37}{space 1}    1.37{col 46}{space 3}0.176{col 54}{space 4}-.0831779{col 67}{space 3} .4433012
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1961048{col 26}{space 2} .1316738{col 37}{space 1}    1.49{col 46}{space 3}0.143{col 54}{space 4}-.0685036{col 67}{space 3} .4607133
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}  .206628{col 26}{space 2}  .132905{col 37}{space 1}    1.55{col 46}{space 3}0.126{col 54}{space 4}-.0604547{col 67}{space 3} .4737107
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .1423232{col 26}{space 2} .1225932{col 37}{space 1}    1.16{col 46}{space 3}0.251{col 54}{space 4}-.1040372{col 67}{space 3} .3886835
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .5107784{col 26}{space 2} .6244015{col 37}{space 1}    0.82{col 46}{space 3}0.417{col 54}{space 4}-.7440034{col 67}{space 3}  1.76556
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est5{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}      54
{txt}{hline 13}{char +}{hline 30}           F(  5,    48) ={res}    6.51
    {txt}   Model {char |} {res} 4.05972106     5  .811944212           {txt}Prob > F      = {res} 0.0001
    {txt}Residual {char |} {res} 5.98710036    48  .124731257           {txt}R-squared     = {res} 0.4041
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.3420
    {txt}   Total {char |} {res} 10.0468214    53  .189562668           {txt}Root MSE      = {res} .35317

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  Q9_disg_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}Q9_disg_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.7989761{col 26}{space 2} .1438498{col 37}{space 1}   -5.55{col 46}{space 3}0.000{col 54}{space 4}-1.088206{col 67}{space 3}-.5097467
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.6375189{col 26}{space 2} .1820906{col 37}{space 1}   -3.50{col 46}{space 3}0.001{col 54}{space 4}-1.003637{col 67}{space 3}-.2714013
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.4467968{col 26}{space 2}  .184414{col 37}{space 1}   -2.42{col 46}{space 3}0.019{col 54}{space 4} -.817586{col 67}{space 3}-.0760075
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.2005183{col 26}{space 2} .1578842{col 37}{space 1}   -1.27{col 46}{space 3}0.210{col 54}{space 4}-.5179657{col 67}{space 3} .1169292
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0161447{col 26}{space 2} .1237107{col 37}{space 1}    0.13{col 46}{space 3}0.897{col 54}{space 4}-.2325924{col 67}{space 3} .2648817
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0844832{col 26}{space 2} .0506743{col 37}{space 1}   -1.67{col 46}{space 3}0.102{col 54}{space 4}-.1863707{col 67}{space 3} .0174044
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est6{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.6841{col 18} 0.6925{col 27} 29.506{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   
{txt}2     {res}{col 9} 0.5927{col 18} 0.2448{col 27} 52.035{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c LT}{hline 1}       
{txt}3     {res}{col 9} 0.5585{col 18} 0.1942{col 27} 72.389{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c LT}{hline 1}       
{txt}4     {res}{col 9} 0.5628{col 18} 0.2346{col 27} 93.428{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c LT}{hline 1}       
{txt}5     {res}{col 9} 0.5309{col 18} 0.1423{col 27} 112.49{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c LT}{hline 1}       
{txt}(406 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}     448
{txt}{hline 13}{char +}{hline 30}           F(  5,   442) ={res} 3695.07
    {txt}   Model {char |} {res} 513.285482     5  102.657096           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 12.2797331   442  .027782202           {txt}R-squared     = {res} 0.9766
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.9764
    {txt}   Total {char |} {res} 525.565215   447  1.17576111           {txt}Root MSE      = {res} .16668

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       CPI1y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}CPI1y {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .9487661{col 26}{space 2} .0475027{col 37}{space 1}   19.97{col 46}{space 3}0.000{col 54}{space 4} .8554069{col 67}{space 3} 1.042125
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0004946{col 26}{space 2}  .065499{col 37}{space 1}    0.01{col 46}{space 3}0.994{col 54}{space 4}-.1282335{col 67}{space 3} .1292227
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0369137{col 26}{space 2} .0654843{col 37}{space 1}   -0.56{col 46}{space 3}0.573{col 54}{space 4} -.165613{col 67}{space 3} .0917856
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0349571{col 26}{space 2} .0655158{col 37}{space 1}    0.53{col 46}{space 3}0.594{col 54}{space 4} -.093804{col 67}{space 3} .1637182
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0196535{col 26}{space 2} .0465697{col 37}{space 1}    0.42{col 46}{space 3}0.673{col 54}{space 4} -.071872{col 67}{space 3} .1111791
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0847356{col 26}{space 2} .0226366{col 37}{space 1}    3.74{col 46}{space 3}0.000{col 54}{space 4} .0402469{col 67}{space 3} .1292244
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est7{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}     447
{txt}{hline 13}{char +}{hline 30}           F(  5,   441) ={res}    0.17
    {txt}   Model {char |} {res} .024480508     5  .004896102           {txt}Prob > F      = {res} 0.9743
    {txt}Residual {char |} {res} 12.8690856   441    .0291816           {txt}R-squared     = {res} 0.0019
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0094
    {txt}   Total {char |} {res} 12.8935661   446  .028909341           {txt}Root MSE      = {res} .17083

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    CPI1y_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}CPI1y_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0056989{col 26}{space 2} .0476183{col 37}{space 1}   -0.12{col 46}{space 3}0.905{col 54}{space 4}-.0992859{col 67}{space 3}  .087888
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0056989{col 26}{space 2} .0476183{col 37}{space 1}   -0.12{col 46}{space 3}0.905{col 54}{space 4}-.0992859{col 67}{space 3}  .087888
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0422757{col 26}{space 2} .0475849{col 37}{space 1}   -0.89{col 46}{space 3}0.375{col 54}{space 4} -.135797{col 67}{space 3} .0512456
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.0056409{col 26}{space 2} .0476267{col 37}{space 1}   -0.12{col 46}{space 3}0.906{col 54}{space 4}-.0992444{col 67}{space 3} .0879626
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0056409{col 26}{space 2} .0476267{col 37}{space 1}   -0.12{col 46}{space 3}0.906{col 54}{space 4}-.0992444{col 67}{space 3} .0879626
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0130176{col 26}{space 2} .0081879{col 37}{space 1}   -1.59{col 46}{space 3}0.113{col 54}{space 4}-.0291098{col 67}{space 3} .0030746
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est8{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.9718{col 18} 0.9727{col 27} 430.69{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} 
{txt}2     {res}{col 9} 0.9437{col 18} 0.0152{col 27} 837.68{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}3     {res}{col 9} 0.9155{col 18} 0.0159{col 27} 1221.6{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}4     {res}{col 9} 0.8883{col 18} 0.0537{col 27} 1583.8{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}5     {res}{col 9} 0.8611{col 18} 0.0197{col 27}   1925{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}(712 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}     142
{txt}{hline 13}{char +}{hline 30}           F(  5,   136) ={res}  206.10
    {txt}   Model {char |} {res} 6.41405464     5  1.28281093           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} .846479884   136  .006224117           {txt}R-squared     = {res} 0.8834
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.8791
    {txt}   Total {char |} {res} 7.26053453   141  .051493153           {txt}Root MSE      = {res} .07889

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       PCE1y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}PCE1y {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .9394433{col 26}{space 2} .0855919{col 37}{space 1}   10.98{col 46}{space 3}0.000{col 54}{space 4} .7701801{col 67}{space 3} 1.108707
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0126207{col 26}{space 2} .1163999{col 37}{space 1}    0.11{col 46}{space 3}0.914{col 54}{space 4}-.2175671{col 67}{space 3} .2428086
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .2024647{col 26}{space 2} .1151489{col 37}{space 1}    1.76{col 46}{space 3}0.081{col 54}{space 4}-.0252493{col 67}{space 3} .4301787
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} -.189108{col 26}{space 2}  .116485{col 37}{space 1}   -1.62{col 46}{space 3}0.107{col 54}{space 4}-.4194642{col 67}{space 3} .0412481
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0586027{col 26}{space 2} .0854857{col 37}{space 1}   -0.69{col 46}{space 3}0.494{col 54}{space 4}-.2276559{col 67}{space 3} .1104506
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1706981{col 26}{space 2} .0582263{col 37}{space 1}    2.93{col 46}{space 3}0.004{col 54}{space 4}  .055552{col 67}{space 3} .2858442
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est9{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}     141
{txt}{hline 13}{char +}{hline 30}           F(  5,   135) ={res}    1.14
    {txt}   Model {char |} {res} .038004833     5  .007600967           {txt}Prob > F      = {res} 0.3429
    {txt}Residual {char |} {res}  .90100516   135  .006674112           {txt}R-squared     = {res} 0.0405
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0049
    {txt}   Total {char |} {res} .939009993   140  .006707214           {txt}Root MSE      = {res}  .0817

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    PCE1y_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}PCE1y_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0000432{col 26}{space 2} .0860663{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-.1702559{col 67}{space 3} .1701694
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0000432{col 26}{space 2} .0860663{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-.1702559{col 67}{space 3} .1701694
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .2012946{col 26}{space 2} .0843547{col 37}{space 1}    2.39{col 46}{space 3}0.018{col 54}{space 4} .0344669{col 67}{space 3} .3681223
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} 5.35e-06{col 26}{space 2} .0861154{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-.1703045{col 67}{space 3} .1703152
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} 5.35e-06{col 26}{space 2} .0861154{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-.1703045{col 67}{space 3} .1703152
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0005257{col 26}{space 2} .0068803{col 37}{space 1}   -0.08{col 46}{space 3}0.939{col 54}{space 4}-.0141328{col 67}{space 3} .0130814
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est10{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.9301{col 18} 0.9370{col 27} 129.78{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} 
{txt}2     {res}{col 9} 0.8602{col 18}-0.0319{col 27} 241.54{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}3     {res}{col 9} 0.7903{col 18}-0.0333{col 27} 336.53{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}4     {res}{col 9} 0.6936{col 18}-0.2446{col 27} 410.21{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}       {hline 1}{c RT}        
{txt}5     {res}{col 9} 0.5969{col 18}-0.0586{col 27} 465.16{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}(712 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}     142
{txt}{hline 13}{char +}{hline 30}           F(  5,   136) ={res}  319.01
    {txt}   Model {char |} {res} 11.3613907     5  2.27227814           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} .968724524   136  .007122974           {txt}R-squared     = {res} 0.9214
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.9185
    {txt}   Total {char |} {res} 12.3301152   141  .087447626           {txt}Root MSE      = {res}  .0844

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   CORECPI1y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}CORECPI1y {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .9687769{col 26}{space 2} .0857075{col 37}{space 1}   11.30{col 46}{space 3}0.000{col 54}{space 4} .7992852{col 67}{space 3} 1.138269
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0046497{col 26}{space 2} .1187869{col 37}{space 1}    0.04{col 46}{space 3}0.969{col 54}{space 4}-.2302585{col 67}{space 3}  .239558
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1409678{col 26}{space 2} .1182289{col 37}{space 1}    1.19{col 46}{space 3}0.235{col 54}{space 4}-.0928371{col 67}{space 3} .3747727
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.1358003{col 26}{space 2} .1188949{col 37}{space 1}   -1.14{col 46}{space 3}0.255{col 54}{space 4}-.3709222{col 67}{space 3} .0993216
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0313043{col 26}{space 2} .0857868{col 37}{space 1}   -0.36{col 46}{space 3}0.716{col 54}{space 4}-.2009529{col 67}{space 3} .1383443
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1030815{col 26}{space 2} .0498584{col 37}{space 1}    2.07{col 46}{space 3}0.041{col 54}{space 4} .0044834{col 67}{space 3} .2016796
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est11{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}     141
{txt}{hline 13}{char +}{hline 30}           F(  5,   135) ={res}    0.54
    {txt}   Model {char |} {res} .020008671     5  .004001734           {txt}Prob > F      = {res} 0.7455
    {txt}Residual {char |} {res} .999938259   135   .00740695           {txt}R-squared     = {res} 0.0196
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0167
    {txt}   Total {char |} {res} 1.01994693   140  .007285335           {txt}Root MSE      = {res} .08606

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}CORECPI1y_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
CORECPI1y_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-7.66e-06{col 26}{space 2} .0860663{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-.1702203{col 67}{space 3}  .170205
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-7.66e-06{col 26}{space 2} .0860663{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-.1702203{col 67}{space 3}  .170205
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1401844{col 26}{space 2} .0852924{col 37}{space 1}    1.64{col 46}{space 3}0.103{col 54}{space 4}-.0284977{col 67}{space 3} .3088664
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} 8.37e-06{col 26}{space 2} .0861415{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4} -.170353{col 67}{space 3} .1703697
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} 8.37e-06{col 26}{space 2} .0861415{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4} -.170353{col 67}{space 3} .1703697
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0002331{col 26}{space 2}  .007248{col 37}{space 1}   -0.03{col 46}{space 3}0.974{col 54}{space 4}-.0145674{col 67}{space 3} .0141013
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est12{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.9529{col 18} 0.9597{col 27} 136.23{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} 
{txt}2     {res}{col 9} 0.9059{col 18}-0.0205{col 27} 260.18{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}3     {res}{col 9} 0.8588{col 18}-0.0211{col 27} 372.37{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}4     {res}{col 9} 0.7992{col 18}-0.1660{col 27}  470.2{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}       {hline 1}{c RT}        
{txt}5     {res}{col 9} 0.7396{col 18}-0.0313{col 27} 554.57{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}(712 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}     142
{txt}{hline 13}{char +}{hline 30}           F(  5,   136) ={res}  302.17
    {txt}   Model {char |} {res} 8.09955465     5  1.61991093           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res}  .72907729   136  .005360862           {txt}R-squared     = {res} 0.9174
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.9144
    {txt}   Total {char |} {res} 8.82863194   141  .062614411           {txt}Root MSE      = {res} .07322

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   COREPCE1y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}COREPCE1y {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .9596465{col 26}{space 2} .0856794{col 37}{space 1}   11.20{col 46}{space 3}0.000{col 54}{space 4} .7902102{col 67}{space 3} 1.129083
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0088441{col 26}{space 2} .1177059{col 37}{space 1}    0.08{col 46}{space 3}0.940{col 54}{space 4}-.2239265{col 67}{space 3} .2416148
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1941615{col 26}{space 2} .1168823{col 37}{space 1}    1.66{col 46}{space 3}0.099{col 54}{space 4}-.0369803{col 67}{space 3} .4253033
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.1837513{col 26}{space 2} .1184022{col 37}{space 1}   -1.55{col 46}{space 3}0.123{col 54}{space 4}-.4178988{col 67}{space 3} .0503962
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0409629{col 26}{space 2} .0861806{col 37}{space 1}   -0.48{col 46}{space 3}0.635{col 54}{space 4}-.2113903{col 67}{space 3} .1294644
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1076461{col 26}{space 2} .0456941{col 37}{space 1}    2.36{col 46}{space 3}0.020{col 54}{space 4} .0172833{col 67}{space 3} .1980089
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est13{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}     141
{txt}{hline 13}{char +}{hline 30}           F(  5,   135) ={res}    1.02
    {txt}   Model {char |} {res} .028604922     5  .005720984           {txt}Prob > F      = {res} 0.4104
    {txt}Residual {char |} {res} .759690897   135   .00562734           {txt}R-squared     = {res} 0.0363
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0006
    {txt}   Total {char |} {res}  .78829582   140  .005630684           {txt}Root MSE      = {res} .07502

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}COREPCE1y_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
COREPCE1y_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0000584{col 26}{space 2} .0860663{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4} -.170271{col 67}{space 3} .1701543
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0000584{col 26}{space 2} .0860663{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4} -.170271{col 67}{space 3} .1701543
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1915363{col 26}{space 2} .0849537{col 37}{space 1}    2.25{col 46}{space 3}0.026{col 54}{space 4}  .023524{col 67}{space 3} .3595487
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0000694{col 26}{space 2} .0865383{col 37}{space 1}    0.00{col 46}{space 3}0.999{col 54}{space 4}-.1710768{col 67}{space 3} .1712156
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0000694{col 26}{space 2} .0865383{col 37}{space 1}    0.00{col 46}{space 3}0.999{col 54}{space 4}-.1710768{col 67}{space 3} .1712156
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0005609{col 26}{space 2} .0063184{col 37}{space 1}   -0.09{col 46}{space 3}0.929{col 54}{space 4}-.0130567{col 67}{space 3} .0119349
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est14{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.9495{col 18} 0.9566{col 27} 135.26{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} 
{txt}2     {res}{col 9} 0.8991{col 18}-0.0221{col 27} 257.36{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}3     {res}{col 9} 0.8486{col 18}-0.0228{col 27}  366.9{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}4     {res}{col 9} 0.7779{col 18}-0.2230{col 27} 459.59{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}       {hline 1}{c RT}        
{txt}5     {res}{col 9} 0.7072{col 18}-0.0410{col 27} 536.74{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}
{com}. esttab using "${c -(}sum_table_folder{c )-}/autoreg.csv", se r2 replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/autoreg.csv"'})

{com}. eststo clear
{txt}
{com}. */
. 
. 
. ****************************************
. **** Quarterly Level Analysis  ******
. ****************************************
. 
. *******************************************
. ***  Collapse monthly data to quarterly  **
. *******************************************
. 
. local Infbf    Inf1y_CPIAU Inf1yf_CPIAU Inf1y_CPICore Inf1yf_CPICore Inf1y_PCE ///
>                Inf1yf_PCE Inf1y_PCECore Inf1yf_PCECore
{txt}
{com}. 
. local Moments  Q9_mean Q9_var Q9_disg Q9_iqr ///
>                Q9_fe_var Q9_fe_atv Q9_atv ///
>                CPI1y PCE1y CORECPI1y COREPCE1y InfExpMichMed ///
>                CPI_disg PCE_disg CORECPI_disg COREPCE_disg ///
>                            CPI_atv PCE_atv CORECPI_atv COREPCE_atv ///
>                            CPI_fe_var PCE_fe_var CORECPI_fe_var COREPCE_fe_var ///
>                            CPI_fe_atv PCE_fe_atv CORECPI_fe_atv COREPCE_fe_atv ///
>                            SCE_FE SPFCPI_FE SPFPCE_FE ///
>                            PRCCPIVar1mean PRCPCEVar1mean PRCCPIVar0mean PRCPCEVar0mean 
{txt}
{com}.                                 
. local MomentsRv PRCCPIMean_rv PRCPCEMean_rv  PRCCPIVar_rv PRCPCEVar_rv  ///
>                 PRCCPIMeanl1  PRCCPIVarl1 PRCCPIMeanf0  PRCCPIVarf0 /// 
>                                 PRCPCEMeanl1  PRCPCEVarl1 PRCPCEMeanf0  PRCPCEVarf0
{txt}
{com}.                                 
.                                 
. local MomentsMom PRCCPIMean0p25 PRCCPIMean1p25 PRCPCEMean0p25 PRCPCEMean1p25 /// 
>               PRCCPIVar0p25 PRCCPIVar1p25 PRCPCEVar0p25 PRCPCEVar1p25 ///
>                           PRCCPIMean0p50 PRCCPIMean1p50 PRCPCEMean0p50 PRCPCEMean1p50 /// 
>               PRCCPIVar0p50 PRCCPIVar1p50 PRCPCEVar0p50 PRCPCEVar1p50 ///
>                           PRCCPIMean0p75 PRCCPIMean1p75 PRCPCEMean0p75 PRCPCEMean1p75 /// 
>               PRCCPIVar0p75 PRCCPIVar1p75 PRCPCEVar0p75 PRCPCEVar1p75 ///
>                           PRCCPIMean0p10 PRCCPIMean1p10 PRCPCEMean0p10 PRCPCEMean1p10 /// 
>               PRCCPIVar0p10 PRCCPIVar1p10 PRCPCEVar0p10 PRCPCEVar1p10 ///
>                           PRCCPIMean0p90 PRCCPIMean1p90 PRCPCEMean0p90 PRCPCEMean1p90 /// 
>               PRCCPIVar0p90 PRCCPIVar1p90 PRCPCEVar0p90 PRCPCEVar1p90 
{txt}
{com}. 
. 
. collapse (mean) `Moments' `MomentsMom' `MomentsRv' `Infbf', ///
>                                 by(year quarter) 
{txt}
{com}. 
. gen date2=string(year)+"Q"+string(quarter)
{txt}
{com}. gen date3= quarterly(date2,"YQ")
{txt}(1 missing value generated)

{com}. format date3 %tq 
{txt}
{com}. drop date2 
{txt}
{com}. rename date3 date
{res}{txt}
{com}. 
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1948q1 to 2019q2
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. sort year quarter  
{txt}
{com}. 
. order date year quarter 
{txt}
{com}. 
. /*
> ********************************************************
> *** Multiple series charts Quarterly (Moments Only)  ***
> ********************************************************
> drop if CPI1y ==. | PCE1y==.
> 
> 
> twoway (tsline Q9_mean) (tsline InfExpMichMed, lp("dash_dot")) ///
>        (tsline CPI1y, lp("shortdash")) (tsline PCE1y, lp("dash")), ///
>                                                  title("1-yr-ahead Expected Inflation") ///
>                                                  xtitle("Time") ytitle("") ///
>                                                  legend(label(1 "Mean Expectation(SCE)") ///
>                                                         label(2 "Median Expectation(Michigan)") ///
>                                                                 label(3 "Mean Expectation CPI (SPF)") ///
>                                                                 label(4 "Mean Expectation PCE (SPF)") col(1))
> graph export "${c -(}sum_graph_folder{c )-}/mean_medQ", as(png) replace
> 
> 
> twoway (tsline Q9_disg, ytitle(" ",axis(1))) ///
>        (tsline CORECPI_disg,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if CORECPI_disg!=., ///
>            title("Disagreements in 1-yr-ahead Inflation") xtitle("Time") ///
>            legend(label(1 "Disagreements (SCE)") label(2 "Disagreements(SPF)(RHS)"))
> graph export "${c -(}sum_graph_folder{c )-}/disg_disgQ", as(png) replace 
> 
> 
> twoway (tsline Q9_var, ytitle(" ",axis(1)) lp("solid") ) ///
>        (tsline PRCCPIVar1mean, yaxis(2) ytitle("",axis(2)) lp("shortdash")) ///
>            (tsline PRCPCEVar1mean, yaxis(2) ytitle("",axis(2)) lp("dash_dot")) ///
>            if Q9_var!=., ///
>            title("Uncertainty in 1-yr-ahead Inflation") xtitle("Time") ///
>            legend(label(1 "Uncertainty (SCE)")  /// 
>                   label(2 "Uncertainty (SPF CPI)(RHS)") ///
>                           label(3 "Uncertainty (SPF PCE)(RHS)") col(1)) 
>                           
> graph export "${c -(}sum_graph_folder{c )-}/var_varQ", as(png) replace 
> 
> 
> twoway (tsline SCE_FE)  (tsline SPFCPI_FE, yaxis(2) lp("dash")) ///
>         (tsline SPFPCE_FE, yaxis(2) lp("dash_dot")) ///
>                          if SPFCPI_FE!=., ///
>                                                  title("1-yr-ahead Forecast Errors") ///
>                                                  xtitle("Time") ytitle("") ///
>                                                  legend(col(1) label(1 "SCE") label(2 "SPF CPI (RHS)") ///
>                                                                 label(3 "SPF PCE(RHS)"))
> graph export "${c -(}sum_graph_folder{c )-}/fe_feQ", as(png) replace
> 
> 
> 
> twoway (tsline SPFCPI_FE, ytitle(" ",axis(1))) ///
>        (tsline PRCCPIVar1mean,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if PRCCPIVar1mean!=., ///
>            title("1-yr-ahead Expected Inflation (SPF CPI)") xtitle("Time") ///
>            legend(label(1 "Average Forecast Error") label(2 "Average Uncertainty(RHS)"))
> graph export "${c -(}sum_graph_folder{c )-}/fe_varSPFSPIQ", as(png) replace 
> 
> 
> twoway (tsline SPFPCE_FE, ytitle(" ",axis(1))) ///
>        (tsline PRCPCEVar1mean,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if PRCPCEVar1mean!=., ///
>            title("1-yr-ahead Expected Inflation (SPF PCE)") xtitle("Time") ///
>            legend(label(1 "Average Forecast Error") label(2 "Average Uncertainty(RHS)"))
> graph export "${c -(}sum_graph_folder{c )-}/fe_varSPFPCEQ", as(png) replace 
> 
> 
> 
> twoway (tsline CPI_disg, ytitle(" ",axis(1))) ///
>        (tsline PRCCPIVar1mean,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if PRCCPIVar1mean!=., ///
>            title("1-yr-ahead Expected Inflation(SPF CPI)") xtitle("Time") ///
>            legend(label(1 "Disagreements") label(2 "Average Uncertainty(RHS)")) 
> graph export "${c -(}sum_graph_folder{c )-}/var_disgSPFCPIQ", as(png) replace 
> 
> 
> twoway (tsline PCE_disg, ytitle(" ",axis(1))) ///
>        (tsline PRCPCEVar1mean,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if PRCPCEVar1mean!=., ///
>            title("1-yr-ahead Expected Inflation(SPF PCE)") xtitle("Time") ///
>            legend(label(1 "Disagreements") label(2 "Average Uncertainty(RHS)")) 
> graph export "${c -(}sum_graph_folder{c )-}/var_disgSPFPCEQ", as(png) replace 
> */
. 
. /*
> *****************************************
> ** These are the charts for paper draft 
> ****************************************
> 
> twoway (tsline PRCCPIMean1p25, ytitle(" ",axis(1))  lwidth(thick) lp("shortdash")) ///
>        (tsline PRCCPIMean1p75, ytitle(" ",axis(1)) lwidth(thick) lp("shortdash")) ///
>            (tsline PRCCPIMean1p50, ytitle(" ",axis(1)) lwidth(thick) lp("solid")) ///
>            if PRCCPIVar1p25!=. , /// 
>            title("SPF(CPI)",size(large)) xtitle("Time") ///
>            legend(label(1 "25 pctile of forecast") label(2 "75 pctile of forecast") ///
>                   label(3 "50 pctile of forecast") col(1)) 
> graph export "${c -(}sum_graph_folder{c )-}/IQRmeanCPIQ", as(png) replace 
> 
> 
> twoway (tsline PRCPCEMean1p25, ytitle(" ",axis(1))  lwidth(thick) lp("shortdash")) ///
>        (tsline PRCPCEMean1p75, ytitle(" ",axis(1)) lwidth(thick) lp("shortdash")) ///
>            (tsline PRCPCEMean1p50, ytitle(" ",axis(1)) lwidth(thick) lp("solid")) ///
>            if PRCPCEVar1p25!=. , /// 
>            title("SPF(PCE)",size(large)) xtitle("Time") ///
>            legend(label(1 "25 pctile of forecast") label(2 "75 pctile of forecast") ///
>                   label(3 "50 pctile of forecast") col(1)) 
> graph export "${c -(}sum_graph_folder{c )-}/IQRmeanPCEQ", as(png) replace 
> 
> 
> twoway (tsline PRCCPIVar1p25, ytitle(" ",axis(1))  lwidth(thick) lp("shortdash")) ///
>        (tsline PRCCPIVar1p75, ytitle(" ",axis(1)) lwidth(thick) lp("shortdash")) ///
>            (tsline PRCCPIVar1p50, ytitle(" ",axis(1)) lwidth(thick) lp("solid")) ///
>            if PRCCPIVar1p25!=. , /// 
>            title("SPF(CPI)",size(large)) xtitle("Time") ///
>            legend(label(1 "25 pctile of uncertainty") label(2 "75 pctile of uncertainty") ///
>                   label(3 "50 pctile of uncertainty") col(1)) 
> graph export "${c -(}sum_graph_folder{c )-}/IQRvarCPIQ", as(png) replace 
> 
> 
> twoway (tsline PRCPCEVar1p25, ytitle(" ",axis(1)) lwidth(thick) lp("shortdash")) ///
>        (tsline PRCPCEVar1p75, ytitle(" ",axis(1)) lwidth(thick) lp("shortdash")) ///
>            (tsline PRCPCEVar1p50, ytitle(" ",axis(1)) lwidth(thick) lp("solid")) ///
>            if PRCPCEVar1p25!=. , ///
>            title("SPF(PCE)",size(large)) xtitle("Time") ///
>            legend(label(1 "25 pctile of uncertainty") label(2 "75 pctile of uncertainty") ///
>                   label(3 "50 pctile of uncertainty") col(1)) 
> graph export "${c -(}sum_graph_folder{c )-}/IQRvarPCEQ", as(png) replace 
> 
> 
> 
> ** generate absolute values of FE for plotting
> 
> foreach var in SPFCPI SPFPCE{c -(}
> gen `var'_abFE = abs(`var'_FE)
> label var `var'_abFE "Absolute Val of Average Forecast Error"
> {c )-}
> 
> 
> ** temporarily change the name for plotting 
> 
> label var Inf1yf_CPIAU "Realized Headline CPI Inflation"
> label var Inf1yf_CPICore "Realized Core CPI Inflation"
> label var SPFCPI_FE "Average Forecast Error"
> label var CPI_disg "Disagreement"
> label var CORECPI_disg "Disagreement"
> 
> label var PRCCPIVar1mean "Average Uncertainty(RHS)"
> label var Inf1yf_PCE "Realized PCE Inflation"
> label var Inf1yf_PCECore "Realized Core PCE Inflation"
> label var SPFPCE_FE "Average Forecast Error"
> label var PCE_disg "Disagreement"
> label var COREPCE_disg "Disagreement"
> 
> label var PRCPCEVar1mean "Average Uncertainty(RHS)"
> 
> 
> foreach var in Inf1yf_CPICore SPFCPI_abFE CORECPI_disg{c -(}
> pwcorr `var' PRCCPIVar1mean, star(0.05)
> local rho: display %4.2f r(rho) 
> twoway (tsline `var',ytitle(" ",axis(1)) lp("shortdash") lwidth(thick)) ///
>        (tsline PRCCPIVar1mean, yaxis(2) ytitle("",axis(2)) lp("longdash") lwidth(thick)) ///
>            if PRCCPIVar1mean!=., ///
>            title("SPF(CPI)",size(large)) xtitle("Time") ytitle("") ///
>            legend(size(large) col(1)) ///
>            caption("{c -(}superscript:Corr Coeff= `rho'{c )-}", ///
>            justification(left) position(11) size(vlarge))
> graph export "${c -(}sum_graph_folder{c )-}/`var'_varSPFCPIQ", as(png) replace
> {c )-}
> 
> foreach var in Inf1yf_PCECore SPFPCE_abFE COREPCE_disg{c -(}
> pwcorr `var' PRCPCEVar1mean, star(0.05)
> local rho: display %4.2f r(rho) 
> twoway (tsline `var',ytitle(" ",axis(1)) lp("shortdash") lwidth(thick)) ///
>        (tsline PRCPCEVar1mean, yaxis(2) ytitle("",axis(2)) lp("longdash") lwidth(thick)) ///
>            if PRCPCEVar1mean!=., ///
>            title("SPF(PCE)",size(large)) xtitle("Time") ytitle("") ///
>            legend(size(large) col(1)) ///
>            caption("{c -(}superscript:Corr Coeff= `rho'{c )-}", ///
>            justification(left) position(11) size(vlarge))
> graph export "${c -(}sum_graph_folder{c )-}/`var'_varSPFPCEQ", as(png) replace
> {c )-}
> 
> */
. 
. ********************************************************************
. ** Drop the inflation measures temporarily used for plotting ********
. *********************************************************************
. 
. 
. foreach var in `Infbf'{c -(}
{txt}  2{com}.   drop `var'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. ********************************
. ***  Autoregression Quarterly **
. *******************************
. 
. tsset date 
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1948q1 to 2019q2
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. 
. eststo clear
{txt}
{com}. 
. gen InfExp1y = .
{txt}(287 missing values generated)

{com}. gen InfExpFE1y = .
{txt}(287 missing values generated)

{com}. gen InfExpVar1y=.
{txt}(287 missing values generated)

{com}. gen InfExpDisg1y = .
{txt}(287 missing values generated)

{com}. 
. *****************************************
. ****  Renaming so that more consistent **
. *****************************************
. 
. 
. rename Q9_mean SCE_Mean
{res}{txt}
{com}. rename Q9_var SCE_Var
{res}{txt}
{com}. rename Q9_disg SCE_Disg
{res}{txt}
{com}. rename SCE_FE SCE_FE
{res}{txt}  (all {it:newnames}=={it:oldnames})

{com}. rename Q9_fe_var SCE_FEVar
{res}{txt}
{com}. rename Q9_fe_atv SCE_FEATV
{res}{txt}
{com}. rename Q9_atv SCE_ATV
{res}{txt}
{com}. 
. rename CPI1y SPFCPINC_Mean
{res}{txt}
{com}. rename PCE1y SPFPCENC_Mean
{res}{txt}
{com}. rename COREPCE1y SPFPCE_Mean
{res}{txt}
{com}. rename CORECPI1y SPFCPI_Mean
{res}{txt}
{com}. 
. rename CPI_disg SPFCPINC_Disg
{res}{txt}
{com}. rename PCE_disg SPFPCENC_Disg 
{res}{txt}
{com}. rename CORECPI_disg SPFCPI_Disg
{res}{txt}
{com}. rename COREPCE_disg SPFPCE_Disg
{res}{txt}
{com}. 
. rename CPI_atv SPFCPINC_ATV
{res}{txt}
{com}. rename PCE_atv SPFPCENC_ATV
{res}{txt}
{com}. rename CORECPI_atv SPFCPI_ATV
{res}{txt}
{com}. rename COREPCE_atv SPFPCE_ATV
{res}{txt}
{com}. 
. rename PRCPCEVar1mean SPFPCE_Var
{res}{txt}
{com}. rename PRCCPIVar1mean SPFCPI_Var
{res}{txt}
{com}. 
. rename SPFCPI_FE SPFCPI_FE
{res}{txt}  (all {it:newnames}=={it:oldnames})

{com}. rename SPFPCE_FE SPFPCE_FE
{res}{txt}  (all {it:newnames}=={it:oldnames})

{com}. 
. rename CPI_fe_var SPFCPINC_FEVar
{res}{txt}
{com}. rename PCE_fe_var SPFPCENC_FEVar 
{res}{txt}
{com}. rename CORECPI_fe_var SPFCPI_FEVar
{res}{txt}
{com}. rename COREPCE_fe_var SPFPCE_FEVar
{res}{txt}
{com}. 
. rename CPI_fe_atv SPFCPINC_FEATV
{res}{txt}
{com}. rename PCE_fe_atv SPFPCENC_FEATV 
{res}{txt}
{com}. rename CORECPI_fe_atv SPFCPI_FEATV
{res}{txt}
{com}. rename COREPCE_fe_atv SPFPCE_FEATV
{res}{txt}
{com}. 
. 
. rename PRCPCEMean_rv SPFPCE_Mean_rv
{res}{txt}
{com}. rename PRCCPIMean_rv SPFCPI_Mean_rv
{res}{txt}
{com}. 
. rename PRCPCEVar_rv SPFPCE_Var_rv
{res}{txt}
{com}. rename PRCCPIVar_rv SPFCPI_Var_rv
{res}{txt}
{com}. 
. **********************************
. rename PRCCPIMeanl1 SPFCPI_Meanl1
{res}{txt}
{com}. rename PRCCPIVarl1 SPFCPI_Varl1
{res}{txt}
{com}. 
. rename PRCCPIMeanf0 SPFCPI_Meanf0
{res}{txt}
{com}. rename PRCCPIVarf0 SPFCPI_Varf0
{res}{txt}
{com}. 
. rename PRCPCEMeanl1 SPFPCE_Meanl1
{res}{txt}
{com}. rename PRCPCEVarl1 SPFPCE_Varl1
{res}{txt}
{com}. 
. rename PRCPCEMeanf0 SPFPCE_Meanf0
{res}{txt}
{com}. rename PRCPCEVarf0 SPFPCE_Varf0
{res}{txt}
{com}. 
. ********************************
. gen InfExp_Mean = .
{txt}(287 missing values generated)

{com}. gen InfExp_Var = .
{txt}(287 missing values generated)

{com}. gen InfExp_FE = .
{txt}(287 missing values generated)

{com}. gen InfExp_Disg = . 
{txt}(287 missing values generated)

{com}. 
. gen InfExp_Mean_ch = .
{txt}(287 missing values generated)

{com}. gen InfExp_Var_ch = .
{txt}(287 missing values generated)

{com}. gen InfExp_FE_ch = .
{txt}(287 missing values generated)

{com}. gen InfExp_Disg_ch = .
{txt}(287 missing values generated)

{com}. 
. gen InfExp_Mean_rv =.
{txt}(287 missing values generated)

{com}. gen InfExp_Var_rv =.
{txt}(287 missing values generated)

{com}. 
. gen InfExp_Meanl1 =. 
{txt}(287 missing values generated)

{com}. gen InfExp_Varl1 =. 
{txt}(287 missing values generated)

{com}. 
. gen InfExp_Meanf0 =. 
{txt}(287 missing values generated)

{com}. gen InfExp_Varf0 =. 
{txt}(287 missing values generated)

{com}.  
. 
. foreach mom in Mean Var{c -(}
{txt}  2{com}.   foreach var in PRCCPI PRCPCE{c -(}
{txt}  3{com}.     forval i =0/1{c -(}
{txt}  4{com}.         local lb=substr("`var'",4,3)
{txt}  5{com}.         rename `var'`mom'`i'p25 SPF`lb'`mom'`i'p25
{txt}  6{com}.     rename `var'`mom'`i'p50 SPF`lb'`mom'`i'p50
{txt}  7{com}.         rename `var'`mom'`i'p75 SPF`lb'`mom'`i'p75
{txt}  8{com}.         {c )-}
{txt}  9{com}.    {c )-}
{txt} 10{com}. {c )-}
{res}{txt}
{com}. 
. *****************************
. 
. gen InfExp_Mean0 =.
{txt}(287 missing values generated)

{com}. gen InfExp_Var0 =.
{txt}(287 missing values generated)

{com}. 
. ******************************
. 
. /*
> *******************************************************
> **** Autoregression on the levels of population moments
> ********************************************************
> 
> 
> eststo clear 
> foreach mom in Mean Var Disg FE{c -(}
>    foreach var in SCE SPFCPI SPFPCE{c -(}
>     replace InfExp_`mom' = `var'_`mom'
>     eststo `var'_`mom': reg InfExp_`mom' l(3/5).InfExp_`mom', vce(robust)
>   {c )-} 
> {c )-}
> 
> esttab using "${c -(}sum_table_folder{c )-}/autoregLvlQ.csv", mtitles drop(_cons) se(%8.3f) scalars(N r2 ar2) replace
> 
> 
> **********************************************************************
> ******** Autoregression on the first difference of population moments
>  **********************************************************************
> 
> eststo clear
> foreach mom in Mean Var Disg FE{c -(}
>    foreach var in SCE SPFCPI SPFPCE{c -(}
>     replace InfExp_`mom' = `var'_`mom'
>     replace InfExp_`mom'_ch = InfExp_`mom'-l1.InfExp_`mom'
>     eststo `var'_`mom': reg InfExp_`mom'_ch l(1/4).InfExp_`mom'_ch, vce(robust)
>   {c )-}
> {c )-}
> esttab using "${c -(}sum_table_folder{c )-}/autoregDiffQ.csv", mtitles drop(_cons) se(%8.3f) scalars(N r2 ar2) replace
> 
> 
> ***************
> *** SPF Only **
> ***************
> 
> eststo clear
> 
> foreach mom in Mean Var{c -(}
>    foreach var in SPFCPI SPFPCE{c -(}
>     replace InfExp_`mom' = `var'_`mom'
>     replace InfExp_`mom'_ch = InfExp_`mom'-l1.InfExp_`mom'
>         capture replace InfExp_`mom'_rv = `var'_`mom'_rv  /// caputure because FE and Disg has to rev
> 
>         eststo `var'_`mom'lvl: reg InfExp_`mom' l(1/2).InfExp_`mom' 
>     eststo `var'_`mom'diff: reg InfExp_`mom'_ch l(1/2).InfExp_`mom'_ch  
>         capture eststo `var'_`mom'_rv: reg InfExp_`mom'_rv l(1/2).InfExp_`mom'_rv 
> 
>   {c )-}
> {c )-}
> esttab using "${c -(}sum_table_folder{c )-}/autoregSPFQ.csv", mtitles drop(_cons) se(%8.3f) scalars(N r2 ar2) replace
> eststo clear
> 
> 
> *******************************
> *** Unbiasedness Test        **
> *******************************
> eststo clear
> 
> foreach mom in FE{c -(}
>    foreach var in SPFCPI SPFPCE{c -(}
>       ttest `var'_`mom'=0
> {c )-}
> {c )-}
> 
> 
> gen const=1
> 
> foreach mom in FE{c -(}
>    foreach var in SPFCPI SPFPCE{c -(}
>       
> {c )-}
> {c )-}
> 
> 
> 
> **********************************************
> *** Revision Efficiency Test Using FE       **
> **********************************************
> 
> gen const=1
> 
> foreach mom in FE{c -(}
>    foreach var in SPFCPI SPFPCE{c -(}
>    
>    replace InfExp_Mean = `var'_Mean
>    replace InfExp_`mom' = `var'_`mom'
>    eststo `var'_`mom'_const: reg InfExp_`mom'
>    eststo `var'_`mom'_lag4: reg  InfExp_`mom' l(4).InfExp_Mean, robust
>    eststo `var'_`mom'_arlag4: reg InfExp_`mom' l(4).InfExp_`mom', robust
>    eststo `var'_`mom'_arlag13: reg  InfExp_`mom' l(1/3).InfExp_`mom', robust
> 
>  {c )-}
> {c )-}
> esttab using "${c -(}sum_table_folder{c )-}/FEEfficiencySPFQ.csv", mtitles se(%8.3f) scalars(N r2)  replace
> 
> 
> 
> *********************************************************************
> *** Revision Efficiency Test Using Mean Revision Fuhrer's approach **
> *********************************************************************
> 
> 
> foreach mom in Var{c -(}
>    foreach var in SPFCPI SPFPCE{c -(}
>     ttest `var'_`mom'_rv =0
>  {c )-}
> {c )-}
> 
> eststo clear
> 
> foreach var in SPFCPI SPFPCE{c -(}
>   foreach mom in Mean{c -(}
>      replace InfExp_`mom' = `var'_`mom'
>          replace InfExp_`mom'l1 = `var'_`mom'l1
>      replace InfExp_`mom'f0 = `var'_`mom'f0
>      eststo `var'`mom'rvlv1: reg InfExp_`mom'f0 InfExp_`mom'
>          test _b[InfExp_`mom']=1
>           scalar btestpv= r(p)
>          estadd scalar btestpv
>          eststo `var'`mom'rvlv2: reg InfExp_`mom'f0 l(0/1).InfExp_`mom'
>          test _b[InfExp_`mom']=1
>          scalar btestpv= r(p)
>          estadd scalar btestpv
>          eststo `var'`mom'rvlv3: reg InfExp_`mom'f0 l(0/2).InfExp_`mom'
>      test _b[InfExp_`mom']=1
>          scalar btestpv= r(p)
>          estadd scalar btestpv
>  {c )-}
> {c )-}
> 
> foreach var in SPFCPI SPFPCE{c -(}
>   foreach mom in Var{c -(}
>      replace InfExp_`mom' = `var'_`mom'
>      replace InfExp_`mom'l1 = `var'_`mom'l1
>          replace InfExp_`mom'f0 = `var'_`mom'f0
>      eststo `var'`mom'rvlv1: reg InfExp_`mom'f0 InfExp_`mom'
>          test _b[_cons]=0
>          scalar btestpv= r(p)
>          estadd scalar btestpv
>          eststo `var'`mom'rvlv2: reg InfExp_`mom'f0 l(0/1).InfExp_`mom'
>          test _b[_cons]=0
>          scalar btestpv= r(p)
>          estadd scalar btestpv
>          eststo `var'`mom'rvlv3: reg InfExp_`mom'f0 l(0/2).InfExp_`mom'
>          test _b[_cons]=0
>          scalar btestpv= r(p)
>          estadd scalar btestpv
>  {c )-}
> {c )-}
> 
> esttab using "${c -(}sum_table_folder{c )-}/RVEfficiencySPFQ.csv", mtitles se(%8.3f) scalars(btestpv N r2) sfmt(%8.3f %8.3f %8.3f) replace
> */
. 
. 
. save "${c -(}folder{c )-}/InfExpQ.dta",replace 
{txt}file /Users/Myworld/Dropbox/ExpProject/workingfolder/SurveyData//InfExpQ.dta saved

{com}. 
. 
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/ExpProject/workingfolder/pop_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}13 Nov 2019, 13:45:34
{txt}{.-}
{smcl}
{txt}{sf}{ul off}