{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/ExpProject/workingfolder/pop_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}20 Jun 2019, 21:12:05
{txt}
{com}. 
. ****************************************
. **** Population Moments Analysis ******
. ****************************************
. 
. ***********************
. **   Merge other data**
. ***********************
. 
. use "${c -(}folder{c )-}/NYFEDSurvey/InfExpSCEProbPopM",clear 
{txt}
{com}. 
. merge 1:1 year month using "${c -(}mainfolder{c )-}/OtherData/RecessionDateM.dta", keep(match)
{res}{txt}{p 0 7 2}
(note: variable
year was 
int, now float to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
month was 
byte, now float to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              53{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge  recession_merge
{res}{txt}
{com}. 
. merge 1:1 year month using "${c -(}mainfolder{c )-}/OtherData/InfM.dta",keep(match using master)
{res}{txt}(label _merge already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             802
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}             802{txt}  (_merge==2)

{col 5}matched{col 30}{res}              53{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge inflation_merge 
{res}{txt}
{com}. 
. merge 1:1 year month using "${c -(}folder{c )-}/MichiganSurvey/InfExpMichM.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             151
{txt}{col 9}from master{col 30}{res}             151{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             704{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename inf_exp InfExpMichMed 
{res}{txt}
{com}. rename _merge michigan_merge 
{res}{txt}
{com}. 
. ***********************************************
. ** create quarter variable to match with spf
. *********************************************
. 
. gen quarter = .
{txt}(855 missing values generated)

{com}. replace quarter=1 if month<4 & month >=1
{txt}(216 real changes made)

{com}. replace quarter=2 if month<7 & month >=4
{txt}(213 real changes made)

{com}. replace quarter=3 if month<10 & month >=7
{txt}(213 real changes made)

{com}. replace quarter=4 if month<=12 & month >=10
{txt}(213 real changes made)

{com}. 
. merge m:1 year quarter using "${c -(}folder{c )-}/SPF/individual/InfExpSPFPointPopQ.dta",keep(match using master)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             250
{txt}{col 9}from master{col 30}{res}             249{txt}  (_merge==1)
{col 9}from using{col 30}{res}               1{txt}  (_merge==2)

{col 5}matched{col 30}{res}             606{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge spf_merge 
{res}{txt}
{com}. 
. 
. merge m:1 year quarter using "${c -(}folder{c )-}/SPF/InfExpSPFDstPopQ.dta",keep(match using master)
{res}{txt}{p 0 7 2}
(note: variable
year was 
float, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
quarter was 
float, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             708
{txt}{col 9}from master{col 30}{res}             708{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             148{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge spf_dst_merge 
{res}{txt}
{com}. 
. 
. *************************
. ** Declare time series **
. **************************
. 
. gen date2=string(year)+"m"+string(month)
{txt}
{com}. gen date3= monthly(date2,"YM")
{txt}(1 missing value generated)

{com}. format date3 %tm 
{txt}
{com}. 
. drop date2 date 
{txt}
{com}. rename date3 date
{res}{txt}
{com}. 
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1948m1 to 2019m3
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. sort year quarter month 
{txt}
{com}. 
. 
. ******************************
. *** Computing some measures **
. ******************************
. 
. gen SCE_FE = Q9_mean - Inf1yf_CPICore
{txt}(805 missing values generated)

{com}. label var SCE_FE "1-yr-ahead forecast error"
{txt}
{com}. 
. gen SPFCPI_FE = CPI1y - Inf1yf_CPIAU
{txt}(415 missing values generated)

{com}. label var SPFCPI_FE "1-yr-ahead forecast error(SPF CPI)"
{txt}
{com}. gen SPFCCPI_FE = CORECPI1y - Inf1yf_CPICore
{txt}(721 missing values generated)

{com}. label var SPFCPI_FE "1-yr-ahead forecast error(SPF Core CPI)"
{txt}
{com}. gen SPFPCE_FE = PCE1y - Inf1yf_PCE
{txt}(721 missing values generated)

{com}. label var SPFPCE_FE "1-yr-ahead forecast error(SPF PCE)"
{txt}
{com}. 
. 
. 
. 
. *****************************
. ****    Summary Charts ******
. *****************************
. 
. 
. /*
> **************************
> ** Single series charts **
> **************************
> 
> foreach var in Q9_mean Q9_var Q9_iqr Q9_cent50 Q9_disg ///
>                CPI1y PCE1y CORECPI1y COREPCE1y ///
>                            CPI_disg PCE_disg CORECPI_disg COREPCE_disg ///
>                            CPI_ct50 PCE_ct50 CORECPI_ct50 COREPCE_ct50{c -(}
> local var_lb: var label `var'
> tsline `var' if `var'!=.,title("`var_lb'") xtitle("Time") ytitle("")
> graph export "${c -(}sum_graph_folder{c )-}/`var'", as(png) replace 
> {c )-}
> 
> 
> 
> ***************************
> ** Multiple series charts**
> ***************************
> 
> drop if CPI1y ==. | PCE1y==.
> 
> twoway (tsline Q9_mean)  (tsline Q9_cent50,lp("dash")) ///
>                          (tsline InfExpMichMed, lp("dot-dash")) ///
>                                                  (tsline CPI1y, lp("shortdash")), ///
>                                                  title("1-yr-ahead Expected Inflation") ///
>                                                  xtitle("Time") ytitle("") ///
>                                                  legend(label(1 "Mean Expectation(SCE)") label(2 "Median Expectation(SCE)") ///
>                                                         label(3 "Median Expectation(Michigan)") label(4 "Mean Expectation(SPF)"))
> graph export "${c -(}sum_graph_folder{c )-}/mean_med", as(png) replace
> 
> twoway (tsline Q9_mean, ytitle(" ",axis(1))) ///
>        (tsline Q9_var,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if Q9_mean!=., ///
>            title("1-yr-ahead Expected Inflation") xtitle("Time") ///
>            legend(label(1 "Average Expectation") label(2 "Average Uncertainty(RHS)"))
> graph export "${c -(}sum_graph_folder{c )-}/mean_var", as(png) replace 
> 
> 
> twoway (tsline Q9_mean, ytitle(" ",axis(1))) ///
>        (tsline Q9_disg,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if Q9_mean!=., ///
>            title("1-yr-ahead Expected Inflation") xtitle("Time") ///
>            legend(label(1 "Average Expectation") label(2 "Disagreements(RHS)"))
> graph export "${c -(}sum_graph_folder{c )-}/mean_disg", as(png) replace 
> 
> 
> twoway (tsline Q9_disg, ytitle(" ",axis(1))) ///
>        (tsline CORECPI_disg,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if CORECPI_disg!=., ///
>            title("Disagreements in 1-yr-ahead Inflation") xtitle("Time") ///
>            legend(label(1 "Disagreements (SCE)") label(2 "Disagreements(SPF)(RHS)"))
> graph export "${c -(}sum_graph_folder{c )-}/disg_disg", as(png) replace 
> 
> 
> twoway (tsline Q9_var, ytitle(" ",axis(1))) ///
>        (tsline PRCCPIVar1mean, yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if Q9_var!=., ///
>            title("Uncertainty in 1-yr-ahead Inflation") xtitle("Time") ///
>            legend(label(1 "Uncertainty (SCE)")  /// 
>                   label(2 "Uncertainty (SPF CPI)(RHS)")) 
>                           
> graph export "${c -(}sum_graph_folder{c )-}/var_var", as(png) replace 
> 
> 
> twoway (tsline Q9_disg, ytitle(" ",axis(1))) ///
>        (tsline Q9_var,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if Q9_disg!=., ///
>            title("1-yr-ahead Expected Inflation") xtitle("Time") ///
>            legend(label(1 "Disagreements") label(2 "Average Uncertainty(RHS)")) 
> graph export "${c -(}sum_graph_folder{c )-}/var_disg", as(png) replace 
> 
> 
> 
> twoway (tsline CORECPI_disg, ytitle(" ",axis(1))) ///
>        (tsline PRCCPIVar1mean,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if Q9_disg!=., ///
>            title("1-yr-ahead Expected Inflation(SPF)") xtitle("Time") ///
>            legend(label(1 "Disagreements") label(2 "Average Uncertainty(RHS)")) 
> graph export "${c -(}sum_graph_folder{c )-}/var_disg2", as(png) replace 
> 
> 
> twoway (tsline Q9_mean) (tsline CORECPI1y,lp("longdash")) ///
>        (tsline Inf1yf_PCEPI,lp("dash")) ///
>        (tsline Inf1yf_CPIAU,lp("shortdash")) ///
>            (tsline Inf1yf_CPICore,lp("dash_dot")) ///
>            if Q9_mean!=., ///
>            title("1-yr-ahead Expected Inflation") xtitle("Time") ytitle("") ///
>            legend(label(1 "Mean Forecast(SCE)") label(2 "Mean Forecast(SPF)") label(3 "Realized Inflation(PCE)") ///
>                   label(4 "Realized Inflation(Headline CPI)") label(5 "Realized Inflation(Core CPI)"))
> graph export "${c -(}sum_graph_folder{c )-}/mean_true", as(png) replace
> 
> 
> twoway (tsline Q9_mean)  (tsline Inf1y_PCEPI,lp("dash")) ///
>        (tsline Inf1y_CPIAU,lp("shortdash")) ///
>            (tsline Inf1y_CPICore,lp("dash_dot")) ///
>            if Q9_mean!=., ///
>            title("1-yr-ahead Expected Inflation") xtitle("Time") ytitle("") ///
>            legend(label(1 "Mean Expectation") label(2 "Past Inflation(PCE)") ///
>                   label(3 "Past Inflation(Headline CPI)") label(4 "Past Inflation(Core CPI)"))
> graph export "${c -(}sum_graph_folder{c )-}/mean_past", as(png) replace
> 
> 
> twoway (tsline SCE_FE,ytitle("",axis(1)))  (tsline SPFCPI_FE, yaxis(2) lp("dash")) ///
>        (tsline SPFPCE_FE, yaxis(2) lp("dash_dot"))  ///  
>                          if SPFPCE_FE!=., ///
>                                                  title("1-yr-ahead Forecast Errors") ///
>                                                  xtitle("Time") ytitle("") ///
>                                                  legend(label(1 "SCE") label(2 "SPF CPI(RHS)") ///
>                                                  label(3 "SPF PCE(RHS)"))
> graph export "${c -(}sum_graph_folder{c )-}/fe_fe", as(png) replace
> 
> 
> twoway (tsline PRCCPIVar1p25, ytitle(" ",axis(1)) lp("dash")) ///
>        (tsline PRCCPIVar1p75, ytitle(" ",axis(1)) lp("dash")) ///
>            (tsline PRCCPIVar1p50, ytitle(" ",axis(1)) lp("solid") ) ///
>            if PRCCPIVar1p25!=. , /// 
>            title("1-yr-ahead Expected Inflation(SPF CPI)") xtitle("Time") ///
>            legend(label(1 "25 percentile of uncertainty") label(2 "75 percentile of uncertainty") ///
>                   label(3 "50 percentile of uncertainty")) 
> graph export "${c -(}sum_graph_folder{c )-}/IQRvarCPI", as(png) replace 
> 
> 
> twoway (tsline PRCPCEVar1p25, ytitle(" ",axis(1)) lp("dash")) ///
>        (tsline PRCPCEVar1p75, ytitle(" ",axis(1)) lp("dash")) ///
>            (tsline PRCPCEVar1p50, ytitle(" ",axis(1)) lp("solid") ) ///
>            if PRCPCEVar1p25!=. , ///
>            title("1-yr-ahead Expected Inflation(SPF PCE)") xtitle("Time") ///
>            legend(label(1 "25 percentile of uncertainty") label(2 "75 percentile of uncertainty") ///
>                   label(3 "50 percentile of uncertainty")) 
> graph export "${c -(}sum_graph_folder{c )-}/IQRvarPCE", as(png) replace 
> */
. 
. ***************************
. ***  Population Moments *** 
. ***************************
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1948m1 to 2019m3
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. 
. estpost tabstat Q9_mean Q9_var Q9_disg Q9_iqr CPI1y PCE1y CORECPI1y COREPCE1y ///
>                 CPI_disg PCE_disg CORECPI_disg COREPCE_disg PRCCPIVar1mean PRCPCEVar1mean, ///
>                             st(mean var median) columns(statistics)

{txt}Summary statistics: mean variance p50
     for variables: Q9_mean Q9_var Q9_disg Q9_iqr CPI1y PCE1y CORECPI1y COREPCE1y CPI_disg PCE_disg CORECPI_disg COREPCE_disg PRCCPIVar1mean PRCPCEVar1mean

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:e(mean)}{space 1}{space 1}{ralign 9:e(varia~)}{space 1}{space 1}{ralign 9:e(p50)}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}
{space 0}{space 0}{ralign 12:Q9_mean}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 3.619894}}}{space 1}{space 1}{ralign 9:{res:{sf: .1444362}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.489569}}}{space 1}
{space 0}{space 0}{ralign 12:Q9_var}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 15.81144}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.479447}}}{space 1}{space 1}{ralign 9:{res:{sf: 15.75467}}}{space 1}
{space 0}{space 0}{ralign 12:Q9_disg}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 23.17578}}}{space 1}{space 1}{ralign 9:{res:{sf: 9.717242}}}{space 1}{space 1}{ralign 9:{res:{sf: 22.47636}}}{space 1}
{space 0}{space 0}{ralign 12:Q9_iqr}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  4.04904}}}{space 1}{space 1}{ralign 9:{res:{sf:  .035048}}}{space 1}{space 1}{ralign 9:{res:{sf: 4.010536}}}{space 1}
{space 0}{space 0}{ralign 12:CPI1y}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 3.014775}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.413239}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.473909}}}{space 1}
{space 0}{space 0}{ralign 12:PCE1y}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.847065}}}{space 1}{space 1}{ralign 9:{res:{sf:  .052896}}}{space 1}{space 1}{ralign 9:{res:{sf:   1.8534}}}{space 1}
{space 0}{space 0}{ralign 12:CORECPI1y}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.971262}}}{space 1}{space 1}{ralign 9:{res:{sf:  .088121}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.004349}}}{space 1}
{space 0}{space 0}{ralign 12:COREPCE1y}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.754005}}}{space 1}{space 1}{ralign 9:{res:{sf:   .06366}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.775755}}}{space 1}
{space 0}{space 0}{ralign 12:CPI_disg}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .5022143}}}{space 1}{space 1}{ralign 9:{res:{sf: .5895967}}}{space 1}{space 1}{ralign 9:{res:{sf: .2933465}}}{space 1}
{space 0}{space 0}{ralign 12:PCE_disg}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .3472125}}}{space 1}{space 1}{ralign 9:{res:{sf: .0503315}}}{space 1}{space 1}{ralign 9:{res:{sf: .2818246}}}{space 1}
{space 0}{space 0}{ralign 12:CORECPI_disg}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  .192936}}}{space 1}{space 1}{ralign 9:{res:{sf: .0294365}}}{space 1}{space 1}{ralign 9:{res:{sf:  .107817}}}{space 1}
{space 0}{space 0}{ralign 12:COREPCE_disg}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .1579588}}}{space 1}{space 1}{ralign 9:{res:{sf: .0229367}}}{space 1}{space 1}{ralign 9:{res:{sf: .1031996}}}{space 1}
{space 0}{space 0}{ralign 12:PRCCPIVar1~n}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0834114}}}{space 1}{space 1}{ralign 9:{res:{sf: .0012811}}}{space 1}{space 1}{ralign 9:{res:{sf: .0802793}}}{space 1}
{space 0}{space 0}{ralign 12:PRCPCEVar1~n}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0798223}}}{space 1}{space 1}{ralign 9:{res:{sf: .0009688}}}{space 1}{space 1}{ralign 9:{res:{sf: .0743354}}}{space 1}

{com}. esttab . using "${c -(}sum_table_folder{c )-}/pop_sum_stats.csv", cells("mean(fmt(a3)) var(fmt(a3)) median(fmt(a3))") replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/pop_sum_stats.csv"'})

{com}. 
. eststo clear
{txt}
{com}. foreach var in Q9_mean Q9_var Q9_disg CPI1y PCE1y CORECPI1y COREPCE1y{c -(}
{txt}  2{com}. gen `var'_ch = `var'-l1.`var'
{txt}  3{com}. label var `var'_ch "m to m+1 change of `var'"
{txt}  4{com}. eststo: reg `var' l(1/5).`var'
{txt}  5{com}. eststo: reg `var'_ch l(1/5).`var'_ch
{txt}  6{com}. corrgram `var', lags(5) 
{txt}  7{com}. *gen `var'1=`r(ac1)'
. *label var `var'1 "Auto-correlation coefficient of `var'"
. {c )-}
{txt}(804 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      48
{txt}{hline 13}{char +}{hline 30}           F(  5,    42) ={res}   33.28
    {txt}   Model {char |} {res}  3.6041347     5   .72082694           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res}    .909823    42  .021662452           {txt}R-squared     = {res} 0.7984
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.7744
    {txt}   Total {char |} {res}  4.5139577    47  .096041653           {txt}Root MSE      = {res} .14718

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     Q9_mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Q9_mean {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .7002046{col 26}{space 2} .1500554{col 37}{space 1}    4.67{col 46}{space 3}0.000{col 54}{space 4} .3973806{col 67}{space 3} 1.003029
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}  .138077{col 26}{space 2} .1756984{col 37}{space 1}    0.79{col 46}{space 3}0.436{col 54}{space 4}-.2164968{col 67}{space 3} .4926508
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}  .110988{col 26}{space 2}   .17627{col 37}{space 1}    0.63{col 46}{space 3}0.532{col 54}{space 4}-.2447393{col 67}{space 3} .4667154
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0461986{col 26}{space 2} .1710849{col 37}{space 1}    0.27{col 46}{space 3}0.788{col 54}{space 4}-.2990646{col 67}{space 3} .3914619
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.1938866{col 26}{space 2} .1303595{col 37}{space 1}   -1.49{col 46}{space 3}0.144{col 54}{space 4}-.4569628{col 67}{space 3} .0691896
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .6945321{col 26}{space 2} .2406462{col 37}{space 1}    2.89{col 46}{space 3}0.006{col 54}{space 4} .2088885{col 67}{space 3} 1.180176
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}      47
{txt}{hline 13}{char +}{hline 30}           F(  5,    41) ={res}    0.15
    {txt}   Model {char |} {res} .020017515     5  .004003503           {txt}Prob > F      = {res} 0.9781
    {txt}Residual {char |} {res} 1.07655616    41  .026257467           {txt}R-squared     = {res} 0.0183
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.1015
    {txt}   Total {char |} {res} 1.09657368    46  .023838558           {txt}Root MSE      = {res} .16204

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  Q9_mean_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}Q9_mean_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} -.089577{col 26}{space 2} .1545401{col 37}{space 1}   -0.58{col 46}{space 3}0.565{col 54}{space 4} -.401677{col 67}{space 3}  .222523
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0122865{col 26}{space 2} .1513746{col 37}{space 1}   -0.08{col 46}{space 3}0.936{col 54}{space 4}-.3179938{col 67}{space 3} .2934207
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .0874955{col 26}{space 2} .1490176{col 37}{space 1}    0.59{col 46}{space 3}0.560{col 54}{space 4}-.2134517{col 67}{space 3} .3884427
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0602004{col 26}{space 2}  .151297{col 37}{space 1}    0.40{col 46}{space 3}0.693{col 54}{space 4}-.2453501{col 67}{space 3} .3657509
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0261676{col 26}{space 2} .1407351{col 37}{space 1}    0.19{col 46}{space 3}0.853{col 54}{space 4}-.2580527{col 67}{space 3}  .310388
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0185639{col 26}{space 2} .0244939{col 37}{space 1}   -0.76{col 46}{space 3}0.453{col 54}{space 4}-.0680304{col 67}{space 3} .0309026
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est2{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.8958{col 18} 0.8959{col 27} 44.981{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} 
{txt}2     {res}{col 9} 0.7989{col 18} 0.0886{col 27} 81.459{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}3     {res}{col 9} 0.6827{col 18}-0.1315{col 27} 108.63{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}       {hline 1}{c RT}        
{txt}4     {res}{col 9} 0.5534{col 18}-0.0963{col 27} 126.85{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}5     {res}{col 9} 0.4175{col 18}-0.1939{col 27} 137.44{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}       {hline 1}{c RT}        
{txt}(804 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      48
{txt}{hline 13}{char +}{hline 30}           F(  5,    42) ={res}    4.05
    {txt}   Model {char |} {res} 21.6109245     5   4.3221849           {txt}Prob > F      = {res} 0.0043
    {txt}Residual {char |} {res} 44.8456916    42  1.06775456           {txt}R-squared     = {res} 0.3252
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.2449
    {txt}   Total {char |} {res} 66.4566161    47  1.41397056           {txt}Root MSE      = {res} 1.0333

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      Q9_var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}Q9_var {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .4364329{col 26}{space 2} .1627549{col 37}{space 1}    2.68{col 46}{space 3}0.010{col 54}{space 4} .1079802{col 67}{space 3} .7648855
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .2576414{col 26}{space 2} .1667149{col 37}{space 1}    1.55{col 46}{space 3}0.130{col 54}{space 4}-.0788029{col 67}{space 3} .5940857
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0063052{col 26}{space 2} .1701657{col 37}{space 1}   -0.04{col 46}{space 3}0.971{col 54}{space 4}-.3497136{col 67}{space 3} .3371031
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.1934819{col 26}{space 2} .1625881{col 37}{space 1}   -1.19{col 46}{space 3}0.241{col 54}{space 4} -.521598{col 67}{space 3} .1346342
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0155717{col 26}{space 2} .1562491{col 37}{space 1}   -0.10{col 46}{space 3}0.921{col 54}{space 4}-.3308952{col 67}{space 3} .2997517
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 8.216641{col 26}{space 2}  2.89492{col 37}{space 1}    2.84{col 46}{space 3}0.007{col 54}{space 4} 2.374456{col 67}{space 3} 14.05883
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est3{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}      47
{txt}{hline 13}{char +}{hline 30}           F(  5,    41) ={res}    2.11
    {txt}   Model {char |} {res} 12.8993162     5  2.57986324           {txt}Prob > F      = {res} 0.0835
    {txt}Residual {char |} {res} 50.1110583    41  1.22222094           {txt}R-squared     = {res} 0.2047
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.1077
    {txt}   Total {char |} {res} 63.0103746    46  1.36979075           {txt}Root MSE      = {res} 1.1055

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Q9_var_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}Q9_var_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} -.444543{col 26}{space 2} .1654094{col 37}{space 1}   -2.69{col 46}{space 3}0.010{col 54}{space 4}-.7785941{col 67}{space 3}-.1104918
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.1072514{col 26}{space 2} .1780868{col 37}{space 1}   -0.60{col 46}{space 3}0.550{col 54}{space 4}-.4669051{col 67}{space 3} .2524022
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.1377249{col 26}{space 2} .1776393{col 37}{space 1}   -0.78{col 46}{space 3}0.443{col 54}{space 4}-.4964747{col 67}{space 3}  .221025
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.2874994{col 26}{space 2} .1670996{col 37}{space 1}   -1.72{col 46}{space 3}0.093{col 54}{space 4}-.6249639{col 67}{space 3} .0499651
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.2607081{col 26}{space 2} .1562131{col 37}{space 1}   -1.67{col 46}{space 3}0.103{col 54}{space 4}-.5761869{col 67}{space 3} .0547707
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0658525{col 26}{space 2} .1646928{col 37}{space 1}   -0.40{col 46}{space 3}0.691{col 54}{space 4}-.3984563{col 67}{space 3} .2667514
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est4{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.4866{col 18} 0.4966{col 27} 13.273{col 36}0.0003{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c LT}{hline 1}{hline 1}{hline 1}     
{txt}2     {res}{col 9} 0.3795{col 18} 0.1692{col 27} 21.505{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c LT}{hline 1}       
{txt}3     {res}{col 9} 0.2395{col 18}-0.0195{col 27}  24.85{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}4     {res}{col 9} 0.0447{col 18}-0.2050{col 27} 24.969{col 36}0.0001{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}5     {res}{col 9} 0.0064{col 18}-0.0156{col 27} 24.971{col 36}0.0001{col 44}        {c |}        {col 63}        {c |}        
{txt}(804 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}      48
{txt}{hline 13}{char +}{hline 30}           F(  5,    42) ={res}   11.34
    {txt}   Model {char |} {res} 218.698873     5  43.7397746           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 161.997959    42  3.85709427           {txt}R-squared     = {res} 0.5745
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.5238
    {txt}   Total {char |} {res} 380.696832    47   8.0999326           {txt}Root MSE      = {res} 1.9639

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     Q9_disg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Q9_disg {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .6647664{col 26}{space 2} .1523718{col 37}{space 1}    4.36{col 46}{space 3}0.000{col 54}{space 4} .3572676{col 67}{space 3} .9722652
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}  .149516{col 26}{space 2}  .183926{col 37}{space 1}    0.81{col 46}{space 3}0.421{col 54}{space 4}-.2216617{col 67}{space 3} .5206936
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0722622{col 26}{space 2} .1828113{col 37}{space 1}   -0.40{col 46}{space 3}0.695{col 54}{space 4}-.4411904{col 67}{space 3}  .296666
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.0244759{col 26}{space 2} .1823481{col 37}{space 1}   -0.13{col 46}{space 3}0.894{col 54}{space 4}-.3924693{col 67}{space 3} .3435175
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0276872{col 26}{space 2} .1447739{col 37}{space 1}   -0.19{col 46}{space 3}0.849{col 54}{space 4}-.3198528{col 67}{space 3} .2644784
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 6.962912{col 26}{space 2} 2.730241{col 37}{space 1}    2.55{col 46}{space 3}0.014{col 54}{space 4} 1.453062{col 67}{space 3} 12.47276
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est5{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}      47
{txt}{hline 13}{char +}{hline 30}           F(  5,    41) ={res}    0.71
    {txt}   Model {char |} {res} 15.8575643     5  3.17151285           {txt}Prob > F      = {res} 0.6196
    {txt}Residual {char |} {res} 183.243004    41  4.46934157           {txt}R-squared     = {res} 0.0796
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0326
    {txt}   Total {char |} {res} 199.100568    46  4.32827323           {txt}Root MSE      = {res} 2.1141

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  Q9_disg_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}Q9_disg_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.2147845{col 26}{space 2} .1546577{col 37}{space 1}   -1.39{col 46}{space 3}0.172{col 54}{space 4}-.5271219{col 67}{space 3}  .097553
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0167089{col 26}{space 2} .1557396{col 37}{space 1}   -0.11{col 46}{space 3}0.915{col 54}{space 4}-.3312314{col 67}{space 3} .2978137
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.1230984{col 26}{space 2} .1551497{col 37}{space 1}   -0.79{col 46}{space 3}0.432{col 54}{space 4}-.4364297{col 67}{space 3} .1902328
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.1693851{col 26}{space 2} .1526567{col 37}{space 1}   -1.11{col 46}{space 3}0.274{col 54}{space 4}-.4776817{col 67}{space 3} .1389114
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0994521{col 26}{space 2} .1458706{col 37}{space 1}   -0.68{col 46}{space 3}0.499{col 54}{space 4}-.3940438{col 67}{space 3} .1951397
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.2880364{col 26}{space 2} .3150805{col 37}{space 1}   -0.91{col 46}{space 3}0.366{col 54}{space 4}-.9243544{col 67}{space 3} .3482816
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est6{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.7766{col 18} 0.7823{col 27} 33.805{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  
{txt}2     {res}{col 9} 0.6056{col 18} 0.0173{col 27} 54.764{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}3     {res}{col 9} 0.4154{col 18}-0.1418{col 27} 64.822{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}       {hline 1}{c RT}        
{txt}4     {res}{col 9} 0.2550{col 18}-0.0798{col 27}  68.69{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c |}        
{txt}5     {res}{col 9} 0.1286{col 18}-0.0277{col 27} 69.694{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}(404 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}     448
{txt}{hline 13}{char +}{hline 30}           F(  5,   442) ={res} 3695.07
    {txt}   Model {char |} {res} 513.285482     5  102.657096           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 12.2797331   442  .027782202           {txt}R-squared     = {res} 0.9766
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.9764
    {txt}   Total {char |} {res} 525.565215   447  1.17576111           {txt}Root MSE      = {res} .16668

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       CPI1y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}CPI1y {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .9487661{col 26}{space 2} .0475027{col 37}{space 1}   19.97{col 46}{space 3}0.000{col 54}{space 4} .8554069{col 67}{space 3} 1.042125
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0004946{col 26}{space 2}  .065499{col 37}{space 1}    0.01{col 46}{space 3}0.994{col 54}{space 4}-.1282335{col 67}{space 3} .1292227
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0369137{col 26}{space 2} .0654843{col 37}{space 1}   -0.56{col 46}{space 3}0.573{col 54}{space 4} -.165613{col 67}{space 3} .0917856
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0349571{col 26}{space 2} .0655158{col 37}{space 1}    0.53{col 46}{space 3}0.594{col 54}{space 4} -.093804{col 67}{space 3} .1637182
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0196535{col 26}{space 2} .0465697{col 37}{space 1}    0.42{col 46}{space 3}0.673{col 54}{space 4} -.071872{col 67}{space 3} .1111791
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0847356{col 26}{space 2} .0226366{col 37}{space 1}    3.74{col 46}{space 3}0.000{col 54}{space 4} .0402469{col 67}{space 3} .1292244
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est7{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}     447
{txt}{hline 13}{char +}{hline 30}           F(  5,   441) ={res}    0.17
    {txt}   Model {char |} {res} .024480508     5  .004896102           {txt}Prob > F      = {res} 0.9743
    {txt}Residual {char |} {res} 12.8690856   441    .0291816           {txt}R-squared     = {res} 0.0019
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0094
    {txt}   Total {char |} {res} 12.8935661   446  .028909341           {txt}Root MSE      = {res} .17083

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    CPI1y_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}CPI1y_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0056989{col 26}{space 2} .0476183{col 37}{space 1}   -0.12{col 46}{space 3}0.905{col 54}{space 4}-.0992859{col 67}{space 3}  .087888
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0056989{col 26}{space 2} .0476183{col 37}{space 1}   -0.12{col 46}{space 3}0.905{col 54}{space 4}-.0992859{col 67}{space 3}  .087888
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0422757{col 26}{space 2} .0475849{col 37}{space 1}   -0.89{col 46}{space 3}0.375{col 54}{space 4} -.135797{col 67}{space 3} .0512456
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.0056409{col 26}{space 2} .0476267{col 37}{space 1}   -0.12{col 46}{space 3}0.906{col 54}{space 4}-.0992444{col 67}{space 3} .0879626
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0056409{col 26}{space 2} .0476267{col 37}{space 1}   -0.12{col 46}{space 3}0.906{col 54}{space 4}-.0992444{col 67}{space 3} .0879626
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0130176{col 26}{space 2} .0081879{col 37}{space 1}   -1.59{col 46}{space 3}0.113{col 54}{space 4}-.0291098{col 67}{space 3} .0030746
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est8{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.9718{col 18} 0.9727{col 27} 430.69{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} 
{txt}2     {res}{col 9} 0.9437{col 18} 0.0152{col 27} 837.68{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}3     {res}{col 9} 0.9155{col 18} 0.0159{col 27} 1221.6{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}4     {res}{col 9} 0.8883{col 18} 0.0537{col 27} 1583.8{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}5     {res}{col 9} 0.8611{col 18} 0.0197{col 27}   1925{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}(710 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}     142
{txt}{hline 13}{char +}{hline 30}           F(  5,   136) ={res}  206.10
    {txt}   Model {char |} {res} 6.41405464     5  1.28281093           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} .846479884   136  .006224117           {txt}R-squared     = {res} 0.8834
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.8791
    {txt}   Total {char |} {res} 7.26053453   141  .051493153           {txt}Root MSE      = {res} .07889

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       PCE1y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}PCE1y {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .9394433{col 26}{space 2} .0855919{col 37}{space 1}   10.98{col 46}{space 3}0.000{col 54}{space 4} .7701801{col 67}{space 3} 1.108707
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0126207{col 26}{space 2} .1163999{col 37}{space 1}    0.11{col 46}{space 3}0.914{col 54}{space 4}-.2175671{col 67}{space 3} .2428086
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .2024647{col 26}{space 2} .1151489{col 37}{space 1}    1.76{col 46}{space 3}0.081{col 54}{space 4}-.0252493{col 67}{space 3} .4301787
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} -.189108{col 26}{space 2}  .116485{col 37}{space 1}   -1.62{col 46}{space 3}0.107{col 54}{space 4}-.4194642{col 67}{space 3} .0412481
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0586027{col 26}{space 2} .0854857{col 37}{space 1}   -0.69{col 46}{space 3}0.494{col 54}{space 4}-.2276559{col 67}{space 3} .1104506
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1706981{col 26}{space 2} .0582263{col 37}{space 1}    2.93{col 46}{space 3}0.004{col 54}{space 4}  .055552{col 67}{space 3} .2858442
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est9{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}     141
{txt}{hline 13}{char +}{hline 30}           F(  5,   135) ={res}    1.14
    {txt}   Model {char |} {res} .038004833     5  .007600967           {txt}Prob > F      = {res} 0.3429
    {txt}Residual {char |} {res}  .90100516   135  .006674112           {txt}R-squared     = {res} 0.0405
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0049
    {txt}   Total {char |} {res} .939009993   140  .006707214           {txt}Root MSE      = {res}  .0817

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    PCE1y_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}PCE1y_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0000432{col 26}{space 2} .0860663{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-.1702559{col 67}{space 3} .1701694
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0000432{col 26}{space 2} .0860663{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-.1702559{col 67}{space 3} .1701694
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .2012946{col 26}{space 2} .0843547{col 37}{space 1}    2.39{col 46}{space 3}0.018{col 54}{space 4} .0344669{col 67}{space 3} .3681223
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} 5.35e-06{col 26}{space 2} .0861154{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-.1703045{col 67}{space 3} .1703152
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} 5.35e-06{col 26}{space 2} .0861154{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-.1703045{col 67}{space 3} .1703152
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0005257{col 26}{space 2} .0068803{col 37}{space 1}   -0.08{col 46}{space 3}0.939{col 54}{space 4}-.0141328{col 67}{space 3} .0130814
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est10{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.9301{col 18} 0.9370{col 27} 129.78{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} 
{txt}2     {res}{col 9} 0.8602{col 18}-0.0319{col 27} 241.54{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}3     {res}{col 9} 0.7903{col 18}-0.0333{col 27} 336.53{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}4     {res}{col 9} 0.6936{col 18}-0.2446{col 27} 410.21{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}       {hline 1}{c RT}        
{txt}5     {res}{col 9} 0.5969{col 18}-0.0586{col 27} 465.16{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}(710 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}     142
{txt}{hline 13}{char +}{hline 30}           F(  5,   136) ={res}  319.01
    {txt}   Model {char |} {res} 11.3613907     5  2.27227814           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} .968724524   136  .007122974           {txt}R-squared     = {res} 0.9214
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.9185
    {txt}   Total {char |} {res} 12.3301152   141  .087447626           {txt}Root MSE      = {res}  .0844

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   CORECPI1y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}CORECPI1y {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .9687769{col 26}{space 2} .0857075{col 37}{space 1}   11.30{col 46}{space 3}0.000{col 54}{space 4} .7992852{col 67}{space 3} 1.138269
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0046497{col 26}{space 2} .1187869{col 37}{space 1}    0.04{col 46}{space 3}0.969{col 54}{space 4}-.2302585{col 67}{space 3}  .239558
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1409678{col 26}{space 2} .1182289{col 37}{space 1}    1.19{col 46}{space 3}0.235{col 54}{space 4}-.0928371{col 67}{space 3} .3747727
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.1358003{col 26}{space 2} .1188949{col 37}{space 1}   -1.14{col 46}{space 3}0.255{col 54}{space 4}-.3709222{col 67}{space 3} .0993216
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0313043{col 26}{space 2} .0857868{col 37}{space 1}   -0.36{col 46}{space 3}0.716{col 54}{space 4}-.2009529{col 67}{space 3} .1383443
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1030815{col 26}{space 2} .0498584{col 37}{space 1}    2.07{col 46}{space 3}0.041{col 54}{space 4} .0044834{col 67}{space 3} .2016796
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est11{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}     141
{txt}{hline 13}{char +}{hline 30}           F(  5,   135) ={res}    0.54
    {txt}   Model {char |} {res} .020008671     5  .004001734           {txt}Prob > F      = {res} 0.7455
    {txt}Residual {char |} {res} .999938259   135   .00740695           {txt}R-squared     = {res} 0.0196
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0167
    {txt}   Total {char |} {res} 1.01994693   140  .007285335           {txt}Root MSE      = {res} .08606

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}CORECPI1y_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
CORECPI1y_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-7.66e-06{col 26}{space 2} .0860663{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-.1702203{col 67}{space 3}  .170205
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-7.66e-06{col 26}{space 2} .0860663{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-.1702203{col 67}{space 3}  .170205
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1401844{col 26}{space 2} .0852924{col 37}{space 1}    1.64{col 46}{space 3}0.103{col 54}{space 4}-.0284977{col 67}{space 3} .3088664
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} 8.37e-06{col 26}{space 2} .0861415{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4} -.170353{col 67}{space 3} .1703697
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} 8.37e-06{col 26}{space 2} .0861415{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4} -.170353{col 67}{space 3} .1703697
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0002331{col 26}{space 2}  .007248{col 37}{space 1}   -0.03{col 46}{space 3}0.974{col 54}{space 4}-.0145674{col 67}{space 3} .0141013
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est12{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.9529{col 18} 0.9597{col 27} 136.23{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} 
{txt}2     {res}{col 9} 0.9059{col 18}-0.0205{col 27} 260.18{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}3     {res}{col 9} 0.8588{col 18}-0.0211{col 27} 372.37{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}4     {res}{col 9} 0.7992{col 18}-0.1660{col 27}  470.2{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}       {hline 1}{c RT}        
{txt}5     {res}{col 9} 0.7396{col 18}-0.0313{col 27} 554.57{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}(710 missing values generated)

      Source {c |}       SS       df       MS              Number of obs ={res}     142
{txt}{hline 13}{char +}{hline 30}           F(  5,   136) ={res}  302.17
    {txt}   Model {char |} {res} 8.09955465     5  1.61991093           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res}  .72907729   136  .005360862           {txt}R-squared     = {res} 0.9174
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.9144
    {txt}   Total {char |} {res} 8.82863194   141  .062614411           {txt}Root MSE      = {res} .07322

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   COREPCE1y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}COREPCE1y {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .9596465{col 26}{space 2} .0856794{col 37}{space 1}   11.20{col 46}{space 3}0.000{col 54}{space 4} .7902102{col 67}{space 3} 1.129083
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0088441{col 26}{space 2} .1177059{col 37}{space 1}    0.08{col 46}{space 3}0.940{col 54}{space 4}-.2239265{col 67}{space 3} .2416148
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1941615{col 26}{space 2} .1168823{col 37}{space 1}    1.66{col 46}{space 3}0.099{col 54}{space 4}-.0369803{col 67}{space 3} .4253033
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.1837513{col 26}{space 2} .1184022{col 37}{space 1}   -1.55{col 46}{space 3}0.123{col 54}{space 4}-.4178988{col 67}{space 3} .0503962
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0409629{col 26}{space 2} .0861806{col 37}{space 1}   -0.48{col 46}{space 3}0.635{col 54}{space 4}-.2113903{col 67}{space 3} .1294644
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1076461{col 26}{space 2} .0456941{col 37}{space 1}    2.36{col 46}{space 3}0.020{col 54}{space 4} .0172833{col 67}{space 3} .1980089
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est13{txt} stored)

      Source {c |}       SS       df       MS              Number of obs ={res}     141
{txt}{hline 13}{char +}{hline 30}           F(  5,   135) ={res}    1.02
    {txt}   Model {char |} {res} .028604922     5  .005720984           {txt}Prob > F      = {res} 0.4104
    {txt}Residual {char |} {res} .759690897   135   .00562734           {txt}R-squared     = {res} 0.0363
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0006
    {txt}   Total {char |} {res}  .78829582   140  .005630684           {txt}Root MSE      = {res} .07502

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}COREPCE1y_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
COREPCE1y_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0000584{col 26}{space 2} .0860663{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4} -.170271{col 67}{space 3} .1701543
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0000584{col 26}{space 2} .0860663{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4} -.170271{col 67}{space 3} .1701543
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1915363{col 26}{space 2} .0849537{col 37}{space 1}    2.25{col 46}{space 3}0.026{col 54}{space 4}  .023524{col 67}{space 3} .3595487
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0000694{col 26}{space 2} .0865383{col 37}{space 1}    0.00{col 46}{space 3}0.999{col 54}{space 4}-.1710768{col 67}{space 3} .1712156
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0000694{col 26}{space 2} .0865383{col 37}{space 1}    0.00{col 46}{space 3}0.999{col 54}{space 4}-.1710768{col 67}{space 3} .1712156
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0005609{col 26}{space 2} .0063184{col 37}{space 1}   -0.09{col 46}{space 3}0.929{col 54}{space 4}-.0130567{col 67}{space 3} .0119349
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est14{txt} stored)

{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.9495{col 18} 0.9566{col 27} 135.26{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} 
{txt}2     {res}{col 9} 0.8991{col 18}-0.0221{col 27} 257.36{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}3     {res}{col 9} 0.8486{col 18}-0.0228{col 27}  366.9{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}4     {res}{col 9} 0.7779{col 18}-0.2230{col 27} 459.59{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}       {hline 1}{c RT}        
{txt}5     {res}{col 9} 0.7072{col 18}-0.0410{col 27} 536.74{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}
{com}. esttab using "${c -(}sum_table_folder{c )-}/autoreg.csv", se r2 replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/autoreg.csv"'})

{com}. eststo clear
{txt}
{com}. */
. 
. ****************************************
. **** Quarterly Level Analysis  ******
. ****************************************
. 
. *******************************************
. ***  Collapse monthly data to quarterly  **
. *******************************************
. 
. local SCESPFMom Q9_mean Q9_var Q9_disg Q9_iqr CPI1y PCE1y CORECPI1y InfExpMichMed ///
>                 COREPCE1y CPI_disg PCE_disg CORECPI_disg COREPCE_disg SCE_FE SPFCPI_FE SPFCCPI_FE SPFPCE_FE ///
>                                 PRCCPIVar1mean PRCPCEVar1mean PRCCPIVar0mean PRCPCEVar0mean
{txt}
{com}.                                 
. local MomentsMom PRCCPIMean0p25 PRCCPIMean1p25 PRCPCEMean0p25 PRCPCEMean1p25 /// 
>               PRCCPIVar0p25 PRCCPIVar1p25 PRCPCEVar0p25 PRCPCEVar1p25 ///
>                           PRCCPIMean0p50 PRCCPIMean1p50 PRCPCEMean0p50 PRCPCEMean1p50 /// 
>               PRCCPIVar0p50 PRCCPIVar1p50 PRCPCEVar0p50 PRCPCEVar1p50 ///
>                           PRCCPIMean0p75 PRCCPIMean1p75 PRCPCEMean0p75 PRCPCEMean1p75 /// 
>               PRCCPIVar0p75 PRCCPIVar1p75 PRCPCEVar0p75 PRCPCEVar1p75
{txt}
{com}. 
. 
. collapse (mean) `SCESPFMom' `MomentsMom', ///
>                                 by(year quarter) 
{txt}
{com}. 
. gen date2=string(year)+"Q"+string(quarter)
{txt}
{com}. gen date3= quarterly(date2,"YQ")
{txt}(1 missing value generated)

{com}. format date3 %tq 
{txt}
{com}. drop date2 
{txt}
{com}. rename date3 date
{res}{txt}
{com}. 
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1948q1 to 2019q1
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. sort year quarter  
{txt}
{com}. 
. order date year quarter 
{txt}
{com}. 
. 
. 
. /*
> ******************************************
> *** Multiple series charts Quarterly  ****
> *******************************************
> drop if CPI1y ==. | PCE1y==.
> 
> 
> 
> twoway (tsline Q9_mean) (tsline InfExpMichMed, lp("dash_dot")) ///
>        (tsline CPI1y, lp("shortdash")) (tsline PCE1y, lp("dash")), ///
>                                                  title("1-yr-ahead Expected Inflation") ///
>                                                  xtitle("Time") ytitle("") ///
>                                                  legend(label(1 "Mean Expectation(SCE)") ///
>                                                         label(2 "Median Expectation(Michigan)") ///
>                                                                 label(3 "Mean Expectation CPI (SPF)") ///
>                                                                 label(4 "Mean Expectation PCE (SPF)") col(1))
> graph export "${c -(}sum_graph_folder{c )-}/mean_medQ", as(png) replace
> 
> 
> twoway (tsline Q9_disg, ytitle(" ",axis(1))) ///
>        (tsline CORECPI_disg,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if CORECPI_disg!=., ///
>            title("Disagreements in 1-yr-ahead Inflation") xtitle("Time") ///
>            legend(label(1 "Disagreements (SCE)") label(2 "Disagreements(SPF)(RHS)"))
> graph export "${c -(}sum_graph_folder{c )-}/disg_disgQ", as(png) replace 
> 
> 
> twoway (tsline Q9_var, ytitle(" ",axis(1)) lp("solid") ) ///
>        (tsline PRCCPIVar1mean, yaxis(2) ytitle("",axis(2)) lp("shortdash")) ///
>            (tsline PRCPCEVar1mean, yaxis(2) ytitle("",axis(2)) lp("dash_dot")) ///
>            if Q9_var!=., ///
>            title("Uncertainty in 1-yr-ahead Inflation") xtitle("Time") ///
>            legend(label(1 "Uncertainty (SCE)")  /// 
>                   label(2 "Uncertainty (SPF CPI)(RHS)") ///
>                           label(3 "Uncertainty (SPF PCE)(RHS)") col(1)) 
>                           
> graph export "${c -(}sum_graph_folder{c )-}/var_varQ", as(png) replace 
> 
> 
> twoway (tsline SCE_FE)  (tsline SPFCPI_FE, yaxis(2) lp("dash")) ///
>         (tsline SPFPCE_FE, yaxis(2) lp("dash_dot")) ///
>                          if SPFCPI_FE!=., ///
>                                                  title("1-yr-ahead Forecast Errors") ///
>                                                  xtitle("Time") ytitle("") ///
>                                                  legend(col(1) label(1 "SCE") label(2 "SPF CPI (RHS)") ///
>                                                                 label(3 "SPF PCE(RHS)"))
> graph export "${c -(}sum_graph_folder{c )-}/fe_feQ", as(png) replace
> 
> */
. 
. 
. twoway (tsline PRCCPIVar1p25, ytitle(" ",axis(1)) lp("dash")) ///
>        (tsline PRCCPIVar1p75, ytitle(" ",axis(1)) lp("dash")) ///
>            (tsline PRCCPIVar1p50, ytitle(" ",axis(1)) lp("solid") ) ///
>            if PRCCPIVar1p25!=. , /// 
>            title("1-yr-ahead Expected Inflation(SPF CPI)") xtitle("Time") ///
>            legend(label(1 "25 percentile of uncertainty") label(2 "75 percentile of uncertainty") ///
>                   label(3 "50 percentile of uncertainty")) 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/IQRvarCPIQ", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/ExpProject/workingfolder/graphs/pop/IQRvarCPIQ written in PNG format)

{com}. 
. 
. twoway (tsline PRCPCEVar1p25, ytitle(" ",axis(1)) lp("dash")) ///
>        (tsline PRCPCEVar1p75, ytitle(" ",axis(1)) lp("dash")) ///
>            (tsline PRCPCEVar1p50, ytitle(" ",axis(1)) lp("solid") ) ///
>            if PRCPCEVar1p25!=. , ///
>            title("1-yr-ahead Expected Inflation(SPF PCE)") xtitle("Time") ///
>            legend(label(1 "25 percentile of uncertainty") label(2 "75 percentile of uncertainty") ///
>                   label(3 "50 percentile of uncertainty")) 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/IQRvarPCEQ", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/ExpProject/workingfolder/graphs/pop/IQRvarPCEQ written in PNG format)

{com}. 
. 
. ********************************
. ***  Autoregression Quarterly **
. *******************************
. 
. tsset date 
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1948q1 to 2019q1
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. 
. eststo clear
{txt}
{com}. 
. gen InfExp1y = .
{txt}(286 missing values generated)

{com}. gen InfExpFE1y = .
{txt}(286 missing values generated)

{com}. gen InfExpVar1y=.
{txt}(286 missing values generated)

{com}. gen InfExpDisg1y = .
{txt}(286 missing values generated)

{com}. 
. *****************************************
. ****  Renaming so that more consistent **
. *****************************************
. 
. 
. rename Q9_mean SCE_Mean
{res}{txt}
{com}. rename Q9_var SCE_Var
{res}{txt}
{com}. rename Q9_disg SCE_Disg
{res}{txt}
{com}. rename SCE_FE SCE_FE
{res}{txt}  (all {it:newnames}=={it:oldnames})

{com}. 
. rename CPI1y SPFCPI_Mean
{res}{txt}
{com}. rename PCE1y SPFPCE_Mean
{res}{txt}
{com}. rename COREPCE1y SPFCPCE_Mean
{res}{txt}
{com}. rename CORECPI1y SPFCCPI_Mean
{res}{txt}
{com}. 
. 
. rename CPI_disg SPFCPI_Disg
{res}{txt}
{com}. rename PCE_disg SPFPCE_Disg 
{res}{txt}
{com}. rename CORECPI_disg SPFCCPI_Disg
{res}{txt}
{com}. rename COREPCE_disg SPFCPCE_Disg
{res}{txt}
{com}. 
. rename PRCPCEVar1mean SPFPCE_Var
{res}{txt}
{com}. rename PRCCPIVar1mean SPFCPI_Var
{res}{txt}
{com}. 
. rename SPFCPI_FE SPFCPI_FE
{res}{txt}  (all {it:newnames}=={it:oldnames})

{com}. rename SPFPCE_FE SPFPCE_FE
{res}{txt}  (all {it:newnames}=={it:oldnames})

{com}. 
. gen InfExp_Mean = .
{txt}(286 missing values generated)

{com}. gen InfExp_Var = .
{txt}(286 missing values generated)

{com}. gen InfExp_FE = .
{txt}(286 missing values generated)

{com}. gen InfExp_Disg = . 
{txt}(286 missing values generated)

{com}. 
. 
. gen InfExp_Mean_ch = .
{txt}(286 missing values generated)

{com}. gen InfExp_Var_ch = .
{txt}(286 missing values generated)

{com}. gen InfExp_FE_ch = .
{txt}(286 missing values generated)

{com}. gen InfExp_Disg_ch = . 
{txt}(286 missing values generated)

{com}. 
. 
. foreach mom in Mean Var{c -(}
{txt}  2{com}.   foreach var in PRCCPI PRCPCE{c -(}
{txt}  3{com}.     forval i =0/1{c -(}
{txt}  4{com}.         local lb=substr("`var'",4,3)
{txt}  5{com}.         rename `var'`mom'`i'p25 SPF`lb'`mom'`i'p25
{txt}  6{com}.     rename `var'`mom'`i'p50 SPF`lb'`mom'`i'p50
{txt}  7{com}.         rename `var'`mom'`i'p75 SPF`lb'`mom'`i'p75
{txt}  8{com}.         {c )-}
{txt}  9{com}.    {c )-}
{txt} 10{com}. {c )-}
{res}{txt}
{com}. 
. *******************************************************
. **** Autoregression on the levels of population moments
. ********************************************************
. 
. 
. eststo clear 
{txt}
{com}. foreach mom in Mean Var Disg FE{c -(}
{txt}  2{com}.    foreach var in SCE SPFCPI SPFPCE{c -(}
{txt}  3{com}.     replace InfExp_`mom' = `var'_`mom'
{txt}  4{com}.     eststo `var'_`mom': reg InfExp_`mom' l(3/5).InfExp_`mom', vce(robust)
{txt}  5{com}.   {c )-}
{txt}  6{com}.   
. {c )-}
{txt}(18 real changes made)

Linear regression                                      Number of obs ={res}      13
                                                       {txt}F(  3,     9) ={res}    1.78
                                                       {txt}Prob > F      = {res} 0.2206
                                                       {txt}R-squared     = {res} 0.3046
                                                       {txt}Root MSE      = {res}  .1301

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} InfExp_Mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Mean {c |}
{space 9}L3. {c |}{col 14}{res}{space 2}-.3706936{col 26}{space 2} .2820485{col 37}{space 1}   -1.31{col 46}{space 3}0.221{col 54}{space 4}-1.008732{col 67}{space 3} .2673445
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .3205169{col 26}{space 2} .3789192{col 37}{space 1}    0.85{col 46}{space 3}0.420{col 54}{space 4}-.5366579{col 67}{space 3} 1.177692
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0319587{col 26}{space 2} .2223516{col 37}{space 1}    0.14{col 46}{space 3}0.889{col 54}{space 4}-.4710355{col 67}{space 3}  .534953
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.481013{col 26}{space 2} .5163771{col 37}{space 1}    6.74{col 46}{space 3}0.000{col 54}{space 4} 2.312886{col 67}{space 3} 4.649139
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(151 real changes made)

Linear regression                                      Number of obs ={res}     146
                                                       {txt}F(  3,   142) ={res}  176.91
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.8506
                                                       {txt}Root MSE      = {res}  .3811

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} InfExp_Mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Mean {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .7323387{col 26}{space 2} .1541178{col 37}{space 1}    4.75{col 46}{space 3}0.000{col 54}{space 4} .4276769{col 67}{space 3} 1.037001
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .2441194{col 26}{space 2} .1836777{col 37}{space 1}    1.33{col 46}{space 3}0.186{col 54}{space 4}-.1189767{col 67}{space 3} .6072155
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.1363949{col 26}{space 2} .1602501{col 37}{space 1}   -0.85{col 46}{space 3}0.396{col 54}{space 4}-.4531791{col 67}{space 3} .1803893
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3985641{col 26}{space 2} .0977332{col 37}{space 1}    4.08{col 46}{space 3}0.000{col 54}{space 4} .2053641{col 67}{space 3} .5917642
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(151 real changes made, 102 to missing)

Linear regression                                      Number of obs ={res}      44
                                                       {txt}F(  3,    40) ={res}    0.78
                                                       {txt}Prob > F      = {res} 0.5134
                                                       {txt}R-squared     = {res} 0.0860
                                                       {txt}Root MSE      = {res} .21438

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} InfExp_Mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Mean {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .3162752{col 26}{space 2} .2863607{col 37}{space 1}    1.10{col 46}{space 3}0.276{col 54}{space 4}-.2624814{col 67}{space 3} .8950317
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0044989{col 26}{space 2} .3060529{col 37}{space 1}    0.01{col 46}{space 3}0.988{col 54}{space 4}-.6140571{col 67}{space 3} .6230549
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0950636{col 26}{space 2} .1946466{col 37}{space 1}   -0.49{col 46}{space 3}0.628{col 54}{space 4} -.488459{col 67}{space 3} .2983318
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.402335{col 26}{space 2} .4792193{col 37}{space 1}    2.93{col 46}{space 3}0.006{col 54}{space 4}  .433797{col 67}{space 3} 2.370874
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(18 real changes made)

Linear regression                                      Number of obs ={res}      13
                                                       {txt}F(  3,     9) ={res}    7.01
                                                       {txt}Prob > F      = {res} 0.0099
                                                       {txt}R-squared     = {res} 0.6298
                                                       {txt}Root MSE      = {res} .66665

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  InfExp_Var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}InfExp_Var {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} -.493762{col 26}{space 2} .2068208{col 37}{space 1}   -2.39{col 46}{space 3}0.041{col 54}{space 4}-.9616231{col 67}{space 3} -.025901
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.5803511{col 26}{space 2} .1858943{col 37}{space 1}   -3.12{col 46}{space 3}0.012{col 54}{space 4}-1.000873{col 67}{space 3}-.1598289
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} -.335789{col 26}{space 2} .2049892{col 37}{space 1}   -1.64{col 46}{space 3}0.136{col 54}{space 4}-.7995069{col 67}{space 3} .1279289
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 38.18257{col 26}{space 2} 5.395718{col 37}{space 1}    7.08{col 46}{space 3}0.000{col 54}{space 4}  25.9766{col 67}{space 3} 50.38853
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(49 real changes made)

Linear regression                                      Number of obs ={res}      44
                                                       {txt}F(  3,    40) ={res}    3.98
                                                       {txt}Prob > F      = {res} 0.0142
                                                       {txt}R-squared     = {res} 0.1367
                                                       {txt}Root MSE      = {res} .03479

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  InfExp_Var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}InfExp_Var {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .1312255{col 26}{space 2} .1423889{col 37}{space 1}    0.92{col 46}{space 3}0.362{col 54}{space 4}-.1565532{col 67}{space 3} .4190043
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .3263452{col 26}{space 2} .1510013{col 37}{space 1}    2.16{col 46}{space 3}0.037{col 54}{space 4} .0211603{col 67}{space 3} .6315301
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .1370273{col 26}{space 2} .1392002{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4}-.1443067{col 67}{space 3} .4183613
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0389051{col 26}{space 2} .0152236{col 37}{space 1}    2.56{col 46}{space 3}0.015{col 54}{space 4}  .008137{col 67}{space 3} .0696732
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(49 real changes made)

Linear regression                                      Number of obs ={res}      44
                                                       {txt}F(  3,    40) ={res}    5.84
                                                       {txt}Prob > F      = {res} 0.0021
                                                       {txt}R-squared     = {res} 0.2346
                                                       {txt}Root MSE      = {res} .02873

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  InfExp_Var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}InfExp_Var {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .1343533{col 26}{space 2} .1614106{col 37}{space 1}    0.83{col 46}{space 3}0.410{col 54}{space 4}-.1918698{col 67}{space 3} .4605763
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .4217052{col 26}{space 2} .1728821{col 37}{space 1}    2.44{col 46}{space 3}0.019{col 54}{space 4} .0722976{col 67}{space 3} .7711129
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0951203{col 26}{space 2} .1551542{col 37}{space 1}    0.61{col 46}{space 3}0.543{col 54}{space 4} -.218458{col 67}{space 3} .4086986
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0330806{col 26}{space 2} .0124967{col 37}{space 1}    2.65{col 46}{space 3}0.012{col 54}{space 4} .0078239{col 67}{space 3} .0583374
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(18 real changes made)

Linear regression                                      Number of obs ={res}      13
                                                       {txt}F(  3,     9) ={res}    0.55
                                                       {txt}Prob > F      = {res} 0.6597
                                                       {txt}R-squared     = {res} 0.1762
                                                       {txt}Root MSE      = {res} 2.2662

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} InfExp_Disg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Disg {c |}
{space 9}L3. {c |}{col 14}{res}{space 2}-.3188447{col 26}{space 2} .4351761{col 37}{space 1}   -0.73{col 46}{space 3}0.482{col 54}{space 4}-1.303281{col 67}{space 3} .6655921
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.0157326{col 26}{space 2}  .446769{col 37}{space 1}   -0.04{col 46}{space 3}0.973{col 54}{space 4}-1.026394{col 67}{space 3} .9949291
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.1783815{col 26}{space 2} .3237651{col 37}{space 1}   -0.55{col 46}{space 3}0.595{col 54}{space 4}-.9107889{col 67}{space 3}  .554026
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 34.07911{col 26}{space 2} 10.02217{col 37}{space 1}    3.40{col 46}{space 3}0.008{col 54}{space 4} 11.40739{col 67}{space 3} 56.75083
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(151 real changes made)

Linear regression                                      Number of obs ={res}     146
                                                       {txt}F(  3,   142) ={res}   39.54
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4713
                                                       {txt}Root MSE      = {res} .29686

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} InfExp_Disg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Disg {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .2446932{col 26}{space 2} .1517482{col 37}{space 1}    1.61{col 46}{space 3}0.109{col 54}{space 4}-.0552843{col 67}{space 3} .5446707
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0610596{col 26}{space 2}   .09304{col 37}{space 1}    0.66{col 46}{space 3}0.513{col 54}{space 4}-.1228628{col 67}{space 3}  .244982
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .1843647{col 26}{space 2}   .07347{col 37}{space 1}    2.51{col 46}{space 3}0.013{col 54}{space 4} .0391284{col 67}{space 3} .3296011
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1695882{col 26}{space 2}  .035644{col 37}{space 1}    4.76{col 46}{space 3}0.000{col 54}{space 4} .0991268{col 67}{space 3} .2400496
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(151 real changes made, 102 to missing)

Linear regression                                      Number of obs ={res}      44
                                                       {txt}F(  3,    40) ={res}   32.71
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.6779
                                                       {txt}Root MSE      = {res} .13115

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} InfExp_Disg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Disg {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .7230759{col 26}{space 2} .1486967{col 37}{space 1}    4.86{col 46}{space 3}0.000{col 54}{space 4} .4225488{col 67}{space 3} 1.023603
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .1622424{col 26}{space 2}  .192402{col 37}{space 1}    0.84{col 46}{space 3}0.404{col 54}{space 4}-.2266165{col 67}{space 3} .5511013
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0546004{col 26}{space 2} .1773456{col 37}{space 1}   -0.31{col 46}{space 3}0.760{col 54}{space 4}-.4130293{col 67}{space 3} .3038284
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0299168{col 26}{space 2} .0262986{col 37}{space 1}    1.14{col 46}{space 3}0.262{col 54}{space 4}-.0232347{col 67}{space 3} .0830683
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(17 real changes made)

Linear regression                                      Number of obs ={res}      12
                                                       {txt}F(  3,     8) ={res}    0.57
                                                       {txt}Prob > F      = {res} 0.6525
                                                       {txt}R-squared     = {res} 0.1781
                                                       {txt}Root MSE      = {res}  .2887

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L3. {c |}{col 14}{res}{space 2}-.3526234{col 26}{space 2} .3910765{col 37}{space 1}   -0.90{col 46}{space 3}0.394{col 54}{space 4}-1.254447{col 67}{space 3} .5492006
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}  .179214{col 26}{space 2} .5337043{col 37}{space 1}    0.34{col 46}{space 3}0.746{col 54}{space 4} -1.05151{col 67}{space 3} 1.409938
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.1567124{col 26}{space 2} .3451253{col 37}{space 1}   -0.45{col 46}{space 3}0.662{col 54}{space 4}-.9525727{col 67}{space 3} .6391478
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.901514{col 26}{space 2} .4104865{col 37}{space 1}    4.63{col 46}{space 3}0.002{col 54}{space 4} .9549303{col 67}{space 3} 2.848097
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(147 real changes made)

Linear regression                                      Number of obs ={res}     142
                                                       {txt}F(  3,   138) ={res}    1.80
                                                       {txt}Prob > F      = {res} 0.1500
                                                       {txt}R-squared     = {res} 0.0838
                                                       {txt}Root MSE      = {res} 1.0634

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .4268251{col 26}{space 2} .1878621{col 37}{space 1}    2.27{col 46}{space 3}0.025{col 54}{space 4} .0553648{col 67}{space 3} .7982854
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.4886237{col 26}{space 2} .2230418{col 37}{space 1}   -2.19{col 46}{space 3}0.030{col 54}{space 4}-.9296451{col 67}{space 3}-.0476024
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}   .18784{col 26}{space 2} .1055526{col 37}{space 1}    1.78{col 46}{space 3}0.077{col 54}{space 4}-.0208695{col 67}{space 3} .3965494
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  .190633{col 26}{space 2} .1031988{col 37}{space 1}    1.85{col 46}{space 3}0.067{col 54}{space 4}-.0134224{col 67}{space 3} .3946883
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(147 real changes made, 102 to missing)

Linear regression                                      Number of obs ={res}      40
                                                       {txt}F(  3,    36) ={res}    0.93
                                                       {txt}Prob > F      = {res} 0.4385
                                                       {txt}R-squared     = {res} 0.1178
                                                       {txt}Root MSE      = {res} .92785

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .3074246{col 26}{space 2} .3745142{col 37}{space 1}    0.82{col 46}{space 3}0.417{col 54}{space 4}-.4521254{col 67}{space 3} 1.066975
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.6004535{col 26}{space 2} .4577797{col 37}{space 1}   -1.31{col 46}{space 3}0.198{col 54}{space 4}-1.528874{col 67}{space 3} .3279667
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .1966994{col 26}{space 2} .2464128{col 37}{space 1}    0.80{col 46}{space 3}0.430{col 54}{space 4} -.303049{col 67}{space 3} .6964478
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3732659{col 26}{space 2} .1981123{col 37}{space 1}    1.88{col 46}{space 3}0.068{col 54}{space 4}-.0285245{col 67}{space 3} .7750564
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/autoregLvlQ.csv", mtitles se r2 replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/autoregLvlQ.csv"'})

{com}. 
. 
. **********************************************************************
. ******** Autoregression on the first difference of population moments
.  **********************************************************************
. 
. eststo clear
{txt}
{com}. foreach mom in Mean Var Disg FE{c -(}
{txt}  2{com}.    foreach var in SCE SPFCPI SPFPCE{c -(}
{txt}  3{com}.     replace InfExp_`mom' = `var'_`mom'
{txt}  4{com}.     replace InfExp_`mom'_ch = InfExp_`mom'-l1.InfExp_`mom'
{txt}  5{com}.     eststo `var'_`mom': reg InfExp_`mom'_ch l(1/4).InfExp_`mom'_ch, vce(robust)
{txt}  6{com}.   {c )-}
{txt}  7{com}. {c )-}
{txt}(49 real changes made, 31 to missing)
(17 real changes made)

Linear regression                                      Number of obs ={res}      13
                                                       {txt}F(  4,     8) ={res}    1.96
                                                       {txt}Prob > F      = {res} 0.1944
                                                       {txt}R-squared     = {res} 0.2864
                                                       {txt}Root MSE      = {res} .15148

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}InfExp_Mean_ch{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Mean_ch {c |}
{space 11}L1. {c |}{col 16}{res}{space 2}  .184748{col 28}{space 2} .2030582{col 39}{space 1}    0.91{col 48}{space 3}0.390{col 56}{space 4}-.2835051{col 69}{space 3} .6530012
{txt}{space 11}L2. {c |}{col 16}{res}{space 2}-.1651187{col 28}{space 2} .3417709{col 39}{space 1}   -0.48{col 48}{space 3}0.642{col 56}{space 4}-.9532438{col 69}{space 3} .6230065
{txt}{space 11}L3. {c |}{col 16}{res}{space 2}-.1369495{col 28}{space 2} .2051663{col 39}{space 1}   -0.67{col 48}{space 3}0.523{col 56}{space 4}-.6100638{col 69}{space 3} .3361648
{txt}{space 11}L4. {c |}{col 16}{res}{space 2}   .23674{col 28}{space 2} .3464954{col 39}{space 1}    0.68{col 48}{space 3}0.514{col 56}{space 4}-.5622798{col 69}{space 3}  1.03576
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2} .0085272{col 28}{space 2} .0818876{col 39}{space 1}    0.10{col 48}{space 3}0.920{col 56}{space 4}-.1803059{col 69}{space 3} .1973603
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(151 real changes made)
(150 real changes made)

Linear regression                                      Number of obs ={res}     146
                                                       {txt}F(  4,   141) ={res}    2.37
                                                       {txt}Prob > F      = {res} 0.0550
                                                       {txt}R-squared     = {res} 0.0887
                                                       {txt}Root MSE      = {res} .26414

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}InfExp_Mean_ch{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Mean_ch {c |}
{space 11}L1. {c |}{col 16}{res}{space 2}-.1371639{col 28}{space 2}  .094666{col 39}{space 1}   -1.45{col 48}{space 3}0.150{col 56}{space 4}-.3243121{col 69}{space 3} .0499844
{txt}{space 11}L2. {c |}{col 16}{res}{space 2}-.0964521{col 28}{space 2} .0844916{col 39}{space 1}   -1.14{col 48}{space 3}0.256{col 56}{space 4}-.2634862{col 69}{space 3}  .070582
{txt}{space 11}L3. {c |}{col 16}{res}{space 2} .0769061{col 28}{space 2} .1103019{col 39}{space 1}    0.70{col 48}{space 3}0.487{col 56}{space 4}-.1411532{col 69}{space 3} .2949653
{txt}{space 11}L4. {c |}{col 16}{res}{space 2} .2198604{col 28}{space 2} .1461659{col 39}{space 1}    1.50{col 48}{space 3}0.135{col 56}{space 4}-.0690995{col 69}{space 3} .5088203
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2}-.0193076{col 28}{space 2} .0215354{col 39}{space 1}   -0.90{col 48}{space 3}0.371{col 56}{space 4}-.0618816{col 69}{space 3} .0232664
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(151 real changes made, 102 to missing)
(150 real changes made, 102 to missing)

Linear regression                                      Number of obs ={res}      44
                                                       {txt}F(  4,    39) ={res}    1.80
                                                       {txt}Prob > F      = {res} 0.1478
                                                       {txt}R-squared     = {res} 0.1598
                                                       {txt}Root MSE      = {res} .13993

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}InfExp_Mean_ch{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Mean_ch {c |}
{space 11}L1. {c |}{col 16}{res}{space 2} .2745276{col 28}{space 2} .2175135{col 39}{space 1}    1.26{col 48}{space 3}0.214{col 56}{space 4} -.165435{col 69}{space 3} .7144902
{txt}{space 11}L2. {c |}{col 16}{res}{space 2}-.3419512{col 28}{space 2} .1788466{col 39}{space 1}   -1.91{col 48}{space 3}0.063{col 56}{space 4}-.7037026{col 69}{space 3} .0198002
{txt}{space 11}L3. {c |}{col 16}{res}{space 2}-.0122134{col 28}{space 2} .1533882{col 39}{space 1}   -0.08{col 48}{space 3}0.937{col 56}{space 4}-.3224703{col 69}{space 3} .2980434
{txt}{space 11}L4. {c |}{col 16}{res}{space 2} .0080741{col 28}{space 2} .1458253{col 39}{space 1}    0.06{col 48}{space 3}0.956{col 56}{space 4}-.2868854{col 69}{space 3} .3030336
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2}-.0041388{col 28}{space 2} .0211893{col 39}{space 1}   -0.20{col 48}{space 3}0.846{col 56}{space 4}-.0469982{col 69}{space 3} .0387206
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(49 real changes made, 31 to missing)
(17 real changes made)

Linear regression                                      Number of obs ={res}      13
                                                       {txt}F(  4,     8) ={res}    1.49
                                                       {txt}Prob > F      = {res} 0.2912
                                                       {txt}R-squared     = {res} 0.4279
                                                       {txt}Root MSE      = {res} 1.0298

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}InfExp_Var_ch{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_ch {c |}
{space 10}L1. {c |}{col 15}{res}{space 2}-.3137133{col 27}{space 2} .2587982{col 38}{space 1}   -1.21{col 47}{space 3}0.260{col 55}{space 4}-.9105029{col 68}{space 3} .2830763
{txt}{space 10}L2. {c |}{col 15}{res}{space 2} -.113523{col 27}{space 2} .2380956{col 38}{space 1}   -0.48{col 47}{space 3}0.646{col 55}{space 4}-.6625725{col 68}{space 3} .4355265
{txt}{space 10}L3. {c |}{col 15}{res}{space 2}-.2354157{col 27}{space 2} .2763591{col 38}{space 1}   -0.85{col 47}{space 3}0.419{col 55}{space 4} -.872701{col 68}{space 3} .4018696
{txt}{space 10}L4. {c |}{col 15}{res}{space 2} -.499074{col 27}{space 2} .2372716{col 38}{space 1}   -2.10{col 47}{space 3}0.069{col 55}{space 4}-1.046223{col 68}{space 3} .0480754
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2}-.2468757{col 27}{space 2} .2822898{col 38}{space 1}   -0.87{col 47}{space 3}0.407{col 55}{space 4}-.8978372{col 68}{space 3} .4040858
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(49 real changes made)
(48 real changes made)

Linear regression                                      Number of obs ={res}      44
                                                       {txt}F(  4,    39) ={res}   11.87
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.3837
                                                       {txt}Root MSE      = {res} .03584

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}InfExp_Var_ch{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_ch {c |}
{space 10}L1. {c |}{col 15}{res}{space 2}-.8551027{col 27}{space 2} .1551354{col 38}{space 1}   -5.51{col 47}{space 3}0.000{col 55}{space 4}-1.168894{col 68}{space 3}-.5413117
{txt}{space 10}L2. {c |}{col 15}{res}{space 2} -.780344{col 27}{space 2}  .184571{col 38}{space 1}   -4.23{col 47}{space 3}0.000{col 55}{space 4}-1.153674{col 68}{space 3} -.407014
{txt}{space 10}L3. {c |}{col 15}{res}{space 2}-.5561795{col 27}{space 2} .1884167{col 38}{space 1}   -2.95{col 47}{space 3}0.005{col 55}{space 4}-.9372882{col 68}{space 3}-.1750708
{txt}{space 10}L4. {c |}{col 15}{res}{space 2}-.1668444{col 27}{space 2} .1670169{col 38}{space 1}   -1.00{col 47}{space 3}0.324{col 55}{space 4}-.5046679{col 68}{space 3} .1709791
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .0055505{col 27}{space 2}  .005542{col 38}{space 1}    1.00{col 47}{space 3}0.323{col 55}{space 4}-.0056592{col 68}{space 3} .0167602
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(49 real changes made)
(48 real changes made)

Linear regression                                      Number of obs ={res}      44
                                                       {txt}F(  4,    39) ={res}    5.54
                                                       {txt}Prob > F      = {res} 0.0013
                                                       {txt}R-squared     = {res} 0.3221
                                                       {txt}Root MSE      = {res} .02678

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}InfExp_Var_ch{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_ch {c |}
{space 10}L1. {c |}{col 15}{res}{space 2}-.5652033{col 27}{space 2} .1801136{col 38}{space 1}   -3.14{col 47}{space 3}0.003{col 55}{space 4}-.9295173{col 68}{space 3}-.2008892
{txt}{space 10}L2. {c |}{col 15}{res}{space 2}-.4517624{col 27}{space 2} .1349723{col 38}{space 1}   -3.35{col 47}{space 3}0.002{col 55}{space 4}-.7247696{col 68}{space 3}-.1787552
{txt}{space 10}L3. {c |}{col 15}{res}{space 2}-.4292518{col 27}{space 2}  .164663{col 38}{space 1}   -2.61{col 47}{space 3}0.013{col 55}{space 4}-.7623143{col 68}{space 3}-.0961894
{txt}{space 10}L4. {c |}{col 15}{res}{space 2} .0038498{col 27}{space 2} .1717866{col 38}{space 1}    0.02{col 47}{space 3}0.982{col 55}{space 4}-.3436213{col 68}{space 3}  .351321
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .0035135{col 27}{space 2} .0042494{col 38}{space 1}    0.83{col 47}{space 3}0.413{col 55}{space 4}-.0050816{col 68}{space 3} .0121087
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(49 real changes made, 31 to missing)
(17 real changes made)

Linear regression                                      Number of obs ={res}      13
                                                       {txt}F(  4,     8) ={res}    1.78
                                                       {txt}Prob > F      = {res} 0.2251
                                                       {txt}R-squared     = {res} 0.3917
                                                       {txt}Root MSE      = {res} 2.0558

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}InfExp_Disg_ch{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Disg_ch {c |}
{space 11}L1. {c |}{col 16}{res}{space 2} .2432741{col 28}{space 2} .2260392{col 39}{space 1}    1.08{col 48}{space 3}0.313{col 56}{space 4}-.2779732{col 69}{space 3} .7645214
{txt}{space 11}L2. {c |}{col 16}{res}{space 2}-.6920923{col 28}{space 2} .3560231{col 39}{space 1}   -1.94{col 48}{space 3}0.088{col 56}{space 4}-1.513083{col 69}{space 3} .1288983
{txt}{space 11}L3. {c |}{col 16}{res}{space 2} .2050044{col 28}{space 2} .2104169{col 39}{space 1}    0.97{col 48}{space 3}0.358{col 56}{space 4}-.2802179{col 69}{space 3} .6902268
{txt}{space 11}L4. {c |}{col 16}{res}{space 2}-.4579122{col 28}{space 2} .2304915{col 39}{space 1}   -1.99{col 48}{space 3}0.082{col 56}{space 4}-.9894266{col 69}{space 3} .0736021
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2}-.3721085{col 28}{space 2} .7066251{col 39}{space 1}   -0.53{col 48}{space 3}0.613{col 56}{space 4}-2.001589{col 69}{space 3} 1.257372
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(151 real changes made)
(150 real changes made)

Linear regression                                      Number of obs ={res}     146
                                                       {txt}F(  4,   141) ={res}   13.79
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.3563
                                                       {txt}Root MSE      = {res} .31981

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}InfExp_Disg_ch{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Disg_ch {c |}
{space 11}L1. {c |}{col 16}{res}{space 2}-.5711757{col 28}{space 2} .1660175{col 39}{space 1}   -3.44{col 48}{space 3}0.001{col 56}{space 4}-.8993809{col 69}{space 3}-.2429705
{txt}{space 11}L2. {c |}{col 16}{res}{space 2}-.3764238{col 28}{space 2}  .148866{col 39}{space 1}   -2.53{col 48}{space 3}0.013{col 56}{space 4}-.6707218{col 69}{space 3}-.0821259
{txt}{space 11}L3. {c |}{col 16}{res}{space 2}-.0454784{col 28}{space 2} .1193413{col 39}{space 1}   -0.38{col 48}{space 3}0.704{col 56}{space 4} -.281408{col 69}{space 3} .1904512
{txt}{space 11}L4. {c |}{col 16}{res}{space 2}-.1095369{col 28}{space 2}    .0659{col 39}{space 1}   -1.66{col 48}{space 3}0.099{col 56}{space 4}-.2398167{col 69}{space 3} .0207428
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2}-.0310764{col 28}{space 2}  .026051{col 39}{space 1}   -1.19{col 48}{space 3}0.235{col 56}{space 4}-.0825775{col 69}{space 3} .0204247
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(151 real changes made, 102 to missing)
(150 real changes made, 102 to missing)

Linear regression                                      Number of obs ={res}      44
                                                       {txt}F(  4,    39) ={res}    4.10
                                                       {txt}Prob > F      = {res} 0.0072
                                                       {txt}R-squared     = {res} 0.4964
                                                       {txt}Root MSE      = {res} .09589

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}InfExp_Disg_ch{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Disg_ch {c |}
{space 11}L1. {c |}{col 16}{res}{space 2}-.6397571{col 28}{space 2} .1913989{col 39}{space 1}   -3.34{col 48}{space 3}0.002{col 56}{space 4}-1.026898{col 69}{space 3}-.2526163
{txt}{space 11}L2. {c |}{col 16}{res}{space 2}-.0943757{col 28}{space 2} .1791831{col 39}{space 1}   -0.53{col 48}{space 3}0.601{col 56}{space 4}-.4568078{col 69}{space 3} .2680564
{txt}{space 11}L3. {c |}{col 16}{res}{space 2} .1796984{col 28}{space 2} .1741419{col 39}{space 1}    1.03{col 48}{space 3}0.308{col 56}{space 4}-.1725369{col 69}{space 3} .5319337
{txt}{space 11}L4. {c |}{col 16}{res}{space 2}-.0364306{col 28}{space 2} .1348717{col 39}{space 1}   -0.27{col 48}{space 3}0.788{col 56}{space 4}-.3092343{col 69}{space 3} .2363731
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2}-.0226803{col 28}{space 2} .0153239{col 39}{space 1}   -1.48{col 48}{space 3}0.147{col 56}{space 4}-.0536759{col 69}{space 3} .0083153
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(45 real changes made, 28 to missing)
(16 real changes made)

Linear regression                                      Number of obs ={res}      12
                                                       {txt}F(  4,     7) ={res}    1.90
                                                       {txt}Prob > F      = {res} 0.2149
                                                       {txt}R-squared     = {res} 0.1854
                                                       {txt}Root MSE      = {res} .30312

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_FE_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_FE_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1095357{col 26}{space 2} .1745565{col 37}{space 1}    0.63{col 46}{space 3}0.550{col 54}{space 4}-.3032248{col 67}{space 3} .5222962
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.1241499{col 26}{space 2} .2477977{col 37}{space 1}   -0.50{col 46}{space 3}0.632{col 54}{space 4}-.7100983{col 67}{space 3} .4617985
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.2706087{col 26}{space 2} .1262425{col 37}{space 1}   -2.14{col 46}{space 3}0.069{col 54}{space 4}-.5691247{col 67}{space 3} .0279072
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .1044496{col 26}{space 2} .4083798{col 37}{space 1}    0.26{col 46}{space 3}0.805{col 54}{space 4}-.8612151{col 67}{space 3} 1.070114
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0235608{col 26}{space 2} .1269207{col 37}{space 1}   -0.19{col 46}{space 3}0.858{col 54}{space 4}-.3236806{col 67}{space 3}  .276559
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(147 real changes made)
(146 real changes made)

Linear regression                                      Number of obs ={res}     142
                                                       {txt}F(  4,   137) ={res}    5.18
                                                       {txt}Prob > F      = {res} 0.0007
                                                       {txt}R-squared     = {res} 0.2652
                                                       {txt}Root MSE      = {res} .71514

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_FE_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_FE_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1220479{col 26}{space 2} .0857976{col 37}{space 1}    1.42{col 46}{space 3}0.157{col 54}{space 4} -.047611{col 67}{space 3} .2917067
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.2305909{col 26}{space 2} .1017336{col 37}{space 1}   -2.27{col 46}{space 3}0.025{col 54}{space 4} -.431762{col 67}{space 3}-.0294197
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .0026649{col 26}{space 2} .0688731{col 37}{space 1}    0.04{col 46}{space 3}0.969{col 54}{space 4} -.133527{col 67}{space 3} .1388567
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.4716861{col 26}{space 2} .1429379{col 37}{space 1}   -3.30{col 46}{space 3}0.001{col 54}{space 4} -.754336{col 67}{space 3}-.1890361
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0281422{col 26}{space 2} .0599454{col 37}{space 1}   -0.47{col 46}{space 3}0.639{col 54}{space 4}-.1466801{col 67}{space 3} .0903957
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(147 real changes made, 102 to missing)
(146 real changes made, 102 to missing)

Linear regression                                      Number of obs ={res}      40
                                                       {txt}F(  4,    35) ={res}   12.01
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4257
                                                       {txt}Root MSE      = {res} .51983

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}InfExp_FE_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_FE_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .2811047{col 26}{space 2} .1351709{col 37}{space 1}    2.08{col 46}{space 3}0.045{col 54}{space 4} .0066931{col 67}{space 3} .5555163
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.2790409{col 26}{space 2} .1470105{col 37}{space 1}   -1.90{col 46}{space 3}0.066{col 54}{space 4} -.577488{col 67}{space 3} .0194062
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} -.066477{col 26}{space 2} .1223132{col 37}{space 1}   -0.54{col 46}{space 3}0.590{col 54}{space 4} -.314786{col 67}{space 3}  .181832
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.3604058{col 26}{space 2} .2508179{col 37}{space 1}   -1.44{col 46}{space 3}0.160{col 54}{space 4}-.8695932{col 67}{space 3} .1487816
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0154842{col 26}{space 2} .0794503{col 37}{space 1}   -0.19{col 46}{space 3}0.847{col 54}{space 4}-.1767768{col 67}{space 3} .1458084
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. esttab using "${c -(}sum_table_folder{c )-}/autoregDiffQ.csv", mtitles se r2 replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/autoregDiffQ.csv"'})

{com}. 
. ***************
. *** SPF Only **
. ***************
. 
. eststo clear
{txt}
{com}. 
. foreach mom in FE Var Disg {c -(}
{txt}  2{com}.    foreach var in SPFCPI SPFPCE{c -(}
{txt}  3{com}.     replace InfExp_`mom' = `var'_`mom'
{txt}  4{com}.     replace InfExp_`mom'_ch = InfExp_`mom'-l1.InfExp_`mom'
{txt}  5{com}.         eststo `var'_`mom'lvl: reg InfExp_`mom' l(1/4).InfExp_`mom' 
{txt}  6{com}.     eststo `var'_`mom'diff: reg InfExp_`mom'_ch l(1/4).InfExp_`mom'_ch  
{txt}  7{com}.   {c )-}
{txt}  8{com}. {c )-}
{txt}(147 real changes made)
(146 real changes made)

      Source {c |}       SS       df       MS              Number of obs ={res}     143
{txt}{hline 13}{char +}{hline 30}           F(  4,   138) ={res}   50.34
    {txt}   Model {char |} {res} 106.717586     4  26.6793965           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 73.1312065   138  .529936279           {txt}R-squared     = {res} 0.5934
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.5816
    {txt}   Total {char |} {res} 179.848792   142  1.26654079           {txt}Root MSE      = {res} .72797

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .9408005{col 26}{space 2} .0839819{col 37}{space 1}   11.20{col 46}{space 3}0.000{col 54}{space 4} .7747428{col 67}{space 3} 1.106858
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.3127589{col 26}{space 2}  .115529{col 37}{space 1}   -2.71{col 46}{space 3}0.008{col 54}{space 4}-.5411949{col 67}{space 3}-.0843229
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1144993{col 26}{space 2} .1144871{col 37}{space 1}    1.00{col 46}{space 3}0.319{col 54}{space 4}-.1118764{col 67}{space 3}  .340875
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.1373172{col 26}{space 2} .0819532{col 37}{space 1}   -1.68{col 46}{space 3}0.096{col 54}{space 4}-.2993635{col 67}{space 3} .0247291
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0964008{col 26}{space 2} .0639159{col 37}{space 1}    1.51{col 46}{space 3}0.134{col 54}{space 4}-.0299804{col 67}{space 3}  .222782
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
      {txt}Source {c |}       SS       df       MS              Number of obs ={res}     142
{txt}{hline 13}{char +}{hline 30}           F(  4,   137) ={res}   12.36
    {txt}   Model {char |} {res} 25.2931779     4  6.32329447           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 70.0647929   137  .511421846           {txt}R-squared     = {res} 0.2652
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.2438
    {txt}   Total {char |} {res} 95.3579708   141  .676297665           {txt}Root MSE      = {res} .71514

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}InfExp_FE_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_FE_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1220479{col 26}{space 2} .0750013{col 37}{space 1}    1.63{col 46}{space 3}0.106{col 54}{space 4}-.0262619{col 67}{space 3} .2703577
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.2305909{col 26}{space 2} .0757061{col 37}{space 1}   -3.05{col 46}{space 3}0.003{col 54}{space 4}-.3802944{col 67}{space 3}-.0808874
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .0026649{col 26}{space 2} .0755478{col 37}{space 1}    0.04{col 46}{space 3}0.972{col 54}{space 4}-.1467257{col 67}{space 3} .1520554
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.4716861{col 26}{space 2} .0741905{col 37}{space 1}   -6.36{col 46}{space 3}0.000{col 54}{space 4}-.6183927{col 67}{space 3}-.3249795
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0281422{col 26}{space 2} .0600856{col 37}{space 1}   -0.47{col 46}{space 3}0.640{col 54}{space 4}-.1469574{col 67}{space 3}  .090673
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(147 real changes made, 102 to missing)
(146 real changes made, 102 to missing)

      Source {c |}       SS       df       MS              Number of obs ={res}      41
{txt}{hline 13}{char +}{hline 30}           F(  4,    36) ={res}   26.96
    {txt}   Model {char |} {res} 29.2432574     4  7.31081434           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 9.76194399    36  .271165111           {txt}R-squared     = {res} 0.7497
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.7219
    {txt}   Total {char |} {res} 39.0052014    40  .975130034           {txt}Root MSE      = {res} .52074

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}  1.19483{col 26}{space 2} .1416484{col 37}{space 1}    8.44{col 46}{space 3}0.000{col 54}{space 4} .9075541{col 67}{space 3} 1.482107
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.6252258{col 26}{space 2} .1975655{col 37}{space 1}   -3.16{col 46}{space 3}0.003{col 54}{space 4}-1.025907{col 67}{space 3}-.2245443
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .0781812{col 26}{space 2}  .196066{col 37}{space 1}    0.40{col 46}{space 3}0.692{col 54}{space 4} -.319459{col 67}{space 3} .4758215
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.0161773{col 26}{space 2}   .13059{col 37}{space 1}   -0.12{col 46}{space 3}0.902{col 54}{space 4}-.2810261{col 67}{space 3} .2486714
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1162595{col 26}{space 2} .0928904{col 37}{space 1}    1.25{col 46}{space 3}0.219{col 54}{space 4} -.072131{col 67}{space 3}   .30465
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
      {txt}Source {c |}       SS       df       MS              Number of obs ={res}      40
{txt}{hline 13}{char +}{hline 30}           F(  4,    35) ={res}    6.49
    {txt}   Model {char |} {res} 7.00961866     4  1.75240466           {txt}Prob > F      = {res} 0.0005
    {txt}Residual {char |} {res} 9.45766831    35  .270219095           {txt}R-squared     = {res} 0.4257
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.3600
    {txt}   Total {char |} {res}  16.467287    39  .422238127           {txt}Root MSE      = {res} .51983

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}InfExp_FE_ch{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_FE_ch {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .2811047{col 26}{space 2} .1500466{col 37}{space 1}    1.87{col 46}{space 3}0.069{col 54}{space 4}-.0235062{col 67}{space 3} .5857155
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.2790409{col 26}{space 2} .1322894{col 37}{space 1}   -2.11{col 46}{space 3}0.042{col 54}{space 4}-.5476026{col 67}{space 3}-.0104792
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} -.066477{col 26}{space 2} .1242865{col 37}{space 1}   -0.53{col 46}{space 3}0.596{col 54}{space 4}-.3187921{col 67}{space 3} .1858381
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.3604058{col 26}{space 2} .1170229{col 37}{space 1}   -3.08{col 46}{space 3}0.004{col 54}{space 4}-.5979749{col 67}{space 3}-.1228367
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0154842{col 26}{space 2} .0824803{col 37}{space 1}   -0.19{col 46}{space 3}0.852{col 54}{space 4}-.1829281{col 67}{space 3} .1519597
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(49 real changes made)
(48 real changes made)

      Source {c |}       SS       df       MS              Number of obs ={res}      45
{txt}{hline 13}{char +}{hline 30}           F(  4,    40) ={res}    1.48
    {txt}   Model {char |} {res} .007230385     4  .001807596           {txt}Prob > F      = {res} 0.2268
    {txt}Residual {char |} {res} .048894549    40  .001222364           {txt}R-squared     = {res} 0.1288
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0417
    {txt}   Total {char |} {res} .056124933    44  .001275567           {txt}Root MSE      = {res} .03496

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  InfExp_Var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}InfExp_Var {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1010926{col 26}{space 2} .1847817{col 37}{space 1}    0.55{col 46}{space 3}0.587{col 54}{space 4}-.2723651{col 67}{space 3} .4745503
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0043419{col 26}{space 2} .1816536{col 37}{space 1}   -0.02{col 46}{space 3}0.981{col 54}{space 4}-.3714775{col 67}{space 3} .3627937
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1236807{col 26}{space 2}  .179646{col 37}{space 1}    0.69{col 46}{space 3}0.495{col 54}{space 4}-.2393974{col 67}{space 3} .4867587
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .3365441{col 26}{space 2} .1771895{col 37}{space 1}    1.90{col 46}{space 3}0.065{col 54}{space 4}-.0215692{col 67}{space 3} .6946573
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0417518{col 26}{space 2} .0240948{col 37}{space 1}    1.73{col 46}{space 3}0.091{col 54}{space 4}-.0069456{col 67}{space 3} .0904491
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
      {txt}Source {c |}       SS       df       MS              Number of obs ={res}      44
{txt}{hline 13}{char +}{hline 30}           F(  4,    39) ={res}    6.07
    {txt}   Model {char |} {res}   .0311843     4  .007796075           {txt}Prob > F      = {res} 0.0007
    {txt}Residual {char |} {res}  .05009883    39  .001284585           {txt}R-squared     = {res} 0.3837
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.3204
    {txt}   Total {char |} {res}  .08128313    43  .001890305           {txt}Root MSE      = {res} .03584

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}InfExp_Var_ch{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_ch {c |}
{space 10}L1. {c |}{col 15}{res}{space 2}-.8551027{col 27}{space 2} .1889043{col 38}{space 1}   -4.53{col 47}{space 3}0.000{col 55}{space 4}-1.237198{col 68}{space 3}-.4730077
{txt}{space 10}L2. {c |}{col 15}{res}{space 2} -.780344{col 27}{space 2} .2200207{col 38}{space 1}   -3.55{col 47}{space 3}0.001{col 55}{space 4}-1.225378{col 68}{space 3}-.3353101
{txt}{space 10}L3. {c |}{col 15}{res}{space 2}-.5561795{col 27}{space 2} .2193395{col 38}{space 1}   -2.54{col 47}{space 3}0.015{col 55}{space 4}-.9998355{col 68}{space 3}-.1125235
{txt}{space 10}L4. {c |}{col 15}{res}{space 2}-.1668444{col 27}{space 2} .1879428{col 38}{space 1}   -0.89{col 47}{space 3}0.380{col 55}{space 4}-.5469946{col 68}{space 3} .2133058
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .0055505{col 27}{space 2} .0054517{col 38}{space 1}    1.02{col 47}{space 3}0.315{col 55}{space 4}-.0054766{col 68}{space 3} .0165776
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(49 real changes made)
(48 real changes made)

      Source {c |}       SS       df       MS              Number of obs ={res}      45
{txt}{hline 13}{char +}{hline 30}           F(  4,    40) ={res}    5.98
    {txt}   Model {char |} {res} .016204089     4  .004051022           {txt}Prob > F      = {res} 0.0007
    {txt}Residual {char |} {res}  .02711163    40  .000677791           {txt}R-squared     = {res} 0.3741
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.3115
    {txt}   Total {char |} {res} .043315719    44  .000984448           {txt}Root MSE      = {res} .02603

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  InfExp_Var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}InfExp_Var {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .3817407{col 26}{space 2} .1500002{col 37}{space 1}    2.54{col 46}{space 3}0.015{col 54}{space 4} .0785789{col 67}{space 3} .6849025
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0881447{col 26}{space 2} .1643065{col 37}{space 1}    0.54{col 46}{space 3}0.595{col 54}{space 4}-.2439312{col 67}{space 3} .4202207
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0239512{col 26}{space 2}  .167661{col 37}{space 1}   -0.14{col 46}{space 3}0.887{col 54}{space 4}-.3628068{col 67}{space 3} .3149044
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .3527238{col 26}{space 2} .1672566{col 37}{space 1}    2.11{col 46}{space 3}0.041{col 54}{space 4} .0146856{col 67}{space 3}  .690762
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0194575{col 26}{space 2} .0139757{col 37}{space 1}    1.39{col 46}{space 3}0.172{col 54}{space 4}-.0087885{col 67}{space 3} .0477034
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
      {txt}Source {c |}       SS       df       MS              Number of obs ={res}      44
{txt}{hline 13}{char +}{hline 30}           F(  4,    39) ={res}    4.63
    {txt}   Model {char |} {res} .013292137     4  .003323034           {txt}Prob > F      = {res} 0.0037
    {txt}Residual {char |} {res}  .02797023    39  .000717185           {txt}R-squared     = {res} 0.3221
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.2526
    {txt}   Total {char |} {res} .041262367    43   .00095959           {txt}Root MSE      = {res} .02678

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}InfExp_Var_ch{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Var_ch {c |}
{space 10}L1. {c |}{col 15}{res}{space 2}-.5652033{col 27}{space 2}   .16216{col 38}{space 1}   -3.49{col 47}{space 3}0.001{col 55}{space 4}-.8932028{col 68}{space 3}-.2372037
{txt}{space 10}L2. {c |}{col 15}{res}{space 2}-.4517624{col 27}{space 2} .1863246{col 38}{space 1}   -2.42{col 47}{space 3}0.020{col 55}{space 4}-.8286394{col 68}{space 3}-.0748854
{txt}{space 10}L3. {c |}{col 15}{res}{space 2}-.4292518{col 27}{space 2} .1888318{col 38}{space 1}   -2.27{col 47}{space 3}0.029{col 55}{space 4}-.8112001{col 68}{space 3}-.0473035
{txt}{space 10}L4. {c |}{col 15}{res}{space 2} .0038498{col 27}{space 2} .1719522{col 38}{space 1}    0.02{col 47}{space 3}0.982{col 55}{space 4}-.3439564{col 68}{space 3}  .351656
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .0035135{col 27}{space 2} .0042035{col 38}{space 1}    0.84{col 47}{space 3}0.408{col 55}{space 4}-.0049888{col 68}{space 3} .0120158
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(151 real changes made)
(150 real changes made)

      Source {c |}       SS       df       MS              Number of obs ={res}     147
{txt}{hline 13}{char +}{hline 30}           F(  4,   142) ={res}   24.02
    {txt}   Model {char |} {res} 9.92989824     4  2.48247456           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 14.6739021   142  .103337339           {txt}R-squared     = {res} 0.4036
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.3868
    {txt}   Total {char |} {res} 24.6038003   146   .16851918           {txt}Root MSE      = {res} .32146

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} InfExp_Disg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Disg {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1839244{col 26}{space 2} .0819313{col 37}{space 1}    2.24{col 46}{space 3}0.026{col 54}{space 4} .0219616{col 67}{space 3} .3458871
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .1197465{col 26}{space 2} .0823541{col 37}{space 1}    1.45{col 46}{space 3}0.148{col 54}{space 4} -.043052{col 67}{space 3}  .282545
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1194067{col 26}{space 2} .0508759{col 37}{space 1}    2.35{col 46}{space 3}0.020{col 54}{space 4} .0188347{col 67}{space 3} .2199786
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0889332{col 26}{space 2}  .048546{col 37}{space 1}    1.83{col 46}{space 3}0.069{col 54}{space 4} -.007033{col 67}{space 3} .1848994
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1731875{col 26}{space 2} .0377824{col 37}{space 1}    4.58{col 46}{space 3}0.000{col 54}{space 4} .0984987{col 67}{space 3} .2478762
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
      {txt}Source {c |}       SS       df       MS              Number of obs ={res}     146
{txt}{hline 13}{char +}{hline 30}           F(  4,   141) ={res}   19.51
    {txt}   Model {char |} {res} 7.98391229     4  1.99597807           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 14.4216658   141  .102281317           {txt}R-squared     = {res} 0.3563
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.3381
    {txt}   Total {char |} {res}  22.405578   145  .154521228           {txt}Root MSE      = {res} .31981

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}InfExp_Disg_ch{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Disg_ch {c |}
{space 11}L1. {c |}{col 16}{res}{space 2}-.5711757{col 28}{space 2}  .069886{col 39}{space 1}   -8.17{col 48}{space 3}0.000{col 56}{space 4}-.7093355{col 69}{space 3}-.4330158
{txt}{space 11}L2. {c |}{col 16}{res}{space 2}-.3764238{col 28}{space 2}  .076383{col 39}{space 1}   -4.93{col 48}{space 3}0.000{col 56}{space 4}-.5274277{col 69}{space 3}-.2254199
{txt}{space 11}L3. {c |}{col 16}{res}{space 2}-.0454784{col 28}{space 2} .0660531{col 39}{space 1}   -0.69{col 48}{space 3}0.492{col 56}{space 4}-.1760609{col 69}{space 3}  .085104
{txt}{space 11}L4. {c |}{col 16}{res}{space 2}-.1095369{col 28}{space 2} .0478885{col 39}{space 1}   -2.29{col 48}{space 3}0.024{col 56}{space 4}-.2042091{col 69}{space 3}-.0148647
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2}-.0310764{col 28}{space 2} .0269049{col 39}{space 1}   -1.16{col 48}{space 3}0.250{col 56}{space 4}-.0842656{col 69}{space 3} .0221127
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(151 real changes made, 102 to missing)
(150 real changes made, 102 to missing)

      Source {c |}       SS       df       MS              Number of obs ={res}      45
{txt}{hline 13}{char +}{hline 30}           F(  4,    40) ={res}   34.11
    {txt}   Model {char |} {res} 1.86978527     4  .467446317           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} .548117901    40  .013702948           {txt}R-squared     = {res} 0.7733
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.7506
    {txt}   Total {char |} {res} 2.41790317    44  .054952345           {txt}Root MSE      = {res} .11706

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} InfExp_Disg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Disg {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .3861207{col 26}{space 2} .1465335{col 37}{space 1}    2.64{col 46}{space 3}0.012{col 54}{space 4} .0899655{col 67}{space 3}  .682276
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .6278169{col 26}{space 2} .1528935{col 37}{space 1}    4.11{col 46}{space 3}0.000{col 54}{space 4} .3188077{col 67}{space 3} .9368261
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .2452192{col 26}{space 2} .1555677{col 37}{space 1}    1.58{col 46}{space 3}0.123{col 54}{space 4}-.0691949{col 67}{space 3} .5596332
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.3607383{col 26}{space 2} .1447633{col 37}{space 1}   -2.49{col 46}{space 3}0.017{col 54}{space 4}-.6533158{col 67}{space 3}-.0681607
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0262673{col 26}{space 2} .0357546{col 37}{space 1}    0.73{col 46}{space 3}0.467{col 54}{space 4}-.0459955{col 67}{space 3} .0985301
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
      {txt}Source {c |}       SS       df       MS              Number of obs ={res}      44
{txt}{hline 13}{char +}{hline 30}           F(  4,    39) ={res}    9.61
    {txt}   Model {char |} {res} .353523365     4  .088380841           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} .358637866    39  .009195843           {txt}R-squared     = {res} 0.4964
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.4448
    {txt}   Total {char |} {res} .712161231    43  .016561889           {txt}Root MSE      = {res} .09589

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}InfExp_Disg_ch{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
InfExp_Disg_ch {c |}
{space 11}L1. {c |}{col 16}{res}{space 2}-.6397571{col 28}{space 2} .1272987{col 39}{space 1}   -5.03{col 48}{space 3}0.000{col 56}{space 4}-.8972431{col 69}{space 3}-.3822711
{txt}{space 11}L2. {c |}{col 16}{res}{space 2}-.0943757{col 28}{space 2} .1413116{col 39}{space 1}   -0.67{col 48}{space 3}0.508{col 56}{space 4}-.3802054{col 69}{space 3}  .191454
{txt}{space 11}L3. {c |}{col 16}{res}{space 2} .1796984{col 28}{space 2} .1377015{col 39}{space 1}    1.30{col 48}{space 3}0.200{col 56}{space 4}-.0988292{col 69}{space 3}  .458226
{txt}{space 11}L4. {c |}{col 16}{res}{space 2}-.0364306{col 28}{space 2} .1233338{col 39}{space 1}   -0.30{col 48}{space 3}0.769{col 56}{space 4}-.2858968{col 69}{space 3} .2130356
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2}-.0226803{col 28}{space 2} .0145737{col 39}{space 1}   -1.56{col 48}{space 3}0.128{col 56}{space 4}-.0521585{col 69}{space 3} .0067978
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. esttab using "${c -(}sum_table_folder{c )-}/autoregSPFQ.csv", mtitles se r2 replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/autoregSPFQ.csv"'})

{com}. eststo clear
{txt}
{com}. 
. 
. save "${c -(}folder{c )-}/InfExpQ.dta",replace 
{txt}file /Users/Myworld/Dropbox/ExpProject/workingfolder/SurveyData//InfExpQ.dta saved

{com}. 
. 
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/ExpProject/workingfolder/pop_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}20 Jun 2019, 21:12:16
{txt}{.-}
{smcl}
{txt}{sf}{ul off}