{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/ExpProject/workingfolder/pop_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}19 Jun 2019, 16:20:11
{txt}
{com}. 
. ****************************************
. **** Population Moments Analysis ******
. ****************************************
. 
. ***********************
. **   Merge other data**
. ***********************
. 
. use "${c -(}folder{c )-}/NYFEDSurvey/InfExpSCEProbPopM",clear 
{txt}
{com}. 
. merge 1:1 year month using "${c -(}mainfolder{c )-}/OtherData/RecessionDateM.dta", keep(match)
{res}{txt}{p 0 7 2}
(note: variable
year was 
int, now float to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
month was 
byte, now float to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              53{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge  recession_merge
{res}{txt}
{com}. 
. merge 1:1 year month using "${c -(}mainfolder{c )-}/OtherData/InfM.dta",keep(match using master)
{res}{txt}(label _merge already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             802
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}             802{txt}  (_merge==2)

{col 5}matched{col 30}{res}              53{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge inflation_merge 
{res}{txt}
{com}. 
. merge 1:1 year month using "${c -(}folder{c )-}/MichiganSurvey/InfExpMichM.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             151
{txt}{col 9}from master{col 30}{res}             151{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             704{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename inf_exp InfExpMichMed 
{res}{txt}
{com}. rename _merge michigan_merge 
{res}{txt}
{com}. 
. ***********************************************
. ** create quarter variable to match with spf
. *********************************************
. 
. gen quarter = .
{txt}(855 missing values generated)

{com}. replace quarter=1 if month<4 & month >=1
{txt}(216 real changes made)

{com}. replace quarter=2 if month<7 & month >=4
{txt}(213 real changes made)

{com}. replace quarter=3 if month<10 & month >=7
{txt}(213 real changes made)

{com}. replace quarter=4 if month<=12 & month >=10
{txt}(213 real changes made)

{com}. 
. merge m:1 year quarter using "${c -(}folder{c )-}/SPF/individual/InfExpSPFPointPopQ.dta",keep(match using master)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             250
{txt}{col 9}from master{col 30}{res}             249{txt}  (_merge==1)
{col 9}from using{col 30}{res}               1{txt}  (_merge==2)

{col 5}matched{col 30}{res}             606{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge spf_merge 
{res}{txt}
{com}. 
. 
. merge m:1 year quarter using "${c -(}folder{c )-}/SPF/InfExpSPFDstPopQ.dta",keep(match using master)
{res}{txt}{p 0 7 2}
(note: variable
year was 
float, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
quarter was 
float, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             708
{txt}{col 9}from master{col 30}{res}             708{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             148{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge spf_dst_merge 
{res}{txt}
{com}. 
. 
. *************************
. ** Declare time series **
. **************************
. 
. gen date2=string(year)+"m"+string(month)
{txt}
{com}. gen date3= monthly(date2,"YM")
{txt}(1 missing value generated)

{com}. format date3 %tm 
{txt}
{com}. 
. drop date2 date 
{txt}
{com}. rename date3 date
{res}{txt}
{com}. 
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1948m1 to 2019m3
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. sort year quarter month 
{txt}
{com}. 
. 
. 
. ******************************
. *** Computing some measures **
. ******************************
. 
. gen SCE_FE = Q9_mean - Inf1yf_CPICore
{txt}(805 missing values generated)

{com}. label var SCE_FE "1-yr-ahead forecast error"
{txt}
{com}. 
. gen SPFCPI_FE = CPI1y - Inf1yf_CPIAU
{txt}(415 missing values generated)

{com}. label var SPFCPI_FE "1-yr-ahead forecast error(SPF CPI)"
{txt}
{com}. gen SPFCCPI_FE = CORECPI1y - Inf1yf_CPICore
{txt}(721 missing values generated)

{com}. label var SPFCPI_FE "1-yr-ahead forecast error(SPF Core CPI)"
{txt}
{com}. gen SPFPCE_FE = PCE1y - Inf1yf_PCE
{txt}(721 missing values generated)

{com}. label var SPFPCE_FE "1-yr-ahead forecast error(SPF PCE)"
{txt}
{com}. 
. 
. *****************************
. ****    Summary Charts ******
. *****************************
. 
. 
. /*
> **************************
> ** Single series charts **
> **************************
> 
> foreach var in Q9_mean Q9_var Q9_iqr Q9_cent50 Q9_disg ///
>                CPI1y PCE1y CORECPI1y COREPCE1y ///
>                            CPI_disg PCE_disg CORECPI_disg COREPCE_disg ///
>                            CPI_ct50 PCE_ct50 CORECPI_ct50 COREPCE_ct50{c -(}
> local var_lb: var label `var'
> tsline `var' if `var'!=.,title("`var_lb'") xtitle("Time") ytitle("")
> graph export "${c -(}sum_graph_folder{c )-}/`var'", as(png) replace 
> {c )-}
> 
> 
> 
> ***************************
> ** Multiple series charts**
> ***************************
> 
> drop if CPI1y ==. | PCE1y==.
> 
> twoway (tsline Q9_mean)  (tsline Q9_cent50,lp("dash")) ///
>                          (tsline InfExpMichMed, lp("dot-dash")) ///
>                                                  (tsline CPI1y, lp("shortdash")), ///
>                                                  title("1-yr-ahead Expected Inflation") ///
>                                                  xtitle("Time") ytitle("") ///
>                                                  legend(label(1 "Mean Expectation(SCE)") label(2 "Median Expectation(SCE)") ///
>                                                         label(3 "Median Expectation(Michigan)") label(4 "Mean Expectation(SPF)"))
> graph export "${c -(}sum_graph_folder{c )-}/mean_med", as(png) replace
> 
> twoway (tsline Q9_mean, ytitle(" ",axis(1))) ///
>        (tsline Q9_var,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if Q9_mean!=., ///
>            title("1-yr-ahead Expected Inflation") xtitle("Time") ///
>            legend(label(1 "Average Expectation") label(2 "Average Uncertainty(RHS)"))
> graph export "${c -(}sum_graph_folder{c )-}/mean_var", as(png) replace 
> 
> 
> twoway (tsline Q9_mean, ytitle(" ",axis(1))) ///
>        (tsline Q9_disg,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if Q9_mean!=., ///
>            title("1-yr-ahead Expected Inflation") xtitle("Time") ///
>            legend(label(1 "Average Expectation") label(2 "Disagreements(RHS)"))
> graph export "${c -(}sum_graph_folder{c )-}/mean_disg", as(png) replace 
> 
> 
> twoway (tsline Q9_disg, ytitle(" ",axis(1))) ///
>        (tsline CORECPI_disg,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if CORECPI_disg!=., ///
>            title("Disagreements in 1-yr-ahead Inflation") xtitle("Time") ///
>            legend(label(1 "Disagreements (SCE)") label(2 "Disagreements(SPF)(RHS)"))
> graph export "${c -(}sum_graph_folder{c )-}/disg_disg", as(png) replace 
> 
> 
> twoway (tsline Q9_var, ytitle(" ",axis(1))) ///
>        (tsline PRCCPIVar1mean, yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if Q9_var!=., ///
>            title("Uncertainty in 1-yr-ahead Inflation") xtitle("Time") ///
>            legend(label(1 "Uncertainty (SCE)")  /// 
>                   label(2 "Uncertainty (SPF CPI)(RHS)")) 
>                           
> graph export "${c -(}sum_graph_folder{c )-}/var_var", as(png) replace 
> 
> 
> twoway (tsline Q9_disg, ytitle(" ",axis(1))) ///
>        (tsline Q9_var,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if Q9_disg!=., ///
>            title("1-yr-ahead Expected Inflation") xtitle("Time") ///
>            legend(label(1 "Disagreements") label(2 "Average Uncertainty(RHS)")) 
> graph export "${c -(}sum_graph_folder{c )-}/var_disg", as(png) replace 
> 
> 
> 
> twoway (tsline CORECPI_disg, ytitle(" ",axis(1))) ///
>        (tsline PRCCPIVar1mean,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if Q9_disg!=., ///
>            title("1-yr-ahead Expected Inflation(SPF)") xtitle("Time") ///
>            legend(label(1 "Disagreements") label(2 "Average Uncertainty(RHS)")) 
> graph export "${c -(}sum_graph_folder{c )-}/var_disg2", as(png) replace 
> 
> 
> twoway (tsline Q9_mean) (tsline CORECPI1y,lp("longdash")) ///
>        (tsline Inf1yf_PCEPI,lp("dash")) ///
>        (tsline Inf1yf_CPIAU,lp("shortdash")) ///
>            (tsline Inf1yf_CPICore,lp("dash_dot")) ///
>            if Q9_mean!=., ///
>            title("1-yr-ahead Expected Inflation") xtitle("Time") ytitle("") ///
>            legend(label(1 "Mean Forecast(SCE)") label(2 "Mean Forecast(SPF)") label(3 "Realized Inflation(PCE)") ///
>                   label(4 "Realized Inflation(Headline CPI)") label(5 "Realized Inflation(Core CPI)"))
> graph export "${c -(}sum_graph_folder{c )-}/mean_true", as(png) replace
> 
> 
> twoway (tsline Q9_mean)  (tsline Inf1y_PCEPI,lp("dash")) ///
>        (tsline Inf1y_CPIAU,lp("shortdash")) ///
>            (tsline Inf1y_CPICore,lp("dash_dot")) ///
>            if Q9_mean!=., ///
>            title("1-yr-ahead Expected Inflation") xtitle("Time") ytitle("") ///
>            legend(label(1 "Mean Expectation") label(2 "Past Inflation(PCE)") ///
>                   label(3 "Past Inflation(Headline CPI)") label(4 "Past Inflation(Core CPI)"))
> graph export "${c -(}sum_graph_folder{c )-}/mean_past", as(png) replace
> 
> 
> twoway (tsline SCE_FE,ytitle("",axis(1)))  (tsline SPFCPI_FE, yaxis(2) lp("dash")) ///
>        (tsline SPFPCE_FE, yaxis(2) lp("dash_dot"))  ///  
>                          if SPFPCE_FE!=., ///
>                                                  title("1-yr-ahead Forecast Errors") ///
>                                                  xtitle("Time") ytitle("") ///
>                                                  legend(label(1 "SCE") label(2 "SPF CPI(RHS)") ///
>                                                  label(3 "SPF PCE(RHS)"))
> graph export "${c -(}sum_graph_folder{c )-}/fe_fe", as(png) replace
> 
> 
> 
> ***************************
> ***  Population Moments *** 
> ***************************
> tsset date
> 
> estpost tabstat Q9_mean Q9_var Q9_disg Q9_iqr CPI1y PCE1y CORECPI1y COREPCE1y ///
>                 CPI_disg PCE_disg CORECPI_disg COREPCE_disg PRCCPIVar1mean PRCPCEVar1mean, ///
>                             st(mean var median) columns(statistics)
> esttab . using "${c -(}sum_table_folder{c )-}/pop_sum_stats.csv", cells("mean(fmt(a3)) var(fmt(a3)) median(fmt(a3))") replace
> 
> eststo clear
> foreach var in Q9_mean Q9_var Q9_disg CPI1y PCE1y CORECPI1y COREPCE1y{c -(}
> gen `var'_ch = `var'-l1.`var'
> label var `var'_ch "m to m+1 change of `var'"
> eststo: reg `var' l(1/5).`var'
> eststo: reg `var'_ch l(1/5).`var'_ch
> corrgram `var', lags(5) 
> *gen `var'1=`r(ac1)'
> *label var `var'1 "Auto-correlation coefficient of `var'"
> {c )-}
> esttab using "${c -(}sum_table_folder{c )-}/autoreg.csv", se r2 replace
> eststo clear
> */
. 
. ****************************************
. **** Quarterly Level Analysis  ******
. ****************************************
. 
. *******************************************
. ***  Collapse monthly data to quarterly  **
. *******************************************
. 
. collapse (mean) Q9_mean Q9_var Q9_disg Q9_iqr CPI1y PCE1y CORECPI1y InfExpMichMed ///
>                 COREPCE1y CPI_disg PCE_disg CORECPI_disg COREPCE_disg SCE_FE SPFCPI_FE SPFCCPI_FE SPFPCE_FE ///
>                                 PRCCPIVar1mean PRCPCEVar1mean PRCCPIVar0mean PRCPCEVar0mean, ///
>                                 by(year quarter) 
{txt}
{com}. 
. gen date2=string(year)+"Q"+string(quarter)
{txt}
{com}. gen date3= quarterly(date2,"YQ")
{txt}(1 missing value generated)

{com}. format date3 %tq 
{txt}
{com}. drop date2 
{txt}
{com}. rename date3 date
{res}{txt}
{com}. 
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1948q1 to 2019q1
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. sort year quarter  
{txt}
{com}. 
. order date year quarter 
{txt}
{com}. 
. /*
> ******************************************
> *** Multiple series charts Quarterly  ****
> *******************************************
> drop if CPI1y ==. | PCE1y==.
> 
> 
> 
> twoway (tsline Q9_mean) (tsline InfExpMichMed, lp("dash_dot")) ///
>        (tsline CPI1y, lp("shortdash")) (tsline PCE1y, lp("dash")), ///
>                                                  title("1-yr-ahead Expected Inflation") ///
>                                                  xtitle("Time") ytitle("") ///
>                                                  legend(label(1 "Mean Expectation(SCE)") ///
>                                                         label(2 "Median Expectation(Michigan)") ///
>                                                                 label(3 "Mean Expectation CPI (SPF)") ///
>                                                                 label(4 "Mean Expectation PCE (SPF)") col(1))
> graph export "${c -(}sum_graph_folder{c )-}/mean_medQ", as(png) replace
> 
> 
> twoway (tsline Q9_disg, ytitle(" ",axis(1))) ///
>        (tsline CORECPI_disg,yaxis(2) ytitle("",axis(2)) lp("dash")) ///
>            if CORECPI_disg!=., ///
>            title("Disagreements in 1-yr-ahead Inflation") xtitle("Time") ///
>            legend(label(1 "Disagreements (SCE)") label(2 "Disagreements(SPF)(RHS)"))
> graph export "${c -(}sum_graph_folder{c )-}/disg_disgQ", as(png) replace 
> 
> 
> twoway (tsline Q9_var, ytitle(" ",axis(1)) lp("solid") ) ///
>        (tsline PRCCPIVar1mean, yaxis(2) ytitle("",axis(2)) lp("shortdash")) ///
>            (tsline PRCPCEVar1mean, yaxis(2) ytitle("",axis(2)) lp("dash_dot")) ///
>            if Q9_var!=., ///
>            title("Uncertainty in 1-yr-ahead Inflation") xtitle("Time") ///
>            legend(label(1 "Uncertainty (SCE)")  /// 
>                   label(2 "Uncertainty (SPF CPI)(RHS)") ///
>                           label(3 "Uncertainty (SPF PCE)(RHS)") col(1)) 
>                           
> graph export "${c -(}sum_graph_folder{c )-}/var_varQ", as(png) replace 
> 
> 
> twoway (tsline SCE_FE)  (tsline SPFCPI_FE, yaxis(2) lp("dash")) ///
>         (tsline SPFPCE_FE, yaxis(2) lp("dash_dot")) ///
>                          if SPFCPI_FE!=., ///
>                                                  title("1-yr-ahead Forecast Errors") ///
>                                                  xtitle("Time") ytitle("") ///
>                                                  legend(col(1) label(1 "SCE") label(2 "SPF CPI (RHS)") ///
>                                                                 label(3 "SPF PCE(RHS)"))
> graph export "${c -(}sum_graph_folder{c )-}/fe_feQ", as(png) replace
> 
> */
. ********************************
. ***  Autoregression Quarterly **
. *******************************
. 
. tsset date 
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1948q1 to 2019q1
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. 
. eststo clear
{txt}
{com}. 
. gen InfExp1y = .
{txt}(286 missing values generated)

{com}. gen InfExpFE1y = .
{txt}(286 missing values generated)

{com}. gen InfExpVar1y=.
{txt}(286 missing values generated)

{com}. gen InfExpDisg1y = .
{txt}(286 missing values generated)

{com}. 
. *****************************************
. ****  Renaming so that more consistent **
. *****************************************
. 
. 
. rename Q9_mean SCE_Mean
{res}{txt}
{com}. rename Q9_var SCE_Var
{res}{txt}
{com}. rename Q9_disg SCE_Disg
{res}{txt}
{com}. rename SCE_FE SCE_FE
{res}{txt}  (all {it:newnames}=={it:oldnames})

{com}. 
. rename CPI1y SPFCPI_Mean
{res}{txt}
{com}. rename PCE1y SPFPCE_Mean
{res}{txt}
{com}. rename COREPCE1y SPFCPCE_Mean
{res}{txt}
{com}. rename CORECPI1y SPFCCPI_Mean
{res}{txt}
{com}. 
. 
. rename CPI_disg SPFCPI_Disg
{res}{txt}
{com}. rename PCE_disg SPFPCE_Disg 
{res}{txt}
{com}. rename CORECPI_disg SPFCCPI_Disg
{res}{txt}
{com}. rename COREPCE_disg SPFCPCE_Disg
{res}{txt}
{com}. 
. rename PRCPCEVar1mean SPFPCE_Var
{res}{txt}
{com}. rename PRCCPIVar1mean SPFCPI_Var
{res}{txt}
{com}. 
. rename SPFCPI_FE SPFCPI_FE
{res}{txt}  (all {it:newnames}=={it:oldnames})

{com}. rename SPFPCE_FE SPFPCE_FE
{res}{txt}  (all {it:newnames}=={it:oldnames})

{com}. 
. gen InfExp_Mean = .
{txt}(286 missing values generated)

{com}. gen InfExp_Var = .
{txt}(286 missing values generated)

{com}. gen InfExp_FE = .
{txt}(286 missing values generated)

{com}. gen InfExp_Disg = . 
{txt}(286 missing values generated)

{com}. 
. 
. gen InfExp_Mean_ch = .
{txt}(286 missing values generated)

{com}. gen InfExp_Var_ch = .
{txt}(286 missing values generated)

{com}. gen InfExp_FE_ch = .
{txt}(286 missing values generated)

{com}. gen InfExp_Disg_ch = . 
{txt}(286 missing values generated)

{com}. 
. *******************************************************
. **** Autoregression on the levels of population moments
. ********************************************************
. 
. 
. eststo clear 
{txt}
{com}. foreach mom in Mean Var Disg FE{c -(}
{txt}  2{com}.    foreach var in SCE SPFCPI SPFPCE{c -(}
{txt}  3{com}.     replace InfExp_`mom' = `var'_`mom'
{txt}  4{com}.     eststo `var'_`mom': reg InfExp_`mom' l(3/5).InfExp_`mom', vce(robust)
{txt}  5{com}.   {c )-}
{txt}  6{com}.   
. {c )-}
{txt}(18 real changes made)

Linear regression                                      Number of obs ={res}      13
                                                       {txt}F(  3,     9) ={res}    1.78
                                                       {txt}Prob > F      = {res} 0.2206
                                                       {txt}R-squared     = {res} 0.3046
                                                       {txt}Root MSE      = {res}  .1301

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} InfExp_Mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Mean {c |}
{space 9}L3. {c |}{col 14}{res}{space 2}-.3706936{col 26}{space 2} .2820485{col 37}{space 1}   -1.31{col 46}{space 3}0.221{col 54}{space 4}-1.008732{col 67}{space 3} .2673445
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .3205169{col 26}{space 2} .3789192{col 37}{space 1}    0.85{col 46}{space 3}0.420{col 54}{space 4}-.5366579{col 67}{space 3} 1.177692
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0319587{col 26}{space 2} .2223516{col 37}{space 1}    0.14{col 46}{space 3}0.889{col 54}{space 4}-.4710355{col 67}{space 3}  .534953
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.481013{col 26}{space 2} .5163771{col 37}{space 1}    6.74{col 46}{space 3}0.000{col 54}{space 4} 2.312886{col 67}{space 3} 4.649139
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(151 real changes made)

Linear regression                                      Number of obs ={res}     146
                                                       {txt}F(  3,   142) ={res}  176.91
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.8506
                                                       {txt}Root MSE      = {res}  .3811

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} InfExp_Mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Mean {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .7323387{col 26}{space 2} .1541178{col 37}{space 1}    4.75{col 46}{space 3}0.000{col 54}{space 4} .4276769{col 67}{space 3} 1.037001
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .2441194{col 26}{space 2} .1836777{col 37}{space 1}    1.33{col 46}{space 3}0.186{col 54}{space 4}-.1189767{col 67}{space 3} .6072155
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.1363949{col 26}{space 2} .1602501{col 37}{space 1}   -0.85{col 46}{space 3}0.396{col 54}{space 4}-.4531791{col 67}{space 3} .1803893
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3985641{col 26}{space 2} .0977332{col 37}{space 1}    4.08{col 46}{space 3}0.000{col 54}{space 4} .2053641{col 67}{space 3} .5917642
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(151 real changes made, 102 to missing)

Linear regression                                      Number of obs ={res}      44
                                                       {txt}F(  3,    40) ={res}    0.78
                                                       {txt}Prob > F      = {res} 0.5134
                                                       {txt}R-squared     = {res} 0.0860
                                                       {txt}Root MSE      = {res} .21438

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} InfExp_Mean{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Mean {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .3162752{col 26}{space 2} .2863607{col 37}{space 1}    1.10{col 46}{space 3}0.276{col 54}{space 4}-.2624814{col 67}{space 3} .8950317
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0044989{col 26}{space 2} .3060529{col 37}{space 1}    0.01{col 46}{space 3}0.988{col 54}{space 4}-.6140571{col 67}{space 3} .6230549
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0950636{col 26}{space 2} .1946466{col 37}{space 1}   -0.49{col 46}{space 3}0.628{col 54}{space 4} -.488459{col 67}{space 3} .2983318
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.402335{col 26}{space 2} .4792193{col 37}{space 1}    2.93{col 46}{space 3}0.006{col 54}{space 4}  .433797{col 67}{space 3} 2.370874
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(18 real changes made)

Linear regression                                      Number of obs ={res}      13
                                                       {txt}F(  3,     9) ={res}    7.01
                                                       {txt}Prob > F      = {res} 0.0099
                                                       {txt}R-squared     = {res} 0.6298
                                                       {txt}Root MSE      = {res} .66665

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  InfExp_Var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}InfExp_Var {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} -.493762{col 26}{space 2} .2068208{col 37}{space 1}   -2.39{col 46}{space 3}0.041{col 54}{space 4}-.9616231{col 67}{space 3} -.025901
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.5803511{col 26}{space 2} .1858943{col 37}{space 1}   -3.12{col 46}{space 3}0.012{col 54}{space 4}-1.000873{col 67}{space 3}-.1598289
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} -.335789{col 26}{space 2} .2049892{col 37}{space 1}   -1.64{col 46}{space 3}0.136{col 54}{space 4}-.7995069{col 67}{space 3} .1279289
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 38.18257{col 26}{space 2} 5.395718{col 37}{space 1}    7.08{col 46}{space 3}0.000{col 54}{space 4}  25.9766{col 67}{space 3} 50.38853
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(49 real changes made)

Linear regression                                      Number of obs ={res}      44
                                                       {txt}F(  3,    40) ={res}    3.98
                                                       {txt}Prob > F      = {res} 0.0142
                                                       {txt}R-squared     = {res} 0.1367
                                                       {txt}Root MSE      = {res} .03479

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  InfExp_Var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}InfExp_Var {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .1312255{col 26}{space 2} .1423889{col 37}{space 1}    0.92{col 46}{space 3}0.362{col 54}{space 4}-.1565532{col 67}{space 3} .4190043
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .3263452{col 26}{space 2} .1510013{col 37}{space 1}    2.16{col 46}{space 3}0.037{col 54}{space 4} .0211603{col 67}{space 3} .6315301
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .1370273{col 26}{space 2} .1392002{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4}-.1443067{col 67}{space 3} .4183613
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0389051{col 26}{space 2} .0152236{col 37}{space 1}    2.56{col 46}{space 3}0.015{col 54}{space 4}  .008137{col 67}{space 3} .0696732
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(49 real changes made)

Linear regression                                      Number of obs ={res}      44
                                                       {txt}F(  3,    40) ={res}    5.84
                                                       {txt}Prob > F      = {res} 0.0021
                                                       {txt}R-squared     = {res} 0.2346
                                                       {txt}Root MSE      = {res} .02873

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  InfExp_Var{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}InfExp_Var {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .1343533{col 26}{space 2} .1614106{col 37}{space 1}    0.83{col 46}{space 3}0.410{col 54}{space 4}-.1918698{col 67}{space 3} .4605763
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .4217052{col 26}{space 2} .1728821{col 37}{space 1}    2.44{col 46}{space 3}0.019{col 54}{space 4} .0722976{col 67}{space 3} .7711129
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0951203{col 26}{space 2} .1551542{col 37}{space 1}    0.61{col 46}{space 3}0.543{col 54}{space 4} -.218458{col 67}{space 3} .4086986
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0330806{col 26}{space 2} .0124967{col 37}{space 1}    2.65{col 46}{space 3}0.012{col 54}{space 4} .0078239{col 67}{space 3} .0583374
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(18 real changes made)

Linear regression                                      Number of obs ={res}      13
                                                       {txt}F(  3,     9) ={res}    0.55
                                                       {txt}Prob > F      = {res} 0.6597
                                                       {txt}R-squared     = {res} 0.1762
                                                       {txt}Root MSE      = {res} 2.2662

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} InfExp_Disg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Disg {c |}
{space 9}L3. {c |}{col 14}{res}{space 2}-.3188447{col 26}{space 2} .4351761{col 37}{space 1}   -0.73{col 46}{space 3}0.482{col 54}{space 4}-1.303281{col 67}{space 3} .6655921
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.0157326{col 26}{space 2}  .446769{col 37}{space 1}   -0.04{col 46}{space 3}0.973{col 54}{space 4}-1.026394{col 67}{space 3} .9949291
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.1783815{col 26}{space 2} .3237651{col 37}{space 1}   -0.55{col 46}{space 3}0.595{col 54}{space 4}-.9107889{col 67}{space 3}  .554026
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 34.07911{col 26}{space 2} 10.02217{col 37}{space 1}    3.40{col 46}{space 3}0.008{col 54}{space 4} 11.40739{col 67}{space 3} 56.75083
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(151 real changes made)

Linear regression                                      Number of obs ={res}     146
                                                       {txt}F(  3,   142) ={res}   39.54
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.4713
                                                       {txt}Root MSE      = {res} .29686

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} InfExp_Disg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Disg {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .2446932{col 26}{space 2} .1517482{col 37}{space 1}    1.61{col 46}{space 3}0.109{col 54}{space 4}-.0552843{col 67}{space 3} .5446707
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0610596{col 26}{space 2}   .09304{col 37}{space 1}    0.66{col 46}{space 3}0.513{col 54}{space 4}-.1228628{col 67}{space 3}  .244982
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .1843647{col 26}{space 2}   .07347{col 37}{space 1}    2.51{col 46}{space 3}0.013{col 54}{space 4} .0391284{col 67}{space 3} .3296011
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1695882{col 26}{space 2}  .035644{col 37}{space 1}    4.76{col 46}{space 3}0.000{col 54}{space 4} .0991268{col 67}{space 3} .2400496
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(151 real changes made, 102 to missing)

Linear regression                                      Number of obs ={res}      44
                                                       {txt}F(  3,    40) ={res}   32.71
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.6779
                                                       {txt}Root MSE      = {res} .13115

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} InfExp_Disg{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}InfExp_Disg {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .7230759{col 26}{space 2} .1486967{col 37}{space 1}    4.86{col 46}{space 3}0.000{col 54}{space 4} .4225488{col 67}{space 3} 1.023603
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .1622424{col 26}{space 2}  .192402{col 37}{space 1}    0.84{col 46}{space 3}0.404{col 54}{space 4}-.2266165{col 67}{space 3} .5511013
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0546004{col 26}{space 2} .1773456{col 37}{space 1}   -0.31{col 46}{space 3}0.760{col 54}{space 4}-.4130293{col 67}{space 3} .3038284
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0299168{col 26}{space 2} .0262986{col 37}{space 1}    1.14{col 46}{space 3}0.262{col 54}{space 4}-.0232347{col 67}{space 3} .0830683
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(17 real changes made)

Linear regression                                      Number of obs ={res}      12
                                                       {txt}F(  3,     8) ={res}    0.57
                                                       {txt}Prob > F      = {res} 0.6525
                                                       {txt}R-squared     = {res} 0.1781
                                                       {txt}Root MSE      = {res}  .2887

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L3. {c |}{col 14}{res}{space 2}-.3526234{col 26}{space 2} .3910765{col 37}{space 1}   -0.90{col 46}{space 3}0.394{col 54}{space 4}-1.254447{col 67}{space 3} .5492006
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}  .179214{col 26}{space 2} .5337043{col 37}{space 1}    0.34{col 46}{space 3}0.746{col 54}{space 4} -1.05151{col 67}{space 3} 1.409938
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.1567124{col 26}{space 2} .3451253{col 37}{space 1}   -0.45{col 46}{space 3}0.662{col 54}{space 4}-.9525727{col 67}{space 3} .6391478
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.901514{col 26}{space 2} .4104865{col 37}{space 1}    4.63{col 46}{space 3}0.002{col 54}{space 4} .9549303{col 67}{space 3} 2.848097
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(147 real changes made)

Linear regression                                      Number of obs ={res}     142
                                                       {txt}F(  3,   138) ={res}    1.80
                                                       {txt}Prob > F      = {res} 0.1500
                                                       {txt}R-squared     = {res} 0.0838
                                                       {txt}Root MSE      = {res} 1.0634

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .4268251{col 26}{space 2} .1878621{col 37}{space 1}    2.27{col 46}{space 3}0.025{col 54}{space 4} .0553648{col 67}{space 3} .7982854
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.4886237{col 26}{space 2} .2230418{col 37}{space 1}   -2.19{col 46}{space 3}0.030{col 54}{space 4}-.9296451{col 67}{space 3}-.0476024
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}   .18784{col 26}{space 2} .1055526{col 37}{space 1}    1.78{col 46}{space 3}0.077{col 54}{space 4}-.0208695{col 67}{space 3} .3965494
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  .190633{col 26}{space 2} .1031988{col 37}{space 1}    1.85{col 46}{space 3}0.067{col 54}{space 4}-.0134224{col 67}{space 3} .3946883
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(147 real changes made, 102 to missing)

Linear regression                                      Number of obs ={res}      40
                                                       {txt}F(  3,    36) ={res}    0.93
                                                       {txt}Prob > F      = {res} 0.4385
                                                       {txt}R-squared     = {res} 0.1178
                                                       {txt}Root MSE      = {res} .92785

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   InfExp_FE{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}InfExp_FE {c |}
{space 9}L3. {c |}{col 14}{res}{space 2} .3074246{col 26}{space 2} .3745142{col 37}{space 1}    0.82{col 46}{space 3}0.417{col 54}{space 4}-.4521254{col 67}{space 3} 1.066975
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.6004535{col 26}{space 2} .4577797{col 37}{space 1}   -1.31{col 46}{space 3}0.198{col 54}{space 4}-1.528874{col 67}{space 3} .3279667
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .1966994{col 26}{space 2} .2464128{col 37}{space 1}    0.80{col 46}{space 3}0.430{col 54}{space 4} -.303049{col 67}{space 3} .6964478
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3732659{col 26}{space 2} .1981123{col 37}{space 1}    1.88{col 46}{space 3}0.068{col 54}{space 4}-.0285245{col 67}{space 3} .7750564
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. esttab using "${c -(}sum_table_folder{c )-}/autoregLvlQ.csv", mtitles se r2 replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/ExpProject/workingfolder/tables/autoregLvlQ.csv"'})

{com}. 
. ddd
{err}unrecognized command:  ddd
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. do "/Users/Myworld/Dropbox/ExpProject/workingfolder/DoFile/Step05_IndSPFAnalysis.do"
{txt}
{com}. clear
{txt}
{com}. global mainfolder "/Users/Myworld/Dropbox/ExpProject/workingfolder"
{txt}
{com}. global folder "${c -(}mainfolder{c )-}/SurveyData/"
{txt}
{com}. global sum_graph_folder "${c -(}mainfolder{c )-}/graphs/ind"
{txt}
{com}. global sum_table_folder "${c -(}mainfolder{c )-}/tables"
{txt}
{com}. 
. cd ${c -(}folder{c )-}
{res}/Users/Myworld/Dropbox/ExpProject/workingfolder/SurveyData
{txt}
{com}. pwd
{res}/Users/Myworld/Dropbox/ExpProject/workingfolder/SurveyData
{txt}
{com}. set more off 
{txt}
{com}. capture log close
{smcl}
{com}{sf}{ul off}