{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/ExpProject/workingfolder/SCEirf_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}26 Jun 2019, 23:30:15
{txt}
{com}. 
. 
. 
. *****************************
. ***      IR Analysis     ****
. *****************************
. 
. use "${c -(}mainfolder{c )-}/OtherData/InfShocksMClean.dta",clear  
{txt}
{com}. 
. merge 1:1 year month using "${c -(}folder{c )-}/InfExpM.dta",keep(match using master)
{res}{txt}{p 0 7 2}
(note: variable
year was 
float, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              26
{txt}{col 9}from master{col 30}{res}              25{txt}  (_merge==1)
{col 9}from using{col 30}{res}               1{txt}  (_merge==2)

{col 5}matched{col 30}{res}             855{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge InfExp_merge
{res}{txt}
{com}. 
. drop if month==. 
{txt}(1 observation deleted)

{com}. 
. 
. ** Period filter   
. ** i.e. Coibion et al2012. 1976-2007. But Density data is only avaiable after 2007.
. 
. *keep if year > 2007
. *keep if year>=1976 & year <= 2007
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1946m1 to 2019m4
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. 
.  
. /*
> ** Plot all shocks for checking 
> 
> twoway (tsline op_shock) ///
>         (tsline mp1ut_shock) (tsline ED8ut_shock) ///
>                 (tsline CPIAU_uid_shock) if mp1ut_shock!=., ///
>                 title("Shocks to Inflation",size(4)) ///
>                 xtitle("Time") ytitle("") ///
>                 legend(cols(1)) 
>                 
> graph export "${c -(}sum_graph_folder{c )-}/inf_shocksM", as(png) replace
> 
> 
> ** First-run of inflation 
> 
> eststo clear
> foreach sk in op mp1ut ED4ut ED8ut{c -(}
>   foreach Inf in CPIAU CPICore PCEPI{c -(} 
>    eststo `Inf'_`sk': reg Inf1y_`Inf' l(0/1).`sk'_shock, robust
>    eststo `Inf'_uid: reg Inf1y_`Inf' l(0/1).`Inf'_uid_shock,robust 
>  {c )-}
> {c )-}
> esttab using "${c -(}sum_table_folder{c )-}/IRFM.csv", mtitles se r2 replace
> 
> 
> ** IRF of inflation (one shock each time) 
> 
> eststo clear
> foreach sk in op mp1ut ED4ut ED8ut{c -(}
>   foreach Inf in CPIAU CPICore PCEPI{c -(} 
>    var Inf1y_`Inf', lags(1/4) exo(l(0/1).`sk'_shock)
>    set seed 123456
>    irf create irf1, set(irf,replace) step(10) bsp
>    irf graph dm, impulse(`sk'_shock)
>    graph export "${c -(}sum_graph_folder{c )-}/irf/`Inf'_`sk'M", as(png) replace
>  {c )-}
> {c )-}
> 
> 
> 
> ***********************************************
> ** IRF of inflation (MP shocks at one time) **
> ***********************************************
> 
> eststo clear
> 
> foreach Inf in CPIAU PCEPI{c -(} 
>    var Inf1y_`Inf', lags(1/4) ///
>                      exo(l(0/1).op_shock ///
>                                          l(0/1).mp1ut_shock l(0/1).ED8ut_shock)   
>    set seed 123456
>    irf create irf1, set(irf,replace) step(10) bsp replace 
>    irf graph dm, impulse(mp1ut_shock ED8ut_shock) ///
>                  byopts(title("`mom'") yrescale xrescale note("")) ///
>                  legend(col(2) order(1 "95% CI" 2 "IRF") symx(*.5) size(vsmall)) ///
>                                  xtitle("Month") 
>    graph export "${c -(}sum_graph_folder{c )-}/irf/`Inf'_ashocksM", as(png) replace
> 
> {c )-}
> 
> 
> 
> ***********************************************
> ** IRF of inflation (all shocks exl MP at one time) **
> ***********************************************
> 
> 
> eststo clear
> 
> foreach Inf in CPIAU CPICore PCEPI{c -(} 
>    var Inf1y_`Inf', lags(1/4) ///
>                      exo(l(0/1).op_shock)   
>    set seed 123456
>    irf create irf1, set(irf,replace) step(10) bsp replace 
>    irf graph dm, impulse(op_shock) ///
>                  byopts(title("`mom'") yrescale xrescale note("")) ///
>                  legend(col(2) order(1 "95% CI" 2 "IRF") symx(*.5) size(vsmall)) ///
>                                  xtitle("Month") 
>    graph export "${c -(}sum_graph_folder{c )-}/irf/`Inf'_ashocks_nmpM", as(png) replace
> 
> {c )-}
> 
> 
> 
> ****************************************************
> ** IRF of SCE moments (MP shocks at one time)    **
> ****************************************************
> 
> 
> foreach mom in FE{c -(}
>    foreach var in SCE{c -(}
>        * shocks 
>        capture var `var'_`mom', lags(1/4) ///
>                      exo(l(0/1).op_shock ///
>                                          l(0/1).mp1ut_shock l(0/1).ED8ut_shock)
>    set seed 123456
>    capture irf create `var', set(`mom',replace) step(10) bsp replace 
> {c )-}
>  
>    capture irf graph dm, impulse(mp1ut_shock ED8ut_shock) ///
>                          byopts(col(2) title("`mom'") yrescale /// 
>                                                  xrescale note("")) legend(col(2) /// 
>                                                  order(1 "95% CI" 2 "IRF") symx(*.5) size(vsmall))  ///
>                                                  xtitle("Month") 
>    capture graph export "${c -(}sum_graph_folder{c )-}/irf/moments/SCE`mom'_ashocksM", as(png) replace
> {c )-}
> 
> 
> *********************************************************
> ** IRF of SPF moments (MP shocks(abs) at one time)    **
> *********************************************************
> 
> 
> foreach mom in Disg Var{c -(}
>    foreach var in SCE{c -(}
>        * shocks 
>        capture var `var'_`mom', lags(1/4) ///
>                      exo(l(0/1).op_shock l(0/1).mp1ut_shock l(0/1).ED8ut_shock ///
>                                          l(0/1).op_abshock l(0/1).mp1ut_abshock l(0/1).ED8ut_abshock)
>    set seed 123456
>    capture irf create `var', set(`mom',replace) step(10) bsp replace 
> {c )-}
>  
>    capture irf graph dm, impulse(mp1ut_abshock ED8ut_abshock) ///
>                          byopts(col(2) title("`mom'") yrescale /// 
>                                                  xrescale note("") ) legend(col(2) /// 
>                                                  order(1 "95% CI" 2 "IRF") symx(*.5) size(vsmall))  ///
>                                                  xtitle("Month") xtick(0(1)10)
>    capture graph export "${c -(}sum_graph_folder{c )-}/irf/moments/SCE`mom'_ab_ashocksM", as(png) replace
> {c )-}
> */
. 
. ***********************************************************
. ** IRF of SPF moments (all shocks exl MP at one time)    **
. ***********************************************************
. 
. 
. foreach mom in FE{c -(}
{txt}  2{com}.    foreach var in SCE{c -(}
{txt}  3{com}.            capture var `var'_`mom', lags(1/4) ///
>                      exo(l(0/1).op_shock) 
{txt}  4{com}.    set seed 123456
{txt}  5{com}.    capture irf create `var'_nmp, set(`mom'_nmp,replace) step(10) bsp replace  
{txt}  6{com}. {c )-}
{txt}  7{com}.    capture irf graph dm, impulse(op_shock) ///
>                          byopts(title("`mom'") yrescale /// 
>                                                  xrescale note("")) legend(col(2) /// 
>                                                  order(1 "95% CI" 2 "IRF") symx(*.5) size(vsmall))  ///
>                                                  xtitle("Month") 
{txt}  8{com}.    capture graph export "${c -(}sum_graph_folder{c )-}/irf/moments/SCE`mom'_ashocks_nmpM", as(png) replace
{txt}  9{com}. {c )-}
{txt}
{com}. 
. 
. ****************************************************************
. ** IRF of SPF moments (all shocks(abs) exl MP at one time)    **
. ****************************************************************
. 
. 
. foreach mom in Disg Var{c -(}
{txt}  2{com}.    foreach var in SCE{c -(}
{txt}  3{com}.        * shocks 
.        capture var `var'_`mom', lags(1/4) ///
>                      exo(l(0/1).op_abshock)
{txt}  4{com}.    set seed 123456
{txt}  5{com}.    capture irf create `var'_nmp, set(`mom'_nmp,replace) step(10) bsp replace 
{txt}  6{com}. {c )-}
{txt}  7{com}.  
.    capture irf graph dm, impulse(op_abshock) ///
>                          byopts(title("`mom'") yrescale /// 
>                                                  xrescale note("")) legend(col(2) /// 
>                                                  order(1 "95% CI" 2 "IRF") symx(*.5) size(vsmall))  ///
>                                                  xtitle("Month") 
{txt}  8{com}.    capture graph export "${c -(}sum_graph_folder{c )-}/irf/moments/SCE`mom'_ab_ashocks_nmpM", as(png) replace
{txt}  9{com}. {c )-}
{txt}
{com}. ddd
{err}unrecognized command:  ddd
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. do "/Users/Myworld/Dropbox/ExpProject/workingfolder/DoFile/Step01_CleaningSCE&hist.do"
{txt}
{com}. 
. clear
{txt}
{com}. global mainfolder "/Users/Myworld/Dropbox/ExpProject/workingfolder"
{txt}
{com}. global folder "${c -(}mainfolder{c )-}/SurveyData/"
{txt}
{com}. global sum_graph_folder "${c -(}mainfolder{c )-}/graphs/pop"
{txt}
{com}. global sum_table_folder "${c -(}mainfolder{c )-}/tables"
{txt}
{com}. 
. cd ${c -(}folder{c )-}
{res}/Users/Myworld/Dropbox/ExpProject/workingfolder/SurveyData
{txt}
{com}. pwd
{res}/Users/Myworld/Dropbox/ExpProject/workingfolder/SurveyData
{txt}
{com}. set more off 
{txt}
{com}. 
. append using "${c -(}folder{c )-}/SCE/NYFED_SCE_2014_2016.dta",force
{txt}
{com}. append using  "${c -(}folder{c )-}/SCE/NYFED_SCE_post2016.dta",force
{txt}{p 0 7 2}
(note: variable
Q3 was 
byte, now int to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
Q32 was 
int, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
DHH2_11_other was 
str48, now str83 to accommodate using data's values)
{p_end}

{com}. 
. 
. sort date
{txt}
{com}. unique userid
{txt}Number of unique values of userid is  {res}9961
{txt}Number of records is  {res}68887
{txt}
{com}. 
. ********************
. *** Date format ****
. ********************
. gen date_str = string(date)
{txt}
{com}. gen year = substr(date_str,1,4)
{txt}
{com}. gen month = substr(date_str,5,2)
{txt}
{com}. gen date2=year+"m"+month
{txt}
{com}. gen date3= monthly(date2,"YM")
{txt}
{com}. format date3 %tm
{txt}
{com}. drop date_str date2 date
{txt}
{com}. rename date3 date
{res}{txt}
{com}. destring year, replace
{txt}year has all characters numeric; {res}replaced {txt}as {res}int
{txt}
{com}. destring month, replace 
{txt}month has all characters numeric; {res}replaced {txt}as {res}byte
{txt}
{com}. order date year month
{txt}
{com}. xtset userid date
{res}{txt}{col 8}panel variable:  {res}userid (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2014m1 to 2018m5, but with gaps
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. 
. **********************
. ** Label variables ***
. **********************
. 
. label var Q1 "finance better or worser(5 vals) from y-1 to y"
{txt}
{com}. label var Q2 "finance better or worser(5 vals) from y to y+1"
{txt}
{com}. label var Q3 "chance of moving (%)"
{txt}
{com}. label var Q4new "chance of UE higher from y to y+1(0-1)"
{txt}
{com}. label var Q5new "chance of saving interest rate higher from y to y+1(%)"
{txt}
{com}. label var Q6new "chance of stock market up from y to y+1(%)"
{txt}
{com}. label var Q8v2 "inflation or deflation from y to y+1 (1/0)"
{txt}
{com}. label var Q8v2part2 "inflation(or deflation) from y to y+1 (%) "
{txt}
{com}. label var Q9_cent25 "25 percentile of inflation from y to y+1(%)"
{txt}
{com}. label var Q9_cent50 "50 percentile of inflation from y to y+1(%)"
{txt}
{com}. label var Q9_cent75 "75 percentile of inflation from y to y+1(%)"
{txt}
{com}. label var Q9_var "var of inflation from y to y+1"
{txt}
{com}. label var Q9_iqr "25/75 inter-quantile range of inflation from y to y+1(%)"
{txt}
{com}. label var Q9_mean "mean of inflation from y to y+1(%)"
{txt}
{com}. label var Q9_probdeflation "prob of deflation from y to y+1 (0-1)"
{txt}
{com}. label var Q9_bin1 "density: >12% inflation from y to y+1(%)"
{txt}
{com}. label var Q9_bin2 "density: 8%-12% inflation from y to y+1(%)"
{txt}
{com}. label var Q9_bin3 "density: 4%-8% inflation from y to y+1(%)"
{txt}
{com}. label var Q9_bin4 "density: 2%-4% inflation from y to y+1(%)"
{txt}
{com}. label var Q9_bin5 "density: 0%-2% inflation from y to y+1(%)"
{txt}
{com}. label var Q9_bin6 "density: -2%-0% inflation from y to y+1(%)"
{txt}
{com}. label var Q9_bin7 "density: -4%- -2% inflation from y to y+1(%)"
{txt}
{com}. label var Q9_bin8 "density: -8%--4% inflation from y to y+1(%)"
{txt}
{com}. label var Q9_bin9 "density: -12%- -8% inflation from y to y+1(%)"
{txt}
{com}. label var Q9_bin10 "density: <-12% inflation from y to y+1(%)"
{txt}
{com}. label var Q9bv2 "inflation or deflation from y+1 to y+2 (1/0)"
{txt}
{com}. label var Q9bv2part2 "inflation(or deflation) from y+1 to y+2 (%)"
{txt}
{com}. label var Q9c_cent25 "25 percentile of inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_cent50 "50 percentile of inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_cent75 "75 percentile of inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_var "var of inflation from y+1 to y+2"
{txt}
{com}. label var Q9c_mean "mean of inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_iqr "25/75 inter-quantile range of inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_probdeflation "prob of deflation from y+1 to y+2 (0-1)"
{txt}
{com}. label var Q9c_bin1 "density: >12% inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_bin2 "density: 8%-12% inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_bin3 "density: 4%-8% inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_bin4 "density: 2%-4% inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_bin5 "density: 0%-2% inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_bin6 "density: -2%-0% inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_bin7 "density: -4%- -2% inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_bin8 "density: -8%--4% inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_bin9 "density: -12%- -8% inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_bin10 "density: <-12% inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q10_1 "current empsituations:full-time"
{txt}
{com}. label var Q10_2 "current emp situations:part-time"
{txt}
{com}. label var Q10_3 "current emp situations: not working but wants to work"
{txt}
{com}. label var Q10_4 "current emp situations: temporary laid-off"
{txt}
{com}. label var Q10_5 "current emp situations: on sick or other leave"
{txt}
{com}. label var Q10_6 "current emp situations: permanently disabled/unable to work"
{txt}
{com}. label var Q10_7 "current emp situations: retiree or early retiree"
{txt}
{com}. label var Q10_8 "current emp situations: student or in training"
{txt}
{com}. label var Q10_9 "current emp situations: homemaker"
{txt}
{com}. label var Q10_10 "current emp situations: others"
{txt}
{com}. label var Q11 "number of jobs"
{txt}
{com}. label var Q12new "work for someone or self-employed(1/0)"
{txt}
{com}. label var ES1_1 ""
{txt}
{com}. label var ES1_2 ""
{txt}
{com}. label var ES1_3 ""
{txt}
{com}. label var ES1_4 ""
{txt}
{com}. label var ES2 ""
{txt}
{com}. label var ES3new ""
{txt}
{com}. label var ES4 ""
{txt}
{com}. label var ES5 ""
{txt}
{com}. label var Q13new "chance of losing job from y to y+1(%)"
{txt}
{com}. label var Q14new "chance of voluntarily leaving the job from y to y+1(%)"
{txt}
{com}. label var Q15 "currently looking for a job (1/0)"
{txt}
{com}. label var Q16 "duration of unemployment (months)"
{txt}
{com}. label var Q17new "chance of finding and accepting a job from y to y+1(%)"
{txt}
{com}. label var Q18new "chance of finding and accepting a job from m to m+3"
{txt}
{com}. label var Q19 "duration of out of work(%)"
{txt}
{com}. label var Q20new "chance of starting looking for a job from y to y+1(%)"
{txt}
{com}. label var Q21new "chance of starting looking for a job from m to m+3(%)"
{txt}
{com}. label var Q22new ""
{txt}
{com}. label var Q23v2 ""
{txt}
{com}. label var Q23v2part2 ""
{txt}
{com}. label var Q24_cent25 "25 percentile of earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_cent50 "50 percentile of earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_cent75 "75 percentile of earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_var "var of earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_mean "mean of earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_iqr "25/75 inter-quantile range of earning growth of same job/time/place from y to y+1(%)"
{txt}note: label truncated to 80 characters

{com}. label var Q24_probdeflation "???"
{txt}
{com}. label var Q24_bin1 ">12% earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_bin2 "8%-12% earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_bin3 "4%-8% earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_bin4 "2%-4% earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_bin5 "0-2% earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_bin6 "-2%-0 earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_bin7 "-4%- -2% earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_bin8 "-8% - -4% earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_bin9 "-12%- -8% earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_bin10 "<-12% earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q25v2 "increase/decrease of total household income from y to y+1(1/0)"
{txt}
{com}. label var Q25v2part2 "increase of total household income from y to y+1(%)"
{txt}
{com}. label var Q26v2 "increase/decrease of total household spending from y to y+1(1/0)"
{txt}
{com}. label var Q26v2part2 "increase of total household spending from y to y+1(%)"
{txt}
{com}. label var Q27v2 "increase/decrease of total household tax payment given the same income (1/0)"
{txt}
{com}. label var Q27v2part2 "increase of total household tax payment given the same income (%)"
{txt}
{com}. label var Q28 "easier/harder to get credit/loan from y-1 to y(1-5)"
{txt}
{com}. label var Q29 "easier/harder to get credit/loan from y to y+1(1-5)"
{txt}
{com}. label var Q30new "chance of non-payment of debt from m to m+3(%)"
{txt}
{com}. label var Q31v2 "increase/decrease of nationwide house price(1/0)"
{txt}
{com}. label var Q31v2part2 "increase of nationwide house price(%)"
{txt}
{com}. label var C1_cent25 "25 percentile of increase of nationwide house price(%)"
{txt}
{com}. label var C1_cent50 "50 percentile of increase of nationwide house price(%)"
{txt}
{com}. label var C1_cent75 "75 percentile of increase of nationwide house price(%)"
{txt}
{com}. label var C1_var "var of increase of nationwide house price"
{txt}
{com}. label var C1_mean "mean of increase of nationwide house price(%)"
{txt}
{com}. label var C1_iqr "25/75 inter-quantile range  of increase of nationwide house price(%)"
{txt}
{com}. label var C1_probdeflation "??"
{txt}
{com}. label var C1_bin1 ">12% increase in nationwide house price(%)"
{txt}
{com}. label var C1_bin2 "8%-12% increase in nationwide house price(%)"
{txt}
{com}. label var C1_bin3 "4%-8% increase in nationwide house price(%)"
{txt}
{com}. label var C1_bin4 "2%-4% increase in nationwide house price(%)"
{txt}
{com}. label var C1_bin5 "0-2% increase in nationwide house price(%)"
{txt}
{com}. label var C1_bin6 "-2%-0% increase in nationwide house price(%)"
{txt}
{com}. label var C1_bin7 "-4%- -2% increase in nationwide house price(%)"
{txt}
{com}. label var C1_bin8 "-8%- -4% increase in nationwide house price(%)"
{txt}
{com}. label var C1_bin9 "-12%- -8% increase in nationwide house price(%)"
{txt}
{com}. label var C1_bin10 "<-12% increase in nationwide house price(%)"
{txt}
{com}. label var C2 "increase/decrease in nationwide house price from y+1 to y+2(1/0)"
{txt}
{com}. label var C2part2 "increase in nationwide house price from y+1 to y+2(%)"
{txt}
{com}. label var C3 "increase/decrease of U.S. gov debt from y to y+1(1/0)"
{txt}
{com}. label var C3part2"increase of U.S. gov debt from y to y+1(%)"
{txt}
{com}. label var C4_1 "increase of a gallon of gas from y to y+1(%)"
{txt}
{com}. label var C4_2 "increase of food price from y to y+1(%)"
{txt}
{com}. label var C4_3 "increase of a medical care from y to y+1(%)"
{txt}
{com}. label var C4_4 "increase of college education from y to y+1(%)"
{txt}
{com}. label var C4_5 "increase of price of renting a typical house/apt from y to y+1(%)"
{txt}
{com}. label var C4_6  "increase of gold price from y to y+1(%)"
{txt}
{com}. label var QNUM1 "num q 1: (correct if ==150)"
{txt}
{com}. label var QNUM2 ""
{txt}
{com}. label var QNUM3 ""
{txt}
{com}. label var QNUM5 ""
{txt}
{com}. label var QNUM6 ""
{txt}
{com}. label var QNUM8 ""
{txt}
{com}. label var QNUM9 ""
{txt}
{com}. label var Q32 "age(in years)"
{txt}
{com}. label var Q33 "gender"
{txt}
{com}. label var Q34 "hispanic/latino/spanish(1/0)"
{txt}
{com}. label var Q35_1 "race: white"
{txt}
{com}. label var Q35_2 "race: black/african american"
{txt}
{com}. label var Q35_3 "race: american indian/alaska native"
{txt}
{com}. label var Q35_4 "race: asian"
{txt}
{com}. label var Q35_5 "race: native hawaiian or other pacific islander"
{txt}
{com}. label var Q35_6 "race: other"
{txt}
{com}. label var Q36 "education (1-8 low to high, 9 other)"
{txt}
{com}. label var Q37 "months of current work"
{txt}
{com}. label var Q38 "living with partner/not (1/0)"
{txt}
{com}. label var HH2_1 "emp of partner: full-time for someone"
{txt}
{com}. label var HH2_2 "emp of partner: part-time for someone"
{txt}
{com}. label var HH2_3 "emp of partner: self-employed"
{txt}
{com}. label var HH2_4 "emp of partner: not working but wants to work"
{txt}
{com}. label var HH2_5 "emp of partner: temporary laid-off"
{txt}
{com}. label var HH2_6 "emp of partner: on sick or other leave"
{txt}
{com}. label var HH2_7 "emp of partner: permanently disabled/unable to work"
{txt}
{com}. label var HH2_8 "emp of partner: retiree or early retiree"
{txt}
{com}. label var HH2_9 "emp of partner: student or in training"
{txt}
{com}. label var HH2_10 "emp of partner: homemaker"
{txt}
{com}. label var HH2_10 "emp of partner: other"
{txt}
{com}. label var _STATE "state (2-digit code)"
{txt}
{com}. label var Q41 "years of living in the current residence"
{txt}
{com}. label var Q42 "years of living in the current states"
{txt}
{com}. label var Q43 "own/rent/other a house(1/2/3)"
{txt}
{com}. label var Q43a "my/spounser/both's name under which current residence is owned/rent"
{txt}
{com}. label var Q44 "own other homes(1/0)"
{txt}
{com}. label var Q45b "health condition(1-5 from good to poor)"
{txt}
{com}. label var Q45new_1 ""
{txt}
{com}. label var Q45new_2 ""
{txt}
{com}. label var Q45new_3 ""
{txt}
{com}. label var Q45new_4 ""
{txt}
{com}. label var Q45new_5 ""
{txt}
{com}. label var Q45new_6 ""
{txt}
{com}. label var Q45new_7 ""
{txt}
{com}. label var Q45new_8 ""
{txt}
{com}. label var Q45new_9 ""
{txt}
{com}. label var Q46 "financial decision making of household(1-5, together to individual)"
{txt}
{com}. label var Q47 "total pre-tax household income from y-1 to y(1-11, low to high)"
{txt}
{com}. label var D1 "same household as last year(1/0)"
{txt}
{com}. label var D3 "date of moving to the current residence(month/year)"
{txt}
{com}. label var D6 "total pre-tax household income from y-1 to y(1-11,low to high)"
{txt}
{com}. label var D2new_1 "memeber in the current resident:spounse/partner"
{txt}
{com}. label var D2new_2 "memeber in the current resident: child >25"
{txt}
{com}. label var D2new_3 "memeber in the current resident: child 18-24"
{txt}
{com}. label var D2new_4 "memeber in the current resident: child 6-17"
{txt}
{com}. label var D2new_5 "memeber in the current resident: child <=5 "
{txt}
{com}. label var D2new_6 "memeber in the current resident: own/sponse's parents"
{txt}
{com}. label var D2new_7 "memeber in the current resident:other relatives"
{txt}
{com}. label var D2new_8 "memeber in the current resident:non-relatives"
{txt}
{com}. label var DSAME "same job as last year in survey"
{txt}
{com}. label var DQ38 "living as a partner or married with some one(1/0)"
{txt}
{com}. label var Q48 "interesting/uninteresting of the questions in the survey(1/0)"
{txt}
{com}. 
. 
. *************************
. *** Exclude outliers *****
. *************************
. 
. local Moments Q9_mean Q9_var
{txt}
{com}. 
. foreach var in `Moments'{c -(}
{txt}  2{com}.       egen `var'p5=pctile(`var'),p(5)
{txt}  3{com}.           egen `var'p95=pctile(`var'),p(95)
{txt}  4{com}.           replace `var' = . if `var' <`var'p5 | (`var' >`var'p95 & `var'!=.)
{txt}  5{com}. {c )-}
{txt}(6528 real changes made, 6528 to missing)
(5096 real changes made, 5096 to missing)

{com}. 
. *************************
. *** Other Measures *****
. *************************
. 
. egen Q9_sd = sd(Q9_mean), by(date)
{txt}
{com}. gen Q9_disg = Q9_sd^2
{txt}
{com}. label var Q9_disg "Disagreements of 1-yr-ahead expted inflation"
{txt}
{com}. 
. 
. foreach mom in mean var{c -(}
{txt}  2{com}.      egen Q9_`mom'p75 =pctile(Q9_`mom'),p(75) by(year month)
{txt}  3{com}.          egen Q9_`mom'p25 =pctile(Q9_`mom'),p(25) by(year month)
{txt}  4{com}.          egen Q9_`mom'p50 =pctile(Q9_`mom'),p(50) by(year month)
{txt}  5{com}.          local lb: variable label Q9_`mom'
{txt}  6{com}.          label var Q9_`mom'p75 "`lb': 75 pctile"
{txt}  7{com}.          label var Q9_`mom'p25 "`lb': 25 pctile"
{txt}  8{com}.          label var Q9_`mom'p50 "`lb': 50 pctile"
{txt}  9{com}. {c )-}
{txt}
{com}. 
. 
. save "${c -(}folder{c )-}/SCE/InfExpSCEProbIndM",replace 
{txt}file /Users/Myworld/Dropbox/ExpProject/workingfolder/SurveyData//SCE/InfExpSCEProbIndM.dta saved

{com}. 
. ***************************************
. **   Histograms of Moments  ***********
. ** Maybe replaced by kernel desntiy **
. ***************************************
. 
. gen SCE_mean = .
{txt}(68887 missing values generated)

{com}. gen SCE_var = .
{txt}(68887 missing values generated)

{com}. 
. 
. * Kernal density plot only 
. 
.  foreach var in SCE{c -(}
{txt}  2{com}.  foreach mom in mean{c -(}
{txt}  3{com}.     replace `var'_`mom' = Q9_`mom'
{txt}  4{com}.         local lb: variable label Q9_`mom'
{txt}  5{com}.     twoway (kdensity `var'_`mom',lcolor(red) lwidth(thick) ), ///
>                by(year,title("Distribution of `lb'",size(med)) note("")) xtitle("Mean forecast") ///
>                    ytitle("Fraction of population")
{txt}  6{com}.         graph export "${c -(}sum_graph_folder{c )-}/hist/`var'`mom'_hist", as(png) replace 
{txt}  7{com}. {c )-}
{txt}  8{com}. {c )-}
{txt}(60852 real changes made)
{p 0 4 2}
{txt}(note:  named style
med not found in class
gsize,  default attributes used)
{p_end}
{res}{txt}(file /Users/Myworld/Dropbox/ExpProject/workingfolder/graphs/pop/hist/SCEmean_hist written in PNG format)

{com}. 
. * Kernal density plot only 
. foreach mom in var{c -(}
{txt}  2{com}. foreach var in SCE{c -(}
{txt}  3{com}.     replace `var'_`mom' = Q9_`mom'
{txt}  4{com}.         local lb: variable label Q9_`mom'
{txt}  5{com}.     twoway (kdensity `var'_`mom',lcolor(blue) lwidth(thick)), ///
>                by(year,title("Distribution of `lb'",size(med)) note("")) xtitle("Uncertainty") ///
>                    ytitle("Fraction of population")
{txt}  6{com}.         graph export "${c -(}sum_graph_folder{c )-}/hist/`var'`mom'_hist", as(png) replace 
{txt}  7{com}. {c )-}
{txt}  8{com}. {c )-}
{txt}(62284 real changes made)
{p 0 4 2}
{txt}(note:  named style
med not found in class
gsize,  default attributes used)
{p_end}
{res}{txt}(file /Users/Myworld/Dropbox/ExpProject/workingfolder/graphs/pop/hist/SCEvar_hist written in PNG format)

{com}. 
. 
. *************************
. *** Population SCE ******
. *************************
. 
. 
. local Moments Q9_mean Q9_var Q9_iqr Q9_cent50 Q9_disg
{txt}
{com}. local MomentsMom Q9_meanp25 Q9_meanp50 Q9_meanp75 Q9_varp25 Q9_varp50 Q9_varp75
{txt}
{com}. 
. 
. collapse (mean) `Moments' `MomentsMom', by(date year month)
{txt}
{com}. 
. label var Q9_mean "Average 1-yr-ahead Expected Inflation(%)"
{txt}
{com}. label var Q9_var "Average Uncertainty of 1-yr-ahead Expected Inflation"
{txt}
{com}. label var Q9_iqr "Average 25/75 IQR of 1-yr-ahead Expected Inflation(%)"
{txt}
{com}. label var Q9_cent50 "Average Median of 1-yr-ahead Expected Inflation(%)"
{txt}
{com}. label var Q9_disg "Disagreements of 1-yr-ahead Expected Inflation"
{txt}
{com}. 
. 
. save "${c -(}folder{c )-}/SCE/InfExpSCEProbPopM",replace 
{txt}file /Users/Myworld/Dropbox/ExpProject/workingfolder/SurveyData//SCE/InfExpSCEProbPopM.dta saved

{com}. 
. 
. 
. 
. 
. 
{txt}end of do-file

{com}. clear

. do "/Users/Myworld/Dropbox/ExpProject/workingfolder/DoFile/Step01_CleaningSCE&hist.do"
{txt}
{com}. 
. clear
{txt}
{com}. global mainfolder "/Users/Myworld/Dropbox/ExpProject/workingfolder"
{txt}
{com}. global folder "${c -(}mainfolder{c )-}/SurveyData/"
{txt}
{com}. global sum_graph_folder "${c -(}mainfolder{c )-}/graphs/pop"
{txt}
{com}. global sum_table_folder "${c -(}mainfolder{c )-}/tables"
{txt}
{com}. 
. cd ${c -(}folder{c )-}
{res}/Users/Myworld/Dropbox/ExpProject/workingfolder/SurveyData
{txt}
{com}. pwd
{res}/Users/Myworld/Dropbox/ExpProject/workingfolder/SurveyData
{txt}
{com}. set more off 
{txt}
{com}. 
. append using "${c -(}folder{c )-}/SCE/NYFED_SCE_2014_2016.dta",force
{txt}
{com}. append using  "${c -(}folder{c )-}/SCE/NYFED_SCE_post2016.dta",force
{txt}{p 0 7 2}
(note: variable
Q3 was 
byte, now int to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
Q32 was 
int, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
DHH2_11_other was 
str48, now str83 to accommodate using data's values)
{p_end}

{com}. 
. 
. sort date
{txt}
{com}. unique userid
{txt}Number of unique values of userid is  {res}9961
{txt}Number of records is  {res}68887
{txt}
{com}. 
. ********************
. *** Date format ****
. ********************
. gen date_str = string(date)
{txt}
{com}. gen year = substr(date_str,1,4)
{txt}
{com}. gen month = substr(date_str,5,2)
{txt}
{com}. gen date2=year+"m"+month
{txt}
{com}. gen date3= monthly(date2,"YM")
{txt}
{com}. format date3 %tm
{txt}
{com}. drop date_str date2 date
{txt}
{com}. rename date3 date
{res}{txt}
{com}. destring year, replace
{txt}year has all characters numeric; {res}replaced {txt}as {res}int
{txt}
{com}. destring month, replace 
{txt}month has all characters numeric; {res}replaced {txt}as {res}byte
{txt}
{com}. order date year month
{txt}
{com}. xtset userid date
{res}{txt}{col 8}panel variable:  {res}userid (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2014m1 to 2018m5, but with gaps
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. 
. **********************
. ** Label variables ***
. **********************
. 
. label var Q1 "finance better or worser(5 vals) from y-1 to y"
{txt}
{com}. label var Q2 "finance better or worser(5 vals) from y to y+1"
{txt}
{com}. label var Q3 "chance of moving (%)"
{txt}
{com}. label var Q4new "chance of UE higher from y to y+1(0-1)"
{txt}
{com}. label var Q5new "chance of saving interest rate higher from y to y+1(%)"
{txt}
{com}. label var Q6new "chance of stock market up from y to y+1(%)"
{txt}
{com}. label var Q8v2 "inflation or deflation from y to y+1 (1/0)"
{txt}
{com}. label var Q8v2part2 "inflation(or deflation) from y to y+1 (%) "
{txt}
{com}. label var Q9_cent25 "25 percentile of inflation from y to y+1(%)"
{txt}
{com}. label var Q9_cent50 "50 percentile of inflation from y to y+1(%)"
{txt}
{com}. label var Q9_cent75 "75 percentile of inflation from y to y+1(%)"
{txt}
{com}. label var Q9_var "var of inflation from y to y+1"
{txt}
{com}. label var Q9_iqr "25/75 inter-quantile range of inflation from y to y+1(%)"
{txt}
{com}. label var Q9_mean "mean of inflation from y to y+1(%)"
{txt}
{com}. label var Q9_probdeflation "prob of deflation from y to y+1 (0-1)"
{txt}
{com}. label var Q9_bin1 "density: >12% inflation from y to y+1(%)"
{txt}
{com}. label var Q9_bin2 "density: 8%-12% inflation from y to y+1(%)"
{txt}
{com}. label var Q9_bin3 "density: 4%-8% inflation from y to y+1(%)"
{txt}
{com}. label var Q9_bin4 "density: 2%-4% inflation from y to y+1(%)"
{txt}
{com}. label var Q9_bin5 "density: 0%-2% inflation from y to y+1(%)"
{txt}
{com}. label var Q9_bin6 "density: -2%-0% inflation from y to y+1(%)"
{txt}
{com}. label var Q9_bin7 "density: -4%- -2% inflation from y to y+1(%)"
{txt}
{com}. label var Q9_bin8 "density: -8%--4% inflation from y to y+1(%)"
{txt}
{com}. label var Q9_bin9 "density: -12%- -8% inflation from y to y+1(%)"
{txt}
{com}. label var Q9_bin10 "density: <-12% inflation from y to y+1(%)"
{txt}
{com}. label var Q9bv2 "inflation or deflation from y+1 to y+2 (1/0)"
{txt}
{com}. label var Q9bv2part2 "inflation(or deflation) from y+1 to y+2 (%)"
{txt}
{com}. label var Q9c_cent25 "25 percentile of inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_cent50 "50 percentile of inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_cent75 "75 percentile of inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_var "var of inflation from y+1 to y+2"
{txt}
{com}. label var Q9c_mean "mean of inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_iqr "25/75 inter-quantile range of inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_probdeflation "prob of deflation from y+1 to y+2 (0-1)"
{txt}
{com}. label var Q9c_bin1 "density: >12% inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_bin2 "density: 8%-12% inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_bin3 "density: 4%-8% inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_bin4 "density: 2%-4% inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_bin5 "density: 0%-2% inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_bin6 "density: -2%-0% inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_bin7 "density: -4%- -2% inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_bin8 "density: -8%--4% inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_bin9 "density: -12%- -8% inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q9c_bin10 "density: <-12% inflation from y+1 to y+2(%)"
{txt}
{com}. label var Q10_1 "current empsituations:full-time"
{txt}
{com}. label var Q10_2 "current emp situations:part-time"
{txt}
{com}. label var Q10_3 "current emp situations: not working but wants to work"
{txt}
{com}. label var Q10_4 "current emp situations: temporary laid-off"
{txt}
{com}. label var Q10_5 "current emp situations: on sick or other leave"
{txt}
{com}. label var Q10_6 "current emp situations: permanently disabled/unable to work"
{txt}
{com}. label var Q10_7 "current emp situations: retiree or early retiree"
{txt}
{com}. label var Q10_8 "current emp situations: student or in training"
{txt}
{com}. label var Q10_9 "current emp situations: homemaker"
{txt}
{com}. label var Q10_10 "current emp situations: others"
{txt}
{com}. label var Q11 "number of jobs"
{txt}
{com}. label var Q12new "work for someone or self-employed(1/0)"
{txt}
{com}. label var ES1_1 ""
{txt}
{com}. label var ES1_2 ""
{txt}
{com}. label var ES1_3 ""
{txt}
{com}. label var ES1_4 ""
{txt}
{com}. label var ES2 ""
{txt}
{com}. label var ES3new ""
{txt}
{com}. label var ES4 ""
{txt}
{com}. label var ES5 ""
{txt}
{com}. label var Q13new "chance of losing job from y to y+1(%)"
{txt}
{com}. label var Q14new "chance of voluntarily leaving the job from y to y+1(%)"
{txt}
{com}. label var Q15 "currently looking for a job (1/0)"
{txt}
{com}. label var Q16 "duration of unemployment (months)"
{txt}
{com}. label var Q17new "chance of finding and accepting a job from y to y+1(%)"
{txt}
{com}. label var Q18new "chance of finding and accepting a job from m to m+3"
{txt}
{com}. label var Q19 "duration of out of work(%)"
{txt}
{com}. label var Q20new "chance of starting looking for a job from y to y+1(%)"
{txt}
{com}. label var Q21new "chance of starting looking for a job from m to m+3(%)"
{txt}
{com}. label var Q22new ""
{txt}
{com}. label var Q23v2 ""
{txt}
{com}. label var Q23v2part2 ""
{txt}
{com}. label var Q24_cent25 "25 percentile of earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_cent50 "50 percentile of earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_cent75 "75 percentile of earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_var "var of earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_mean "mean of earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_iqr "25/75 inter-quantile range of earning growth of same job/time/place from y to y+1(%)"
{txt}note: label truncated to 80 characters

{com}. label var Q24_probdeflation "???"
{txt}
{com}. label var Q24_bin1 ">12% earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_bin2 "8%-12% earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_bin3 "4%-8% earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_bin4 "2%-4% earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_bin5 "0-2% earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_bin6 "-2%-0 earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_bin7 "-4%- -2% earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_bin8 "-8% - -4% earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_bin9 "-12%- -8% earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q24_bin10 "<-12% earning growth of same job/time/place from y to y+1(%)"
{txt}
{com}. label var Q25v2 "increase/decrease of total household income from y to y+1(1/0)"
{txt}
{com}. label var Q25v2part2 "increase of total household income from y to y+1(%)"
{txt}
{com}. label var Q26v2 "increase/decrease of total household spending from y to y+1(1/0)"
{txt}
{com}. label var Q26v2part2 "increase of total household spending from y to y+1(%)"
{txt}
{com}. label var Q27v2 "increase/decrease of total household tax payment given the same income (1/0)"
{txt}
{com}. label var Q27v2part2 "increase of total household tax payment given the same income (%)"
{txt}
{com}. label var Q28 "easier/harder to get credit/loan from y-1 to y(1-5)"
{txt}
{com}. label var Q29 "easier/harder to get credit/loan from y to y+1(1-5)"
{txt}
{com}. label var Q30new "chance of non-payment of debt from m to m+3(%)"
{txt}
{com}. label var Q31v2 "increase/decrease of nationwide house price(1/0)"
{txt}
{com}. label var Q31v2part2 "increase of nationwide house price(%)"
{txt}
{com}. label var C1_cent25 "25 percentile of increase of nationwide house price(%)"
{txt}
{com}. label var C1_cent50 "50 percentile of increase of nationwide house price(%)"
{txt}
{com}. label var C1_cent75 "75 percentile of increase of nationwide house price(%)"
{txt}
{com}. label var C1_var "var of increase of nationwide house price"
{txt}
{com}. label var C1_mean "mean of increase of nationwide house price(%)"
{txt}
{com}. label var C1_iqr "25/75 inter-quantile range  of increase of nationwide house price(%)"
{txt}
{com}. label var C1_probdeflation "??"
{txt}
{com}. label var C1_bin1 ">12% increase in nationwide house price(%)"
{txt}
{com}. label var C1_bin2 "8%-12% increase in nationwide house price(%)"
{txt}
{com}. label var C1_bin3 "4%-8% increase in nationwide house price(%)"
{txt}
{com}. label var C1_bin4 "2%-4% increase in nationwide house price(%)"
{txt}
{com}. label var C1_bin5 "0-2% increase in nationwide house price(%)"
{txt}
{com}. label var C1_bin6 "-2%-0% increase in nationwide house price(%)"
{txt}
{com}. label var C1_bin7 "-4%- -2% increase in nationwide house price(%)"
{txt}
{com}. label var C1_bin8 "-8%- -4% increase in nationwide house price(%)"
{txt}
{com}. label var C1_bin9 "-12%- -8% increase in nationwide house price(%)"
{txt}
{com}. label var C1_bin10 "<-12% increase in nationwide house price(%)"
{txt}
{com}. label var C2 "increase/decrease in nationwide house price from y+1 to y+2(1/0)"
{txt}
{com}. label var C2part2 "increase in nationwide house price from y+1 to y+2(%)"
{txt}
{com}. label var C3 "increase/decrease of U.S. gov debt from y to y+1(1/0)"
{txt}
{com}. label var C3part2"increase of U.S. gov debt from y to y+1(%)"
{txt}
{com}. label var C4_1 "increase of a gallon of gas from y to y+1(%)"
{txt}
{com}. label var C4_2 "increase of food price from y to y+1(%)"
{txt}
{com}. label var C4_3 "increase of a medical care from y to y+1(%)"
{txt}
{com}. label var C4_4 "increase of college education from y to y+1(%)"
{txt}
{com}. label var C4_5 "increase of price of renting a typical house/apt from y to y+1(%)"
{txt}
{com}. label var C4_6  "increase of gold price from y to y+1(%)"
{txt}
{com}. label var QNUM1 "num q 1: (correct if ==150)"
{txt}
{com}. label var QNUM2 ""
{txt}
{com}. label var QNUM3 ""
{txt}
{com}. label var QNUM5 ""
{txt}
{com}. label var QNUM6 ""
{txt}
{com}. label var QNUM8 ""
{txt}
{com}. label var QNUM9 ""
{txt}
{com}. label var Q32 "age(in years)"
{txt}
{com}. label var Q33 "gender"
{txt}
{com}. label var Q34 "hispanic/latino/spanish(1/0)"
{txt}
{com}. label var Q35_1 "race: white"
{txt}
{com}. label var Q35_2 "race: black/african american"
{txt}
{com}. label var Q35_3 "race: american indian/alaska native"
{txt}
{com}. label var Q35_4 "race: asian"
{txt}
{com}. label var Q35_5 "race: native hawaiian or other pacific islander"
{txt}
{com}. label var Q35_6 "race: other"
{txt}
{com}. label var Q36 "education (1-8 low to high, 9 other)"
{txt}
{com}. label var Q37 "months of current work"
{txt}
{com}. label var Q38 "living with partner/not (1/0)"
{txt}
{com}. label var HH2_1 "emp of partner: full-time for someone"
{txt}
{com}. label var HH2_2 "emp of partner: part-time for someone"
{txt}
{com}. label var HH2_3 "emp of partner: self-employed"
{txt}
{com}. label var HH2_4 "emp of partner: not working but wants to work"
{txt}
{com}. label var HH2_5 "emp of partner: temporary laid-off"
{txt}
{com}. label var HH2_6 "emp of partner: on sick or other leave"
{txt}
{com}. label var HH2_7 "emp of partner: permanently disabled/unable to work"
{txt}
{com}. label var HH2_8 "emp of partner: retiree or early retiree"
{txt}
{com}. label var HH2_9 "emp of partner: student or in training"
{txt}
{com}. label var HH2_10 "emp of partner: homemaker"
{txt}
{com}. label var HH2_10 "emp of partner: other"
{txt}
{com}. label var _STATE "state (2-digit code)"
{txt}
{com}. label var Q41 "years of living in the current residence"
{txt}
{com}. label var Q42 "years of living in the current states"
{txt}
{com}. label var Q43 "own/rent/other a house(1/2/3)"
{txt}
{com}. label var Q43a "my/spounser/both's name under which current residence is owned/rent"
{txt}
{com}. label var Q44 "own other homes(1/0)"
{txt}
{com}. label var Q45b "health condition(1-5 from good to poor)"
{txt}
{com}. label var Q45new_1 ""
{txt}
{com}. label var Q45new_2 ""
{txt}
{com}. label var Q45new_3 ""
{txt}
{com}. label var Q45new_4 ""
{txt}
{com}. label var Q45new_5 ""
{txt}
{com}. label var Q45new_6 ""
{txt}
{com}. label var Q45new_7 ""
{txt}
{com}. label var Q45new_8 ""
{txt}
{com}. label var Q45new_9 ""
{txt}
{com}. label var Q46 "financial decision making of household(1-5, together to individual)"
{txt}
{com}. label var Q47 "total pre-tax household income from y-1 to y(1-11, low to high)"
{txt}
{com}. label var D1 "same household as last year(1/0)"
{txt}
{com}. label var D3 "date of moving to the current residence(month/year)"
{txt}
{com}. label var D6 "total pre-tax household income from y-1 to y(1-11,low to high)"
{txt}
{com}. label var D2new_1 "memeber in the current resident:spounse/partner"
{txt}
{com}. label var D2new_2 "memeber in the current resident: child >25"
{txt}
{com}. label var D2new_3 "memeber in the current resident: child 18-24"
{txt}
{com}. label var D2new_4 "memeber in the current resident: child 6-17"
{txt}
{com}. label var D2new_5 "memeber in the current resident: child <=5 "
{txt}
{com}. label var D2new_6 "memeber in the current resident: own/sponse's parents"
{txt}
{com}. label var D2new_7 "memeber in the current resident:other relatives"
{txt}
{com}. label var D2new_8 "memeber in the current resident:non-relatives"
{txt}
{com}. label var DSAME "same job as last year in survey"
{txt}
{com}. label var DQ38 "living as a partner or married with some one(1/0)"
{txt}
{com}. label var Q48 "interesting/uninteresting of the questions in the survey(1/0)"
{txt}
{com}. 
. 
. *************************
. *** Exclude outliers *****
. *************************
. 
. local Moments Q9_mean Q9_var
{txt}
{com}. 
. foreach var in `Moments'{c -(}
{txt}  2{com}.       egen `var'p5=pctile(`var'),p(5)
{txt}  3{com}.           egen `var'p95=pctile(`var'),p(95)
{txt}  4{com}.           replace `var' = . if `var' <`var'p5 | (`var' >`var'p95 & `var'!=.)
{txt}  5{com}. {c )-}
{txt}(6528 real changes made, 6528 to missing)
(5096 real changes made, 5096 to missing)

{com}. 
. *************************
. *** Other Measures *****
. *************************
. 
. egen Q9_sd = sd(Q9_mean), by(date)
{txt}
{com}. gen Q9_disg = Q9_sd^2
{txt}
{com}. label var Q9_disg "Disagreements of 1-yr-ahead expted inflation"
{txt}
{com}. 
. 
. foreach mom in mean var{c -(}
{txt}  2{com}.      egen Q9_`mom'p75 =pctile(Q9_`mom'),p(75) by(year month)
{txt}  3{com}.          egen Q9_`mom'p25 =pctile(Q9_`mom'),p(25) by(year month)
{txt}  4{com}.          egen Q9_`mom'p50 =pctile(Q9_`mom'),p(50) by(year month)
{txt}  5{com}.          local lb: variable label Q9_`mom'
{txt}  6{com}.          label var Q9_`mom'p75 "`lb': 75 pctile"
{txt}  7{com}.          label var Q9_`mom'p25 "`lb': 25 pctile"
{txt}  8{com}.          label var Q9_`mom'p50 "`lb': 50 pctile"
{txt}  9{com}. {c )-}
{txt}
{com}. 
. 
. save "${c -(}folder{c )-}/SCE/InfExpSCEProbIndM",replace 
{txt}file /Users/Myworld/Dropbox/ExpProject/workingfolder/SurveyData//SCE/InfExpSCEProbIndM.dta saved

{com}. 
. ***************************************
. **   Histograms of Moments  ***********
. ** Maybe replaced by kernel desntiy **
. ***************************************
. 
. gen SCE_mean = .
{txt}(68887 missing values generated)

{com}. gen SCE_var = .
{txt}(68887 missing values generated)

{com}. 
. 
. * Kernal density plot only 
. label var Q9_mean "1-yr-ahed forecast of inflation "
{txt}
{com}. 
.  foreach var in SCE{c -(}
{txt}  2{com}.  foreach mom in mean{c -(}
{txt}  3{com}.     replace `var'_`mom' = Q9_`mom'
{txt}  4{com}.         local lb: variable label Q9_`mom'
{txt}  5{com}.     twoway (kdensity `var'_`mom',lcolor(red) lwidth(thick) ), ///
>                by(year,title("Distribution of `lb'",size(med)) note("")) xtitle("Mean forecast") ///
>                    ytitle("Fraction of population")
{txt}  6{com}.         graph export "${c -(}sum_graph_folder{c )-}/hist/`var'`mom'_hist", as(png) replace 
{txt}  7{com}. {c )-}
{txt}  8{com}. {c )-}
{txt}(60852 real changes made)
{p 0 4 2}
{txt}(note:  named style
med not found in class
gsize,  default attributes used)
{p_end}
{res}{txt}(file /Users/Myworld/Dropbox/ExpProject/workingfolder/graphs/pop/hist/SCEmean_hist written in PNG format)

{com}. 
. * Kernal density plot only 
. label var Q9_var "1-yr-ahed uncertainty of inflation"
{txt}
{com}. 
. foreach mom in var{c -(}
{txt}  2{com}. foreach var in SCE{c -(}
{txt}  3{com}.     replace `var'_`mom' = Q9_`mom'
{txt}  4{com}.         local lb: variable label Q9_`mom'
{txt}  5{com}.     twoway (kdensity `var'_`mom',lcolor(blue) lwidth(thick)), ///
>                by(year,title("Distribution of `lb'",size(med)) note("")) xtitle("Uncertainty") ///
>                    ytitle("Fraction of population")
{txt}  6{com}.         graph export "${c -(}sum_graph_folder{c )-}/hist/`var'`mom'_hist", as(png) replace 
{txt}  7{com}. {c )-}
{txt}  8{com}. {c )-}
{txt}(62284 real changes made)
{p 0 4 2}
{txt}(note:  named style
med not found in class
gsize,  default attributes used)
{p_end}
{res}{txt}(file /Users/Myworld/Dropbox/ExpProject/workingfolder/graphs/pop/hist/SCEvar_hist written in PNG format)

{com}. 
. ddd
{err}unrecognized command:  ddd
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. clear

. 