{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/ExpProject/workingfolder/SPFirf_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}26 Jun 2019, 22:06:48
{txt}
{com}. 
. 
. 
. *****************************
. ***      IR Analysis     ****
. *****************************
. 
. use "${c -(}mainfolder{c )-}/OtherData/InfShocksQClean.dta",clear  
{txt}
{com}. 
. 
. merge 1:1 year quarter using "${c -(}folder{c )-}/InfExpQ.dta",keep(match using master)
{res}{txt}{p 0 7 2}
(note: variable
quarter was 
long, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             146
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}             146{txt}  (_merge==2)

{col 5}matched{col 30}{res}             140{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge InfExp_merge
{res}{txt}
{com}. 
. drop if month==. 
{txt}(146 observations deleted)

{com}. drop if quarter ==.
{txt}(0 observations deleted)

{com}. 
. 
. ** Period filter   
. ** i.e. Coibion et al2012. 1976-2007. But Density data is only avaiable after 2007.
. 
. keep if year > 2007
{txt}(96 observations deleted)

{com}. *keep if year>=1976 & year <= 2007
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 2008q1 to 2018q4
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. 
.  
. 
. ** Plot all shocks for checking 
. 
. twoway (tsline pty_shock,lp(solid) lwidth(thick)) (tsline op_shock,lp(dash) lwidth(thick)) ///
>         (tsline mp1ut_shock,lp(shortdash) lwidth(thick)) (tsline ED8ut_shock,lp(dash_dot) lwidth(thick)), ///
>                 title("Shocks to Inflation",size(large)) ///
>                 xtitle("Time") ytitle("") ///
>                 legend(cols(1)) 
{res}{txt}
{com}.                 
. graph export "${c -(}sum_graph_folder{c )-}/inf_shocksQ", as(png) replace
{txt}(file /Users/Myworld/Dropbox/ExpProject/workingfolder/graphs/pop/inf_shocksQ written in PNG format)

{com}. ddd
{err}unrecognized command:  ddd
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. clear

. 